{
  "Timeline_of_computing": "Hardware 1960s to present\nSoftware configuration management\nFree and open-source software\nArtificial intelligence\nCompiler construction\nEarly computer science\nOperating systems\nProgramming languages\nProminent pioneers\nSoftware engineering\nGeneral-purpose CPUs\nGraphical user interface\nPersonal computers\nmore timelines ...\nTimeline of computing presents events in the history of computing organized by year and grouped into six topic areas: predictions and concepts, first use and inventions, hardware systems and processors, operating systems, programming languages, and new application areas.\nDetailed computing timelines: before 1950, 1950–1979, 1980–1989, 1990–1999, 2000–2009, 2010–2019, 2020–present\nGraphical timeline\nHistory of compiler construction\nHistory of computing hardware – up to third generation (1960s)\nHistory of computing hardware (1960s–present) – third generation and later\nHistory of the graphical user interface\nHistory of the Internet\nHistory of the World Wide Web\nList of pioneers in computer science\nTimeline of electrical and electronic engineering\nMicroprocessor chronology\nStephen White, A Brief History of Computing\nThe Computer History in time and space, Graphing Project, an attempt to build a graphical image of computer history, in particular operating systems.\nThe Computer Revolution/Timeline at Wikibooks\n\"File:Timeline.pdf - Engineering and Technology History Wiki\" (PDF). ethw.org. 2012. Archived (PDF) from the original on 2017-10-31. Retrieved 2018-03-03.\nVisual History of Computing 1944-2013 (archived)\nWomen in computing\nArtificial intelligence\nMachine learning\nQuantum computing and communication\nFree and open-source software\nHypertext technology\nOperating systems\nDOS family\nWindows\nLinux\nProgramming languages\nVirtualization development\nInternet conflicts\nWeb search engines\nKathleen Antonelli\nJohn Vincent Atanasoff\nEdsger W. Dijkstra\nJ. Presper Eckert\nDouglas Engelbart\nMargaret Hamilton\nDavid A. Huffman\nJohn von Neumann\nKlára Dán von Neumann\nGuido van Rossum\nBjarne Stroustrup",
  "Timeline_of_computing_1950–1979": "Hardware 1960s to present\nSoftware configuration management\nFree and open-source software\nArtificial intelligence\nCompiler construction\nEarly computer science\nOperating systems\nProgramming languages\nProminent pioneers\nSoftware engineering\nGeneral-purpose CPUs\nGraphical user interface\nPersonal computers\nmore timelines ...\nThis article presents a detailed timeline of events in the history of computing from 1950 to 1979. For narratives explaining the overall developments, see the history of computing.\nThe Z4 was replaced by ERMETH, a computer developed at the ETH in Switzerland from 1953 to 1956, one of the first electronic computers on the European continent.\nThis computer is the first to allow interactive computing, allowing users to interact with it using a keyboard and a cathode-ray tube. The Whirlwind design was later developed into SAGE, a comprehensive system of real-time computers used for early warning of air attacks.\nThe Mark 1 is a commercial version of the Manchester Mark 1 machine from the University of Manchester. The music program was written by Christopher Strachey.\nEDVAC could have new programs loaded from the tape. It was built by the Moore School of Electrical Engineering at the University of Pennsylvania, and delivered to the Ballistic Research Laboratory at Aberdeen Proving Ground.[1]\nThe development continued until 1957. It is still in use for scientific programming. Before being run, a FORTRAN program needs to be converted into a machine program by a compiler, itself a program.\nI have travelled the length and breadth of this country and talked with the best people, and I can assure you that data processing is a fad that won't last out the year.[needs context]\n— Editor in charge of business books for Prentice Hall\nRobert Noyce, who later set up Intel, also worked separately on the invention. Intel later went on to perfect the microprocessor. The patent was applied for in 1959 and granted in 1964. This patent was not accepted by Japan so Japanese businesses could avoid paying any fees, but in 1989 – after a 30-year legal battle – Japan granted the patent; so all Japanese companies paid fees up until the year 2001 – long after the patent became obsolete in the rest of the world.\nIn contrast to Kilby's germanium integrated circuit, Noyce developed a silicon integrated circuit, using Jean Hoerni's planar process.[12]\nThis machine introduced many modern architectural concepts: spooling, interrupts, pipelining, interleaved memory, virtual memory and paging. It was the most powerful machine in the world at the time of release.\nThe game ran on a DEC PDP-1. Competing players fired at each other's space ships using an early version of a joystick.\nThe mouse was not to become popular until 1983 with Apple Computer's Lisa and Macintosh and not adopted by IBM until 1987 – although compatible computers such as the Amstrad PC1512 were fitted with mice before this date.\nBut what ... is it good for?[needs context]\n— Engineer at the Advanced Computing Systems Division of IBM commenting on the microchip.\nIt was later released as C source code to aid portability, and subsequently versions are obtainable for many different computers, including the IBM PC. It and its clones (such as Linux) are still widely used on network servers and scientific workstations. Originally developed by Ken Thompson and Dennis Ritchie.\nDennis Ritchie, one of the inventors of the Unix operating system, simplifies BCPL into a language he calls B, then iterates B into C. It is a very popular language, especially for systems programming – as it is flexible and fast. C was considered a refreshing change in the computing field because it helped introduce structured programming. Inspired by C, C++, was introduced in the 1980s, and in turn helped usher in the era of object-oriented programming.\nThere is no reason anyone would want a computer in their home.[needs context]\n— Ken Olsen, founder, president, and chairman of Digital Equipment Corporation\nInformation revolution\n^ See 6502 microprocessor history\n^ Muuss, Mike (September 25, 1992). \"The History of Computing at BRL\". Retrieved February 10, 2026.\n^ Huff, Howard; Riordan, Michael (2007-09-01). \"Frosch and Derick: Fifty Years Later (Foreword)\". The Electrochemical Society Interface. 16 (3): 29. doi:10.1149/2.F02073IF. ISSN 1064-8208.\n^ US2802760A, Lincoln, Derick & Frosch, Carl J., \"Oxidation of semiconductive surfaces for controlled diffusion\", issued 1957-08-13\n^ Frosch, C. J.; Derick, L (1957). \"Surface Protection and Selective Masking during Diffusion in Silicon\". Journal of the Electrochemical Society. 104 (9): 547. doi:10.1149/1.2428650.\n^ \"Computer Pioneers – Christopher Strachey\". IEEE Computer Society. Archived from the original on 2019-05-15. Retrieved 2020-01-23.\n^ \"Reminiscences on the Theory of Time-Sharing\". jmc.stanford.edu. Archived from the original on 2018-10-23. Retrieved 2020-01-23.\n^ \"Computer – Time-sharing and minicomputers\". Encyclopedia Britannica. Archived from the original on 2015-01-02. Retrieved 2020-01-23.\n^ Gillies, James M.; Gillies, James; Gillies, James and Cailliau Robert; Cailliau, R. (2000). How the Web was Born: The Story of the World Wide Web. Oxford University Press. p. 13. ISBN 978-0-19-286207-5.\n^ Lojek, Bo (2007). History of Semiconductor Engineering. Springer Science & Business Media. p. 120. ISBN 9783540342588.\n^ Bassett, Ross Knox (2007). To the Digital Age: Research Labs, Start-up Companies, and the Rise of MOS Technology. Johns Hopkins University Press. pp. 22–23. ISBN 978-0-8018-8639-3.\n^ Atalla, M.; Kahng, D. (1960). \"Silicon-silicon dioxide field induced surface devices\". IRE-AIEE Solid State Device Research Conference.\n^ \"1959: Practical Monolithic Integrated Circuit Concept Patented | the Silicon Engine | Computer History Museum\". Archived from the original on 2019-10-24. Retrieved 2019-07-30.\n^ KAHNG, D. (1961). \"Silicon-Silicon Dioxide Surface Device\". Technical Memorandum of Bell Laboratories: 583–596. doi:10.1142/9789814503464_0076. ISBN 978-981-02-0209-5. {{cite journal}}: ISBN / Date incompatibility (help)\n^ Lojek, Bo (2007). History of Semiconductor Engineering. Berlin, Heidelberg: Springer-Verlag Berlin Heidelberg. p. 321. ISBN 978-3-540-34258-8.\n^ Molecular Electronic Computer brochure | 102646283 | Computer History Museum. Texas Instruments Incorporated (TI). 1961. Archived from the original on 2018-03-14. Retrieved 2018-03-13.\n^ \"a molecular electronic computer by ti [sic]\" (PDF). Computer History Museum. Texas Instruments. Retrieved 13 November 2025.\n^ \"history-computer.com: LINC\". Archived from the original on 2018-01-14. Retrieved 2018-01-19.\n^ \"Inductee Details – Paul Baran\". National Inventors Hall of Fame. Archived from the original on 6 September 2017. Retrieved 6 September 2017.\n^ a b \"The real story of how the Internet became so vulnerable\". Washington Post. 2015-05-30. Archived from the original on 2015-05-30. Retrieved 2020-02-18. Historians credit seminal insights to Welsh scientist Donald W. Davies and American engineer Paul Baran\n^ Baran, Paul (2002). \"The beginnings of packet switching: some underlying concepts\" (PDF). IEEE Communications Magazine. 40 (7): 42–48. Bibcode:2002IComM..40g..42B. doi:10.1109/MCOM.2002.1018006. ISSN 0163-6804. Archived (PDF) from the original on 2021-10-16. Retrieved 2021-10-16. Essentially all the work was defined by 1961, and fleshed out and put into formal written form in 1962. The idea of hot potato routing dates from late 1960.\n^ \"Paul Baran and the Origins of the Internet\". Rand. Archived from the original on 2018-09-23. Retrieved 2025-01-07.\n^ a b c Kirschenbaum, Matthew (July 2013), \"10 Most Influential Software Programs Ever\", Slate, US, archived from the original on 2015-08-29, retrieved 2015-08-15\n^ \"Inductee Details – Donald Watts Davies\". National Inventors Hall of Fame. Archived from the original on 6 September 2017. Retrieved 6 September 2017.\n^ Roberts, Dr. Lawrence G. (November 1978). \"The Evolution of Packet Switching\". Archived from the original on 2016-03-24. Retrieved 5 September 2017. Almost immediately after the 1965 meeting, Donald Davies conceived of the details of a store-and-forward packet switching system; Roberts, Dr. Lawrence G. (May 1995). \"The ARPANET & Computer Networks\". Archived from the original on 2016-03-24. Retrieved 13 April 2016. Then in June 1966, Davies wrote a second internal paper, \"Proposal for a Digital Communication Network\" In which he coined the word packet,- a small sub part of the message the user wants to send, and also introduced the concept of an \"Interface computer\" to sit between the user equipment and the packet network.\n^ Davies, Donald (2001), \"A Historical Study of the Beginnings of Packet Switching\", Computer Journal, British Computer Society, 44 (3): 152–162, doi:10.1093/comjnl/44.3.152[dead link]\n^ Roberts, Dr. Lawrence G. (November 1978). \"The Evolution of Packet Switching\" (PDF). IEEE Invited Paper. 66 (11): 1307. Bibcode:1978IEEEP..66.1307R. doi:10.1109/PROC.1978.11141. Archived (PDF) from the original on 2018-12-31. Retrieved 2017-09-17. In nearly all respects, Davies' original proposal, developed in late 1965, was similar to the actual networks being built today.\n^ Stefan Betschon: Der Zauber des Anfangs – Schweizer Computerpioniere. In: Ingenieure bauen die Schweiz. Franz Betschon et al. (editors), pp. 376–399, Verlag Neue Zuercher Zeitung, Zurich 2013, ISBN 978-3-03823-791-4\n^ Crank, Brian (August 1967). \"Wireless World Digital Computer\" (PDF). Wireless World. 73 (8): 366–372.\n^ \"Auf den Spuren der deutschen Computermaus\" [In the footsteps of the German computer mouse] (in German). Heise Verlag. 2009-04-28. Archived from the original on 2013-11-27. Retrieved 2013-01-07.\n^ \"Telefunken's 'Rollkugel'\". oldmouse.com. Archived from the original on 2013-08-08. Retrieved 2013-08-17.\n^ \"SIG-100 video terminal and mouse\". Archived from the original on 2013-08-27. Retrieved 2013-08-17.\n^ John S, Quarterman; Josiah C, Hoskins (1986). \"Notable computer networks\". Communications of the ACM. 29 (10): 932–971. doi:10.1145/6617.6618. S2CID 25341056. The first packet-switching network was implemented at the National Physical Laboratories in the United Kingdom. It was quickly followed by the ARPANET in 1969.\n^ Rayner, David; Barber, Derek; Scantlebury, Roger; Wilkinson, Peter (2001). NPL, Packet Switching and the Internet. Symposium of the Institution of Analysts & Programmers 2001. Archived from the original on 2003-08-07. Retrieved 2024-06-13. The system first went 'live' early in 1969\n^ a b Ford, Paul (April 2014), The Great Works of Software, archived from the original on 2015-08-17, retrieved 2015-08-15 – via Medium\n^ \"The man who made 'the world's first personal computer'\", BBC News, 6 November 2015, archived from the original on 23 March 2018, retrieved 21 July 2018\n^ a b Cornell University Library (2003). \"Digital Preservation and Technology Timeline\". Digital Preservation Management. US. Archived from the original on 2015-08-06. Retrieved 2017-12-07.\n^ \"50 Yeas of Innovation\". Texas Instruments. Retrieved 5 March 2025.\n^ a b IBM Archives Archived 2003-02-10 at archive.today\n^ Friedl, Paul J. (November 1983). \"SCAMP: The Missing Link In The PC's Past?\". PC. pp. 190–197. Archived from the original on 27 October 2021. Retrieved 8 January 2015.\n^ \"British Document Outlines Early Encryption Discovery\". archive.nytimes.com. Archived from the original on 2021-05-08. Retrieved 2021-05-12. The set of algorithms, equations and arcane mathematics that make up public key cryptography are a crucial technology for preserving computer privacy in and making commerce possible on the Internet. Some hail its discovery as one of the most important accomplishments of 20th-century mathematics because it allows two people to set up a secure phone call without meeting beforehand. Without it, there would be no privacy in cyberspace.\n^ Kirstein, P.T. (1999). \"Early experiences with the Arpanet and Internet in the United Kingdom\". IEEE Annals of the History of Computing. 21 (1): 38–44. Bibcode:1999IAHC...21a..38K. doi:10.1109/85.759368. S2CID 1558618.\n^ Fountain, T J (September 1980). \"Clip 4 parallel processing system\" (PDF). IEEE Proceedings. 127 (5): 219–224. Retrieved 5 March 2025.\n^ Weyhrich, Steven (28 December 2001). \"Apple II History Chapter 5, The Disk II\". Archived from the original on 1 December 2006. Retrieved 27 November 2008.\n^ Christopher Null (April 2007), \"50 Best Tech Products of All Time\", PC World, US, archived from the original on 2015-07-22, retrieved 2015-08-15\nA Brief History of Computing, by Stephen White. A computer history site; the present article is a modified version of his timeline, used with permission.\nWomen in computing\nArtificial intelligence\nMachine learning\nQuantum computing and communication\nFree and open-source software\nHypertext technology\nOperating systems\nDOS family\nWindows\nLinux\nProgramming languages\nVirtualization development\nInternet conflicts\nWeb search engines\nKathleen Antonelli\nJohn Vincent Atanasoff\nEdsger W. Dijkstra\nJ. Presper Eckert\nDouglas Engelbart\nMargaret Hamilton\nDavid A. Huffman\nJohn von Neumann\nKlára Dán von Neumann\nGuido van Rossum\nBjarne Stroustrup",
  "Timeline_of_computing_1980–1989": "Hardware 1960s to present\nSoftware configuration management\nFree and open-source software\nArtificial intelligence\nCompiler construction\nEarly computer science\nOperating systems\nProgramming languages\nProminent pioneers\nSoftware engineering\nGeneral-purpose CPUs\nGraphical user interface\nPersonal computers\nmore timelines ...\nThis article presents a detailed timeline of events in the history of computing from 1980 to 1989. For narratives explaining the overall developments, see the history of computing.\nTim Paterson's DOS 1.0 was 4000 lines of assembler.\nRoland releases the drum machine TR-808 which would end up revolutionizing music of all genres in the 1980s to a more electronic/futuristic sound.[5]\nThe drum machine Linn LM-1, also released in 1980, was the more expensive alternative to the TR-808. It became a staple of 1980s pop music.[6]\nMDA (Monochrome Display Adapter), text only, introduced with IBM PC.\nMS-DOS 1.0, PC DOS 1.0.\nMicrosoft (known mainly for their programming languages) were commissioned by IBM to write the operating system; they bought a program called 86-DOS from Tim Paterson which was loosely based on CP/M-80. The final program from Microsoft was marketed by IBM as PC DOS and by Microsoft as MS-DOS; collaboration on subsequent versions continued until version 5.0 in 1991.\nCompared to modern versions of DOS, version 1 was very basic. The most notable difference was the presence of just one directory, the root directory, on each disk. Subdirectories were not supported until version 2.0 (March 1983).\nMS-DOS was the main operating system for all IBM-PC compatible computers until Microsoft released Windows 95. According to Microsoft, in 1994, MS-DOS was running on some 100 million computers worldwide.\nAt introduction the fastest version ran at 12.5 MHz, achieved 2.7 MIPS and contained 134,000 transistors.\nIntroduced with the IBM XT, this version included a Unix style hierarchical sub-directory structure, and altered the way in which programs could load and access files on the disk.\nPC DOS 2.1 (for PCjr). Like the PCjr this was not a great success and quickly disappeared from the market.\nMS-DOS 2.11, MS-DOS 2.25. Version 2.25 included support for foreign character sets, and was marketed in the Far East.\nMicrosoft Windows is announced.\nApplications that came as part of the package included MacPaint, which made use of the mouse, and MacWrite, which demonstrated WYSIWYG (What You See Is What You Get) word processing.\nReleased for the IBM AT, it supported larger hard disks as well as High Density (1.2 MB) 5¼\" floppy disks.\nThis was the first version of DOS to provide network support, and provides some new functions to handle networking.\nAt the date of release the fastest version ran at 20 MHz and achieved 6.0 MIPS. It contained 275,000 transistors.\nThis version was the first to support 3½\" disks, although only the 720 KB ones. Version 3.2 remained the standard version until 1987 when version 3.3 was released with the IBM PS/2.\nThe Macintosh II was based on the newer Motorola 68020, that ran at 16 MHz and achieved a much more respectable 2.6 MIPS (comparable to an 80286). It too had a SCSI adapter but was also fitted with a colour video adapter.\nReleased with the IBM PS/2 this version included support for the High Density (1.44 MB) 3½\" disks. It also supported hard disk partitions, splitting a hard disk into 2 or more logical drives.\nAd Lib, Inc., a Canadian Company, had a virtual monopoly until 1989 when the SoundBlaster card was released.\nVersion 3.4 – 4.x are confusing due to lack of correlation between IBM and Microsoft and also the US and Europe. Several 'Internal Use only' versions were also produced.\nThis version reflected increases in hardware capabilities; it supported hard drives greater than 32 MB (up to 2 GB) and also EMS memory.\nThis version was not properly tested and was bug ridden, causing system crashes and loss of data. The original release was IBM's, but Microsoft's version 4.0 (in October) was no better and version 4.01 was released (in November) to correct this, then version 4.01a (in April 1989) as a further improvement. However many people could not trust this and reverted to version 3.3 while they waited for the complete re-write (version 5 – 3 years later). Betas of Microsoft's version 4.0 were apparently shipped as early as 1986–1987.\nThis corrected many of the bugs seen in version 4.0, but many users simply switched back to version 3.3 and waited for a properly re-written and fully tested version – which did not come until version 5 in June 1991. Support for disk partitions >32 MB.\nTim Berners-Lee submitted a further proposal on 12 November 1990 which coined the term WorldWideWeb.[25]\nLater versions, such as the DX/2 and DX/4 versions achieved internal clock rates of up to 120 MHz.\n^ \"Sinclair ZX80 Launched\". Centre for Computing History. Retrieved December 23, 2018.\n^ \"Behind a pizza-slice smile: the dark side of Pac-Man\". The Guardian. May 22, 2015. Retrieved September 22, 2017.\n^ Byte Magazine Volume 06 Number 03 - Programming Methods. 1981.\n^ \"How the CD was developed\". August 17, 2007. Retrieved February 14, 2025.\n^ \"Everything you ever wanted to know about the Roland TR-808 but were afraid to ask\". Fact. The Vinyl Factory. January 16, 2014. Retrieved January 16, 2017.\n^ McNamee, David (June 22, 2009). \"Hey, what's that sound: Linn LM-1 Drum Computer and the Oberheim DMX\". The Guardian. Retrieved February 9, 2018.\n^ Crisp, Jason (6 March 1981). \"Sinclair launches new personal computer costing only £70\". Financial Times. London. p. 6.\n^ Hogan, Thom (April 13, 1981). \"Osborne Introduces Portable Computer\". InfoWorld. Vol. 3, no. 7. IDG. pp. 1, 44. Retrieved April 4, 2011.\n^ a b Michael J. Miller (August 8, 2011). \"Why the IBM PC Had an Open Architecture\". pcmag.com. \"In some ways, the most far-reaching decision made by the team that built the IBM PC was to use an open architecture, rather than one that was proprietary to IBM. That decision led to the market for add-in boards, for large numbers of third party applications, and eventually to a large number of competitors all creating \"IBM-compatible\" machines. Bill Lowe went to IBM's Corporate Management Committee in July 1980 to propose the project\"\n^ \"rfc793\". datatracker.ietf.org. September 1981. Retrieved June 28, 2021.\n^ Feynman, Richard (June 1982). \"Simulating Physics with Computers\" (PDF). International Journal of Theoretical Physics. 21 (6/7): 467–488. Bibcode:1982IJTP...21..467F. doi:10.1007/BF02650179. S2CID 124545445. Archived from the original (PDF) on January 8, 2019. Retrieved February 28, 2019.\n^ \"CPU History - The CPU Museum - Life Cycle of the CPU\". cpushack.com. Archived from the original on July 20, 2021. Retrieved September 6, 2021.\n^ Paul Ford (April 2014), The Great Works of Software – via Medium\n^ \n\"The Quintessential Computer? Epson's QX-10 hits the high-end market.\"\nby Jim Hansen.\n\"Microcomputing\" magazine 1983 April\n^ a b Christopher Null (April 2007), \"50 Best Tech Products of All Time\", PC World, USA\n^ \"Anniversary: Is Tetris Really 40 This Year?\". Time Extension. June 24, 2024. Archived from the original on July 17, 2024. Retrieved February 14, 2025.\n^ \"Macintosh 512Ke: Specifications (Discontinued) (8/94)\". Archived from the original on May 16, 2011.\n^ Farhad Manjoo (August 2010), \"The Joy of Listservs, One of the Internet's earliest innovations is still one of its best.\", Slate, USA\n^ \"History of LISTSERV@BITNIC and LISTSERV email list management software, 1985–1995\".\n^ Duke Jr., Paul (September 9, 1986). \"Compaq to Introduce Two Computers Using Intel's State-of-the-Art 386 Chip\". The Wall Street Journal. Dow Jones & Company: 1. ProQuest 398049612.\n^ \"English: Eugene 'Gene' Mosher photographed by Barbara Mosher at the Atari Booth, ComDex, Las Vegas, Nevada on 17 November, 1986. Shown in the photograph is ViewTouch® a Graphical Touchscreen Point of Sale software running on an Atari ST computer attached to a 12\" Atari SC1224 color display which he enhanced with a MicroTouch capacitance touch screen. A Star Micronics DP8340 printer is also shown at the top of the custom wooden enclosure. The ViewTouch® widget engine used to create the application is a very early direct manipulation interface\". September 11, 2012.\n^ \"RISC revealed\". Acorn User. August 1987. p. 11. Retrieved April 26, 2021.\n^ a b c Matthew Kirschenbaum (July 2013), \"10 Most Influential Software Programs Ever\", Slate, USA\n^ Berners-Lee, Tim. \"Information Management: A Proposal\". w3.org. The World Wide Web Consortium. Archived from the original on April 1, 2010. Retrieved February 16, 2025.\n^ Berners-Lee, Tim; Cailliau, Robert (November 12, 1990). \"WorldWideWeb: Proposal for a HyperText Project\". Archived from the original on May 2, 2015. Retrieved February 16, 2025.\n^ California Secretary of State. \"Business Entity Detail: Video Electronics Standards Association\". Entity Number C1645094. Archived from the original on March 15, 2015. Retrieved July 4, 2022.To retrieve the information, search for Entity Number C1645094.\n^ Tebbutt, David (1989). \"Apple philosophy is an Oasis for users\". tebbo.com. Retrieved February 14, 2025.\nA Brief History of Computing, by Stephen White. The present article is a modified version of his timeline, used with permission.\nWomen in computing\nArtificial intelligence\nMachine learning\nQuantum computing and communication\nFree and open-source software\nHypertext technology\nOperating systems\nDOS family\nWindows\nLinux\nProgramming languages\nVirtualization development\nInternet conflicts\nWeb search engines\nKathleen Antonelli\nJohn Vincent Atanasoff\nEdsger W. Dijkstra\nJ. Presper Eckert\nDouglas Engelbart\nMargaret Hamilton\nDavid A. Huffman\nJohn von Neumann\nKlára Dán von Neumann\nGuido van Rossum\nBjarne Stroustrup",
  "Timeline_of_computing_1990–1999": "Hardware 1960s to present\nSoftware configuration management\nFree and open-source software\nArtificial intelligence\nCompiler construction\nEarly computer science\nOperating systems\nProgramming languages\nProminent pioneers\nSoftware engineering\nGeneral-purpose CPUs\nGraphical user interface\nPersonal computers\nmore timelines ...\nThis article presents a detailed timeline of events in the history of computing from 1990 to 1999. For narratives explaining the overall developments, see the history of computing.\nUnlike version 4, this version was properly tested through the distribution of beta versions to over 7,500 users.[This paragraph needs citation(s)] This version included the ability to load device drivers and TSR programs above the 640 KiB boundary (into UMBs and the HMA), freeing more RAM for programs. This version marked the end of collaboration between Microsoft and IBM on DOS.\nLinux has become one of the most widely used Unix-like operating system kernels in the world today. It originally only ran on Intel 386 processors, but years later added many different types of computers (now includes complete range from small to supercomputers and IBM mainframes), including Sun SPARC, DEC/Compaq Alpha, and many ARM, MIPS, PowerPC, and Motorola 68000 based computers.\nIn 1992, the GNU project adopted the Linux kernel for use with GNU systems while they waited for the development of their own kernel, GNU Hurd, to be completed. The GNU project's aim is to provide a complete and free Unix-like operating system, combining the Hurd or Linux kernel with a complete suite of free software to run on it. Torvalds changed the licence of the Linux kernel from one prohibiting commercial use to the GNU General Public License on February 1, 1992.\nWindows NT addresses 2 gigabytes of RAM which is more than any application will ever need\n— Microsoft on the development of Windows NT.[citation needed][needs context]\n^ \"Vision for the Future\". The Making of Microsoft: How Bill Gates and His Team Created the World's Most Successful Software Company. Prima Publishing. 1991. p. 239. ISBN 1-55958-071-2. Retrieved January 14, 2020.\n^ The History of Microsoft - 1990. Archived from the original on October 3, 2021. Retrieved February 14, 2025.\n^ \"Macintosh Classic: Technical Specifications\". support.apple.com. July 26, 2017. Archived from the original on June 12, 2013. Retrieved September 13, 2022.\n^ Berners-Lee, Tim; Cailliau, Robert (November 12, 1990). \"WorldWideWeb: Proposal for a HyperText Project\". Archived from the original on May 2, 2015. Retrieved February 16, 2025.\n^ \"Redirecting to Google Groups\".\n^ \"Philipscdi.com :: History\". www.philipscdi.com. Archived from the original on July 30, 2023. Retrieved August 8, 2022.\n^ a b c Christopher Null (April 2007), \"50 Best Tech Products of All Time\", PC World, USA\n^ Bajpai, S. K. (2007). Introduction To Computers And C Programming. New Age International. p. 96. ISBN 9788122413793.\n^ Sanglard, Fabien (2017). Game Engine Black Book: Wolfenstein 3D. Sanglard Publishing. p. 71.\n^ Kirschenbaum, Matthew (July 2013), \"10 Most Influential Software Programs Ever\", Slate, USA\n^ Stewart, William. \"Mosaic – The First Global Web Browser\". Archived from the original on July 2, 2007. Retrieved February 22, 2011.\n^ Balestri, Marcello; Lazzaretto, Stefano; Salza, Pier Luigi; Sandri, Stefano (September 22, 1993). \"The CSELT system for Italian text-to-speech synthesis\". 3rd European Conference on Speech Communication and Technology (Eurospeech 1993). pp. 2091–2094. doi:10.21437/Eurospeech.1993-468. S2CID 42744136.\n^ Patel K, Smith BC, Rowe LA (September 1, 1993). \"Performance of a software MPEG video decoder\". Proceedings of the first ACM international conference on Multimedia - MULTIMEDIA '93. ACM Multimedia. New York City: Association for Computing Machinery. pp. 75–82. doi:10.1145/166266.166274. ISBN 978-0-89791-596-0. S2CID 3773268. Archived from the original on December 15, 2021. Retrieved December 15, 2021. Reference 3 in the paper is to Committee Draft of Standard ISO/IEC 11172, December 6, 1991.\n^ p. 54, \"Intel Turns 35: Now What?\", David L. Margulius, InfoWorld, July 21, 2003, ISSN 0199-6649.\n^ p. 21, \"Architecture of the Pentium microprocessor\", D. Alpert and D. Avnon, IEEE Micro, 13, #3 (June 1993), pp. 11–21, doi:10.1109/40.216745.\n^ p. 90, \"Inside Intel\", Business Week, #3268, June 1, 1992.\n^ Adleman, L. M. (1994). \"Molecular computation of solutions to combinatorial problems\". Science. 266 (5187): 1021–1024. Bibcode:1994Sci...266.1021A. CiteSeerX 10.1.1.54.2565. doi:10.1126/science.7973651. PMID 7973651. — The first DNA computing paper. Describes a solution for the directed Hamiltonian path problem. Also available here: \"Archived copy\" (PDF). Archived from the original (PDF) on February 6, 2005. Retrieved November 21, 2005.{{cite web}}:  CS1 maint: archived copy as title (link)\n^ \"Intel Microprocessor Quick Reference Guide - Year\". www.intel.com. Retrieved January 28, 2017.\n^ a b Cornell University Library (2003). \"Digital Preservation and Technology Timeline\". Digital Preservation Management. USA. Archived from the original on August 6, 2015. Retrieved December 7, 2017.\n^ \"Nokia 8 hopes to beat Apple and Samsung with 'bothie', a new version of the selfie\". The Guardian. August 16, 2017. Retrieved September 21, 2017.\n^ \"How 'Quake' Changed Video Games Forever\". Rolling Stone. June 22, 2016. Retrieved September 21, 2017.\n^ Berger, Arthur Asa (2017). Video Games: A Popular Culture Phenomenon. Routledge. p. 58. ISBN 9781351299947.\n^ \"How 'Command & Conquer: Red Alert' Changed Strategy Games Forever\". Rolling Stone. Archived from the original on December 13, 2017. Retrieved September 21, 2017.\n^ \"Grand Prix Manager 2 for Windows (1996)\". MobyGames. Retrieved September 21, 2017.\n^ \"Affiliated Organization of Firefox and Mozilla\" (PDF). Mozilla Japan. Mozilla Foundation. 2006. Retrieved September 5, 2010.\n^ \"Audio Highway Announces the Listen UP Player -- A New Device that Delivers Personalized Audio Content to Information-Hungry, On-the-Go Consumers - Free Online Library\". Archived from the original on January 6, 2012. Retrieved January 3, 2011.\n^ Paul Thurrott (March 11, 1998). \"Windows 98 release date set: June 25\". WinInfo. Archived from the original on January 31, 2010. Retrieved February 18, 2017.\n^ \"Apple steps up to G4 Macs\". ZDNet.\nA Brief History of Computing, by Stephen White. The present article is a modified version of his timeline, used with permission.\nWomen in computing\nArtificial intelligence\nMachine learning\nQuantum computing and communication\nFree and open-source software\nHypertext technology\nOperating systems\nDOS family\nWindows\nLinux\nProgramming languages\nVirtualization development\nInternet conflicts\nWeb search engines\nKathleen Antonelli\nJohn Vincent Atanasoff\nEdsger W. Dijkstra\nJ. Presper Eckert\nDouglas Engelbart\nMargaret Hamilton\nDavid A. Huffman\nJohn von Neumann\nKlára Dán von Neumann\nGuido van Rossum\nBjarne Stroustrup",
  "Timeline_of_computing_2000–2009": "Hardware 1960s to present\nSoftware configuration management\nFree and open-source software\nArtificial intelligence\nCompiler construction\nEarly computer science\nOperating systems\nProgramming languages\nProminent pioneers\nSoftware engineering\nGeneral-purpose CPUs\nGraphical user interface\nPersonal computers\nmore timelines ...\nThis article presents a detailed timeline of events in the history of computing from 2000 to 2009. For narratives explaining the overall developments, see the history of computing.\n^ \"Windows 2000 history\". ActiveWin. Archived from the original on May 20, 2006. Retrieved April 22, 2006.\n^ Kahney, Leander. \"IBM's Got a Big, Bad Computer\". Wired.\n^ \"Microsoft Announces Immediate Availability Of Windows Millennium Edition (Windows Me)\". Microsoft PressPass – Information for Journalists. Microsoft. 2000-09-14. Archived from the original on 2012-01-09. Retrieved 2008-08-02.\n^ Tripathi, Purnendu; Mukerji, Siran (2017-06-05). Handbook of Research on Technology-Centric Strategies for Higher Education Administration. IGI Global. ISBN 9781522525493.\n^ \"Apple Introduces iTunes — World's Best and Easiest To Use Jukebox Software\". Apple Newsroom.\n^ John Broughton (2008). Wikipedia: The Missing Manual. O'Reilly. p. xv. ISBN 978-0-596-51516-4.\n^ Sanger, Larry (2005). \"The early history of Nupedia and Wikipedia: A memoir\". In Chris DiBona; Mark Stone; Danese Cooper (eds.). Open sources 2.0: The Continuing Evolution. O'Reilly. pp. 307–38. ISBN 978-0-596-55389-0.\n^ \"The Sony Librie EBR 1000 was the first e-reader with E Ink\". Good e-Reader. 16 November 2020.\n^ \"Google Gets the Message, Launches Gmail\". Google News from Google. April 1, 2004. Archived from the original on November 10, 2018. Retrieved October 27, 2018.\n^ \"NVIDIA Newsroom\". NVIDIA Newsroom.\n^ Shuttleworth, Mark (20 October 2004). \"Ubuntu 4.10 announcement\". ubuntu-announce (Mailing list). Retrieved 19 August 2008.\n^ \"Samsung Agrees to Plead Guilty and to Pay $300 Million Criminal Fine for Role in Price Fixing Conspiracy\" (Press release). US Department of Justice. 13 October 2005. Archived from the original on November 12, 2005. Retrieved 30 June 2010.\n^ Harris, Craig (September 20, 2004). \"Official Nintendo DS Launch Details\". Archived from the original on May 9, 2008. Retrieved August 13, 2007.\n^ \"Apple to Use Intel Microprocessors Beginning in 2006\". Apple. June 6, 2005. Archived from the original on January 30, 2018. Retrieved December 4, 2017.\n^ \"Microsoft to Launch Xbox 360 November 22\". pcworld.com. Retrieved 9 May 2017.\n^ \"IBM, Georgia Tech Deep Freeze for Gigahertz | News | TechNewsWorld\". www.technewsworld.com. 20 June 2006. Archived from the original on 15 November 2017. Retrieved 15 November 2017.\n^ Kanellos, Michael. \"Chip breaks speed record in deep freeze\". CNET. Archived from the original on 2017-11-15. Retrieved 2017-11-15.\n^ \"Twitter launches\". History. 28 June 2019.\n^ Krazit, Tom. \"Intel pledges 80 cores in five years\". CNET. Archived from the original on 2017-11-16. Retrieved 2017-11-15.\n^ \"Google buys YouTube for $1.65 billion\". NBC News. 9 October 2006.\n^ \"Asus Eee PC Series Announced – Laptoping\". 3 June 2013. Archived from the original on 21 October 2019. Retrieved 21 October 2019.\n^ \"Blu-ray wins the HD format war\". Centre for Computing History.\n^ \"Blu-ray vs HD DVD: Standard Format War\". ANSI. 13 May 2016.\n^ \"Announcing the Android 1.0 SDK, release 1\". Archived from the original on 2017-03-05. Retrieved 2019-10-21.\n^ \"Five Years of Bitcoin in One Post\". washingtonpost.com. Archived from the original on 14 July 2017. Retrieved 9 May 2017.\n^ Albanesius, Chloe (June 16, 2009). \"More Americans Go To Facebook Than MySpace\". PCMag.com. Archived from the original on August 14, 2020. Retrieved June 11, 2020.\n^ \"Windows 7 and Windows Server 2008 R2 Timelines Shared at Computex\". News Center. Microsoft. June 2, 2009. Archived from the original on June 6, 2009. Retrieved June 3, 2009.\nA Brief History of Computing, by Stephen White. An excellent computer history site; the present article is a modified version of his timeline, used with permission.\nWomen in computing\nArtificial intelligence\nMachine learning\nQuantum computing and communication\nFree and open-source software\nHypertext technology\nOperating systems\nDOS family\nWindows\nLinux\nProgramming languages\nVirtualization development\nInternet conflicts\nWeb search engines\nKathleen Antonelli\nJohn Vincent Atanasoff\nEdsger W. Dijkstra\nJ. Presper Eckert\nDouglas Engelbart\nMargaret Hamilton\nDavid A. Huffman\nJohn von Neumann\nKlára Dán von Neumann\nGuido van Rossum\nBjarne Stroustrup",
  "Timeline_of_computing_2010–2019": "Hardware 1960s to present\nSoftware configuration management\nFree and open-source software\nArtificial intelligence\nCompiler construction\nEarly computer science\nOperating systems\nProgramming languages\nProminent pioneers\nSoftware engineering\nGeneral-purpose CPUs\nGraphical user interface\nPersonal computers\nmore timelines ...\nThis article presents a detailed timeline of events in the history of computing from 2010 to 2019. For narratives explaining the overall developments, see the history of computing.\nApril 6\nApple releases the original iPad.[1][2]\nApple releases the original iPad.[1][2]\nJune 24\nApple releases the iPhone 4.[3][4]\nApple releases the iPhone 4.[3][4]\nMay 4\nIntel announces the commercialisation of 3D transistors,[5] a variant of the FinFET.\nIntel announces the commercialisation of 3D transistors,[5] a variant of the FinFET.\nMay 17\nLenovo releases the first ThinkPad X1.[6]\nLenovo releases the first ThinkPad X1.[6]\nJune 15\nThe first Chromebooks, by Acer and Samsung, go on sale.[7]\nThe first Chromebooks, by Acer and Samsung, go on sale.[7]\nSeptember 7\nThe first 4 terabyte hard drive is released by Seagate.[8]\nThe first 4 terabyte hard drive is released by Seagate.[8]\nFebruary 29\nRaspberry Pi, a bare-bones, low-cost credit-card sized computer created by volunteers mostly drawn from academia and the UK tech industry, is released to help teach children to code.[9][10]\nRaspberry Pi, a bare-bones, low-cost credit-card sized computer created by volunteers mostly drawn from academia and the UK tech industry, is released to help teach children to code.[9][10]\nSeptember 11\nIntel demonstrates its Next Unit of Computing, a motherboard measuring only 4 × 4 in (10 × 10 cm).[11]\nIntel demonstrates its Next Unit of Computing, a motherboard measuring only 4 × 4 in (10 × 10 cm).[11]\nOctober 4\nTDK demonstrates a 2 terabyte hard drive on a single 3.5-inch platter.[12]\nTDK demonstrates a 2 terabyte hard drive on a single 3.5-inch platter.[12]\nOctober 26\nMicrosoft releases the operating system Windows 8.[13]\nMicrosoft releases the operating system Windows 8.[13]\nNovember 18\nNintendo releases the Wii U in North America.[14]\nNintendo releases the Wii U in North America.[14]\nJune 11\nApple releases the first Retina Display MacBook Pro.\nApple releases the first Retina Display MacBook Pro.\nSeptember 20\nApple releases the iPhone 5s, powered by the Apple A7 SoC which the company proclaimed to be the first 64 bit processor to be used on a smartphone.[15]\nApple releases the iPhone 5s, powered by the Apple A7 SoC which the company proclaimed to be the first 64 bit processor to be used on a smartphone.[15]\nNovember 15\nSony releases the PlayStation 4 in the United States and in Europe 2 weeks later on November 29.[16]\nSony releases the PlayStation 4 in the United States and in Europe 2 weeks later on November 29.[16]\nNovember 22\nMicrosoft releases Xbox One.[17]\nMicrosoft releases Xbox One.[17]\nAugust 6\nIntroduction of the RISC-V architecture with its instruction set.[18]\nIntroduction of the RISC-V architecture with its instruction set.[18]\nAugust 26\nThe first 8 terabyte hard drive is released by Seagate.[19][20][21]\nGoogle releases the 64-bit version of Chrome for Windows.[22]\nThe first 8 terabyte hard drive is released by Seagate.[19][20][21]\nGoogle releases the 64-bit version of Chrome for Windows.[22]\nAugust 29\nIntel unveiled its first eight-core desktop processor, the Intel Core i7-5960X.[23][24]\nIntel unveiled its first eight-core desktop processor, the Intel Core i7-5960X.[23][24]\nJuly 29\nMicrosoft releases the operating system Windows 10.[25]\nMicrosoft releases the operating system Windows 10.[25]\nOctober 15\nAlphaGo was the first Go AI computer program developed by Google to defeat a professional human opponent on a full-sized board without handicap.\nAlphaGo was the first Go AI computer program developed by Google to defeat a professional human opponent on a full-sized board without handicap.\nJanuary 12\nThe High Bandwidth Memory 2 standard is released by JEDEC.\nThe High Bandwidth Memory 2 standard is released by JEDEC.\nJanuary 13\nFixstars Solutions releases the world's first 13 TB SSD.[26][27]\nFixstars Solutions releases the world's first 13 TB SSD.[26][27]\nMarch 4\nScientists at MIT create the first five-atom quantum computer with the potential to crack the security of traditional encryption schemes.[28]\nScientists at MIT create the first five-atom quantum computer with the potential to crack the security of traditional encryption schemes.[28]\nMarch 2\nAMD launches the Ryzen CPU architecture.\nAMD launches the Ryzen CPU architecture.\nMarch 3\nNintendo releases the hybrid gaming console Nintendo Switch.\nNintendo releases the hybrid gaming console Nintendo Switch.\nJanuary 9\nLexar announces the first SD card which can store 1 terabyte.[29]\nLexar announces the first SD card which can store 1 terabyte.[29]\nSeptember 20\nGoogle claims to have achieved quantum supremacy.[30][31]\nGoogle claims to have achieved quantum supremacy.[30][31]\n^ \"Official: iPad Launching Here April 3, Pre-Orders March 12\". Gizmodo. 5 March 2010. Archived from the original on 28 February 2014. Retrieved 4 October 2014.\n^ \"iPad Available in US on April 3\". Apple.com. Archived from the original on 17 November 2017. Retrieved 17 November 2017.\n^ \"iPhone 4 Release Date: New iPhone Release Set For Summer 2010\". HuffPost. 7 June 2010. Archived from the original on 20 December 2016. Retrieved 17 November 2017.\n^ \"Apple Presents iPhone 4\". Apple.com. Archived from the original on 3 September 2011. Retrieved 17 November 2017.\n^ Shimpi, Anand Lal (2011-05-04). \"Intel Announces first 22nm 3D Tri-Gate Transistors, Shipping in 2H 2011\". AnandTech. Archived from the original on 2013-12-25. Retrieved 23 January 2014.\n^ \"Lenovo ThinkPad X1 coming May 17th, with Gorilla Glass screen and spill-proof keyboard (video)\". Engadget. 11 May 2011. Retrieved 2021-07-01.\n^ \"Official Google Blog: A new kind of computer: Chromebook\". Official Google Blog. Archived from the original on 6 October 2014. Retrieved 4 October 2014.\n^ Shimpi, Anand Lal (2011-09-07). \"Seagate Ships World's First 4TB External HDD\". AnandTech. Archived from the original on 2014-02-03. Retrieved 26 January 2014.\n^ \"BBC News - The Raspberry Pi computer goes on general sale\". BBC News. 29 February 2012. Archived from the original on 14 October 2014. Retrieved 4 October 2014.\n^ \"Raspberry Pi $35 miniature computer now on sale, $25 model going into production 'immediately'\". The Verge. 29 February 2012. Archived from the original on 6 October 2014. Retrieved 4 October 2014.\n^ Shimpi, Anand Lal (2012-09-11). \"Intel's Next Unit of Computing: 4\"x4\", Core i3, Systems Targeted at $399\". AnandTech. Archived from the original on 2014-01-22. Retrieved 26 January 2014.\n^ Parrish, Kevin (2012-10-04). \"TDK Finally Crams 2TB on One 3.5-inch HDD Platter\". Tom's Hardware. Retrieved 26 January 2014.\n^ \"Windows 8's delivery date: October 26\". ZDNet. 18 July 2012. Archived from the original on 19 September 2012. Retrieved 4 October 2014.\n^ \"Nintendo Wii U release date is November 18th in US starting at $299.99, November 30th in Europe\". Polygon. 13 September 2012. Archived from the original on 6 October 2014. Retrieved 4 October 2014.\n^ \"The iPhone 5s: fingerprint sensor and improved camera, starts at $199 and coming September 20th\". 10 September 2013. Archived from the original on 10 September 2013. Retrieved 27 February 2016.\n^ \"PlayStation 4 Release Date Confirmed for November 15th in North America, November 29th in Europe\". Archive.is. 20 August 2013. Archived from the original on 20 August 2013. Retrieved 4 October 2014.{{cite web}}:  CS1 maint: bot: original URL status unknown (link)\n^ \"Xbox One to Launch on November 22, 2013 in 13 Markets - Xbox Live's Major Nelson\". Xbox Live's Major Nelson. 4 September 2013. Archived from the original on 29 September 2013. Retrieved 4 October 2014.\n^ Asanović, Krste; Patterson, David A. (August 6, 2014). Instruction Sets Should Be Free: The Case For RISC-V (PDF). EECS Department, University of California, Berkeley. UCB/EECS-2014-146.\n^ \"Seagate's 8TB drive is biggest ever, stores more than 300 Blu-ray discs\". TechRadar. 26 August 2014. Archived from the original on 6 October 2014. Retrieved 4 October 2014.\n^ \"Seagate ships first 8TB hard drive\". Techreport.com. 26 August 2014. Archived from the original on 6 October 2014. Retrieved 4 October 2014.\n^ \"Seagate Ships World's First 8TB Hard Drives\". Seagate.com. Archived from the original on 27 August 2014. Retrieved 4 October 2014.\n^ \"Chromium Blog: 64 bits of awesome: 64-bit Windows Support, now in Stable!\". Chromium Blog. Archived from the original on 6 October 2014. Retrieved 4 October 2014.\n^ IntelPR. \"Intel Unleashes its First 8-Core Desktop Processor\". Intel Newsroom. Archived from the original on 6 October 2014. Retrieved 4 October 2014.\n^ \"Happy Haswell-E And X99 Chipset Day, Internet! How About A System Giveaway?\". Tom's Hardware. 29 August 2014. Archived from the original on 30 March 2021. Retrieved 4 October 2014.\n^ \"Hello World: Windows 10 Available on July 29\". windows.com. June 1, 2015. Archived from the original on October 4, 2015. Retrieved June 1, 2015.\n^ Shah, Agam. \"The world's first 13TB SSD is here\". Computerworld. Archived from the original on 28 February 2016. Retrieved 10 February 2016.\n^ \"The world's first 13TB SSD is here\". Archived from the original on 16 December 2018. Retrieved 10 February 2016.\n^ \"MIT's new 5-atom quantum computer could make today's encryption obsolete\". Archived from the original on 5 March 2016. Retrieved 5 March 2016.\n^ \"Lexar Announces 1TB 633x SDXC UHS-I card, the behemoth of storage capacity\". Lexar. 9 January 2019. Retrieved 10 January 2019.\n^ Waters, Richard; Murgia, Madhumita (2019-09-20). \"Google claims to have reached quantum supremacy\". Financial Times. Retrieved 2025-05-08.\n^ \"Google touts quantum computing milestone\". MarketWatch. Associated Press.\nWomen in computing\nArtificial intelligence\nMachine learning\nQuantum computing and communication\nFree and open-source software\nHypertext technology\nOperating systems\nDOS family\nWindows\nLinux\nProgramming languages\nVirtualization development\nInternet conflicts\nWeb search engines\nKathleen Antonelli\nJohn Vincent Atanasoff\nEdsger W. Dijkstra\nJ. Presper Eckert\nDouglas Engelbart\nMargaret Hamilton\nDavid A. Huffman\nJohn von Neumann\nKlára Dán von Neumann\nGuido van Rossum\nBjarne Stroustrup\nOverview of 2010s\nMusic\nMusic industry\nJazz\nLatin",
  "Timeline_of_computing_2020–present": "Hardware 1960s to present\nSoftware configuration management\nFree and open-source software\nArtificial intelligence\nCompiler construction\nEarly computer science\nOperating systems\nProgramming languages\nProminent pioneers\nSoftware engineering\nGeneral-purpose CPUs\nGraphical user interface\nPersonal computers\nmore timelines ...\nThis article presents a detailed timeline of events in the history of computing from 2020 to the present. For narratives explaining the overall developments, see the history of computing.\nSignificant events in computing include events relating directly or indirectly to software, hardware and wetware.\nExcluded (except in instances of significant functional overlap) are:\nevents in general robotics\nevents about uses of computational tools in biotechnology and similar fields (except for improvements to the underlying computational tools) as well as events in media-psychology except when those are directly linked to computational tools\nCurrently excluded are:\nevents in computer insecurity/hacking incidents/breaches/Internet conflicts/malware if they are not also about milestones towards computer security\nevents about quantum computing and communication\neconomic events and events of new technology policy beyond standardization\nOn January 14, the New York Times, The New York Daily News, and the Center of Investigative Reporting have a hearing in a combined lawsuit against OpenAI.[1]\nOpenAI develops a model called \"GPT 4b-micro\", which suggests ways that protein factors could be re-engineered to become more effective.[2]\nDeepSeek releases DeepSeek-R1 on 20 January, a large language model based on DeepSeek-V3 utilising a chain-of-thought process similar to OpenAI o1.[3]\nOn May 18, 2025, 15 launches 15.dev as the successor to 15.ai.[tweet 1][4]\nThe race for the most advanced AI continues, with new models like OpenAI GPT-5.1 release and reports of SoftBank selling its Nvidia stake to double down on Open AI bets.\nAn AI-based study shows for the first time that fingerprints from different fingers of the same person share strong detectable similarities.[5][6]\nA preprint trial suggests large language models could be used for tailored manipulation, being more persuasive than humans when using personal information.[7][8]\nNotable innovations: LAION releases a first version of BUD-E, a fully open source voice assistant,[9] an automatic waste sorting system that can distinguish between over 500 waste categories is released,[10] researchers describe an AI ecosystem interface of foundation models connected to many APIs as specialized subtask-solvers,[11] the chatbot Grok is made open source to a substantial extent.[12][13]\nJohn Hopfield and Geoffrey Hinton win the Nobel Prize in Physics \"for foundational discoveries and inventions that enable machine learning with artificial neural networks\"[14]\nResearchers describe an approach for an optical disk with petabit capacity,[15][16]\nInternet penetration\nAccording to the International Telecommunication Union, the global Internet population reached 5.5 billion in 2024, meaning more than two-thirds of the world's population is now online.[17][18]\nChatbot and text-generating AI, ChatGPT (released on 30 Nov 2022), a large language model, became popular. It was estimated that only two months after its launch, it had 100 million active users.[20] Applications may include enhancing the productivity of, or automating, large swathes of white collar work, including software development, finance, law, and education[21][22].\nGoogle released chatbot Bard due to effects of the ChatGPT release,[23] with potential for integration into its Web search and, like ChatGPT software, also as a software development helper tool.[24] DuckDuckGo released the DuckAssist feature integrated into its search engine that summarizes information from Wikipedia to answer search queries that are questions. The experimental feature was shut down without explanation on 12 April.[25][26][27] There has been further development regarding LLMs or ChatGPT as user interfaces of Wikipedia or as software using its structured knowledge by others.[28][29] It may demonstrate an alternative approach to ChatGPT whose fundamental algorithms are not designed to generate text that is true, including for example \"hallucinations\" and fake citations or misinformation more generally.[30][31] Elicit.org may provide a free alternative to this tool.[32][33] A broader alternative approach to the software's Q&A applications and use of text generation for assignments may be the improvement of media literacy and Web search skills in education systems.\nFurther LLM developments during what has been called an \"AI boom\" included: local or open source versions of LLaMA which was leaked in March,[34][35][36] news outlets reported on GPT4-based Auto-GPT that given natural language commands uses the Internet and other tools in attempts to understand and achieve its tasks with unclear or so-far little practicality,[37] a systematic evaluation of answers from four \"generative search engines\" suggested their outputs \"appear informative, but frequently contain unsupported statements and inaccurate citations\",[38] a multi-modal open source tool for understanding and generating speech,[39] a data scientist argued that \"researchers need to collaborate to develop open-source LLMs that are transparent\" and independent,[40] Stability AI launched an open source LLM.[41]\nA method for editing NeRF scenes, a novel media technique from 2020,[42] with natural language commands was demonstrated by Nvidia.[43][44]\nAn open letter \"Pause Giant AI Experiments\" initiated by the Future of Life Institute called for \"AI labs to immediately pause for at least 6 months the training of AI systems more powerful than GPT-4\" due to \"profound risks to society and humanity\".[45][46] It received substantial media attention and also contributed to speculations about perceived large LLM potential). At the time there was extensive media coverage of views that regard ChatGPT as a potential step towards AGI or sentient machines, also extending to some academic works (e.g. a popular preprint by a company).[19] The coverage focused on such views may not represent the majority expert views and, for example, some researchers noted that e.g. the ability to generate coherent text and imitations are not the same as understanding language.[47] A set of techniques under development included self-refining code or text.[48]\nChatGPT was shown to outperform human doctors in responding to online medical questions when measured on quality and empathy by \"a team of licensed health care professionals\",[49][50] albeit the chatbot may have previously been trained with these reddit question and answers threads.\nNews outlets reported on a preprint that described the development of a large language model software that can answer medical questions with a 67.6% accuracy on MedQA and nearly matched human clinician performance when answering open-ended medical questions, Med-PaLM. The AI makes use of comprehension-, recall of knowledge-, and medical reasoning-algorithms but remains inferior to clinicians.[51][52][53] As of 2023, humans often – if not most often – conduct query-based web searches, read websites and/or conduct physical doctor's visits to inquire health information, despite various difficulties,[54][55][56][57] partly as they typically did not undergo any formal training in media literacy,[58] digital literacy[59][60] or health literacy,[61] as such is not part of schools curricula in most education systems as of 2023.[61][58][59]\nA novel potentially significantly more efficient text-to-image approach, as implemented in MUSE, was reported.[62][63]\nA first successful autonomous long-duration operation, including simulated combat, of a modified F-16 fighter jet, X-62A, by two AI software was reported.[64][65][66]\nA text-to-speech synthesizer, VALL-E, that can be trained to mimic anybody's voice with just three seconds of voice data and may produce the most natural-sounding results to date, was reported in a preprint.[67][68]\nA use of world models for a wide range of domains that make decisions using e.g. different 3D worlds and reward frequencies and outperforms previous approaches, DreamerV3, was reported as a step towards general artificial intelligence in a preprint.[69][70]\nA large language model, ProGen, that can generate functional protein sequences with a predictable function, with input including tags specifying protein properties, was reported.[71][72]\nA deep-learning model, ZFDesign, for zinc finger design for any genomic target for gene- and epigenetic-editing was reported.[73][74]\nSoftware for generating 3D dynamic scenes (text-to-4D), MAV3D, was reported.[75][76]\nA study reported the development of deep learning algorithms to identify technosignature candidates, finding 8 potential alien signals not detected earlier.[77][78]\nAn international norms and arms control proposal for artificial intelligence in the military (such as LAWs and weapons decision-making), the \"Political Declaration on Responsible Military Use of Artificial Intelligence and Autonomy]\", was published by the U.S. government.[79][80][81] The first international summit on military AI led to a joint unbinding statement by the U.S., China and other nations, with some external calls for starting negotiations on an internationally binding law or an enforcement-mechanisms-driven law.[82]\nThe world's first COVID-19 drug designed by generative AI was approved for human use, with clinical trials expected to begin in China. The new drug, ISM3312, was developed by Insilico Medicine.[83]\nThe LLM GPT-4 was launched by OpenAI.[84][85] It and ChatGPT based on it continued to receive major global media attention.\nResearchers suggested that growing influence of industry in AI research means that \"public interest alternatives for important AI tools may become increasingly scarce\".[86]\nGoogle revealed PaLM-E, an embodied multimodal language model with 562 billion parameters.[87][88]\nResearchers demonstrated an open source 'AI scientist' that can create models of natural phenomena from knowledge axioms and experimental data, showing the software can rediscover physical laws like \"Kepler's third law of planetary motion, Einstein's relativistic time-dilation law, and Langmuir's theory of adsorption\" using logical reasoning and a few data points.[90][89]\nResearchers demonstrated a non-invasive brain-reading method. It can translate a person's neural activity into a continuous stream of text using fMRI data and transformer machine learning. Prior training data is required for this semantic decoding. Participants listened to stories for 16 hours while their brain activity was recorded.[91]\nA new AI algorithm developed by Baidu was shown to boost the antibody response of COVID-19 mRNA vaccines by 128 times.[92]\nComputational neuroscientists showed that people with higher intelligence scores in HCP cognitive tests took more time to solve difficult problems and that their higher synchrony between brain areas allowed for better integration of evidence (or progress) from preceding working memory sub-problem processing. Reducing synchrony in \"avatar\" simulations, that were adjusted and tuned towards personalization, \"led decision-making circuits to quickly jump to conclusions\". Their codified results may be useful for an understanding of cognition to replicate or imitate in bio-inspired computing.[94][93]\nAI was used to develop an experimental antibiotic called abaucin, which is shown to be effective against A. baumannii.[95]\nA machine learning model is trained to recognise the key features of chemicals with senolytic activity. It finds three chemicals – ginkgetin, periplocin and oleandrin – able to remove senescent cells without damaging healthy cells.[96][97]\nArticles in science outlets like Nature suggest contemporary viral concerns about hypothetical existential risk of AI \"plays into the tech companies' agenda\" – partly in the form of 'criti-hype'[98] – and that this \"hinders effective regulation of the societal harms AI is causing right now\" and in the near-future.[99]\nA science writer provides an overview of \"the nascent industry of AI-designed drugs\".[100]\nA preprint introduces the concept of \"thought cloning\" by which AI use data of or imitate human thinking.[101]\nMetaresearchers showed that AI trained with study-author-networks data could generate scientifically promising \"alien\" hypotheses that would likely not be considered otherwise.[102]\nA study provides an overview and living review of open source LLMs, assessing the levels of openness of their differentiated elements and reviewing the risks of relying on proprietary software or the importance of open source AI.[103]\nAI-supported mammography screening was demonstrated to have the potential to substantially reduce workload and to possibly improve cancer detection rates.[104]\nA review outlined applications and challenges of using AI to accelerate science.[105]\nA study that won an international competition demonstrated an approach that predicted 70% of earthquakes, suggesting some form of earthquake prediction may be feasible in the future.[106]\nResearchers released a large set of audiobooks for free books in Project Gutenberg created automatically via generative AI with near-natural voice.[107]\nA natural language system was demonstrated that can provide explanations for the conclusion-making of machine learning models for explainable AI.[108][109]\nA preprint reported some large language models have an 'extractable memorization' flaw by which training data can be extracted at affordable costs by queries.[110]\nGoogle DeepMind announced its Gemini multimodal language model, which it claims has advanced \"reasoning capabilities\" and can outperform GPT-4 on a variety of tasks.[111][112][113][114]\nA new class of antibiotic candidates, able to kill methicillin-resistant Staphylococcus aureus (MRSA) was identified using explainable deep learning.[115][116]\nNotable innovation products: an open source automated experimentation science platform (BacterAI) for predicting microbial metabolism with little data,[117] a low-cost smartphone-attachment (BPClip) for blood pressure measurement,[118] an open source transfer learning-based system (Geneformer) for predicting how networks of interconnected human genes control or affect the function of cells,[119][120] a performant open source AI software for protein design (RFdiffusion) was introduced,[121] multimodal biomedical Med-PaLM M was introduced.[122]\nSoftware-hardware systems\nA two/multi-robot and beacons mesh communication paradigm for exploration by robotic probes, drones, spacecraft, disaster recovery rovers or underwater robots was reported.[123][124]\nResearchers showed parrots can use and enjoy using a videocalling system.[125][126]\nA 'chef' robot developed is trained to watch and learn from cooking videos, and recreate dishes itself.[127][128]\nAutonomous drones won first races against human champions of FPV drone racing.[129]\nAn autonomous laboratory for synthesis of inorganic powders, the A-Lab.[130]\nNotable innovations: a low-cost open source air pollution sensor (Flatburn),[131][132] a laser-using drone-based methane plume localization method,[133] and a portable EEG helmet with significant accuracy of decoding thought words to text (DeWave).[134][135]\nResearchers demonstrated how pre-installed apps on Android smartphones in China are used for mass surveillance in China.[136][137]\nScientists reviewed safety-by-design technology- and policy-based approaches to ensure biosafety and biosecurity to prevent engineered pathogen pandemics, including digital methods such as DNA sequence screening, some of which are already implemented and part of regulations to some degree.[138][additional citation(s) needed]\nStudies investigated dating apps, revealing high gender inequality,[139] partly exploring possible relevance to the rise of both \"sexual loneliness\" and concentration of sex in various developed countries,[139] and reported subsets of well-being effects.[140][139][141][142]\nA study hypothesized mental health awareness efforts (in current forms) or glamorised and romanticised mental disorders on social media (e.g. quotes about depression on aesthetically appealing backgrounds shared widely on certain social media)[which?] may have contributed to the recent rise in reported mental health problems – by intensifying and over-diagnosing of such – beyond e.g. increased reporting of previously under-recognised symptoms or mental health-related issues.[143][144]\nA news outlet reported on a systematic study of major issues in popular currently available commercial VPNs for Internet privacy and security.[145][146]\nResearchers reported 'digital resignation', calling for regulations and education reform.[147]\nParts of Twitter's recommender algorithms became open source, welcomed and requested by many albeit with several issues related to code exclusion and verifiability.[148][149][150] Around the time, the free version of its API, which was also used for research, was shut down[151] – followed shortly thereafter by reddit,[152] proprietary verification checkmarks caused controversy,[153] parts of its source code were leaked,[154] and applications of a \"state-affiliated media\" label – which purportedly uses \"Category:Publicly funded broadcasters\" data which, like the label, does not differentiate and list the shares of funding sources – caused controversy.[155][156] In April, Twitter was warned by EU digital policy-makers after a report indicated its recent policies \"boost\" Russian disinformation-based propaganda.[157]\nOne of the first empirical studies on what real users are shown during their typical use of popular Web search engines interpreted its results to show that choices for unreliable news sources for their queries are driven primarily by users' own choices and less by the engine's algorithms. The Web scientists linked their findings to the concept of filter bubbles which emphasizes the role of design-[158] and personalization algorithms.[159][160] A report accompanied by an open letter concluded that Alphabet Inc, against its voluntary promises, still runs climate misinformation ads.[161] Statements by Elon Musk[better source needed] in 2022 suggested YouTube may also show ethically disputed advertising other than science-related misinformation such as extensively showing \"scam ads\".[162][163][164]\nAn umbrella review summarized the research on benefits and risks associated with digital media use by youths, suggesting caregivers, policymakers and researchers should continue to move away from prevailing oversimplified recommendations to reduce screen time to instead focus on distinguished types of screen use.[165]\nAn experimental study reported online search to evaluate the truthfulness of false news articles increased the probability of believing them, especially for those for whom search engines return lower-quality information. It suggests media literacy programs with tested strategies and solutions for identified search engines issues are needed.[166]\nThe concept of enshittification about the quality of content on social media platforms introduced in 2022 gained traction.[167][168]\nNotable innovations: a Tor browser-equivalent Web browser for privacy-protected browsing when using a VPN (Mullvad browser) was demonstrated,[169][170][171] after moderators of the Web content aggregation-based platform Reddit strike against the site's introduction of API pricing and the ensuing closing of several mobile client apps, several novel decentralized open source aggregation platforms gain substantial numbers of users – most notably Lemmy and Kbin which can synchronize their posts via interoperability,[172][173][174] the first upgrade of the Global Earthquake Model data for disaster risk reduction,[175][176] and the misinformation-countering system Community Notes became relatively widely used on X (formerly Twitter).[177]\nHardware and wetware\nResearchers demonstrated an open-brain surgery-free brain implant, Stentrode, that can record brain activity from a nearby blood vessel, showing it can be used to operate a computer.[178][179]\nNews outlets reported on a study (21 Nov. 2022) demonstrating locust antennae implanted as biosensors into (bio-hybrid) robots for AI-interpreted machine olfaction.[180][181]\nScientists coalesced recent developments (see also 2022-12-26) using human brain organoids into a new field they term organoid intelligence (OI), seeking to harness OI for computing – as a novel type of AI – in an ethically responsible way. Networks of such miniature tissues could become functional using stimulus-response training or organoid-computer interfaces – to potentially become \"more powerful than silicon-based computing\" for a range of tasks – and could also be used for research of various pathophysiologies, brain development, human learning, memory and intelligence, and new therapeutic approaches against brain diseases.[182][183]\nBiological organoid intelligence, 'Brainoware', was demonstrated to solve computational tasks in a preprint, with implications for bioethics and potential bottlenecks and limits of nonbio-AI.[184][185]\nA study demonstrated functional integration of a magnetically steered microbot containing neurons, 'Mag-Neurobot', in a mouse \"organotypic hippocampal slice\" as physical (semi-) artificial neurons.[186][187]\nResearchers reported the development of a fuel cell implant powered by blood glucose. It can also release insulin at certain levels and have enough energy to allow smartphone implant control.[188][189]\nResearchers reported the development of neuromorphic AI hardware using nanowires (see also 2020-04-20) physically mimicking the brain's activity in identifying and remembering an image from memory.[191][192] A university reported on a demonstration of multisensory motion cue integration by a neuromorphic nerve for robots.[190]\nResearchers demonstrated encoding and storing data – small images – as DNA without new DNA synthesis by recording light exposure into bacterial DNA via optogenetic circuits. The 'biological camera' extends chemical and electrical interface techniques.[193][194]\nResearchers demonstrated the use of biological-electronic hybrid Organoid Intelligence, 'Brainoware', for speech recognition.[195]\nDeepMind announced that its AlphaFold program had uncovered the structures of more than 200 million folded proteins, essentially all of those known to science.[196][197] Further information: Protein structure prediction\nNews outlets reported artificial intelligence art had won the first place in a digital art competition.[198] Such artistic imagery is generated using input consisting of text and sometimes images, usually including parameters such as artistic style (text-to-image generation). Around the time, an expert concluded that \"AI art is everywhere right now\", with even experts not knowing what it will mean,[199] a news outlet established that \"AI-generated art booms\" and reported issues of copyright and automation of professional artists,[200] a news outlet investigated how online communities (e.g. their rules) confronted with many such artworks react,[201] a news outlet raised concerns over deepfakes,[202] a magazine highlighted possibilities of enabling \"new forms of artistic expression\",[203] and an editorial noted that it may be seen as a welcome \"augmentation of human capability\".[204][additional citation(s) needed] Moreover, additional functionalities – such as enabling the use of user-provided concepts (like an object or a style) learned from few images for novel personalized art generated from the associated word/s[205] or expanding beyond the borders of artistic images in the same style[206] – were reported. On 22 August,[207][208] Stable Diffusion released as open source software, making the technology more accessible and free to use on personal hardware as well as extendable by third-parties (i.e. other software projects).[208][209]\nA new deep learning technique enabled year-round measurements of sea ice thickness in the Arctic.[210][211]\nA screening AI system for many cancer types that integrates different types of data via multimodal learning was reported.[212][213]\nResearchers reported the development of a deep learning system that learns intuitive physics from visual data (of virtual 3D environments) to some degree \"from scratch\" based on an unpublished approach inspired by studies of visual cognition in infants.[214][215] Two weeks later, other researchers reported the development of a machine learning algorithm that could discover sets of basic variables of various physical systems and predict the systems' future dynamics from video recordings of their behavior.[216][217] Further information: Machine learning in physics § Physics discovery and prediction\nResearchers reported the development of deep learning software that can design proteins that contain prespecified functional sites.[218][219] Further information: Protein design § Algorithms\nSoftware-hardware systems\nThe first laparoscopic surgery performed entirely by a robot was reported[image needed].[220][221]\nResearchers demonstrated semi-automated testing for reproducibility (which is lacking especially in cancer research) via extraction of statements about experimental results in non-semantic, gene expression cancer research papers and subsequent testing with breast cancer cell lines via robot scientist \"Eve\".[223][222] Further information: Applications of artificial intelligence § Novel types of machine learning\nAgilicious, an open-source and open-hardware versatile standardized quadrotor drone, tailored toward agility, was released.[224][225] Further information: Open-source robotics\nA university reported the release of 'Quad-SDK' which may be the first open source full-stack software for large agile four-legged robots, compatible with the ROS.[226][227][better source needed][228]\nNews outlets reported deployment, research and development of novel military drone technology in the Russo-Ukrainian War in 2022, including demining drones,[229] self-repurposed commercial/hobby drones[230][231] (including via a hackathon),[232][better source needed][233] reconnaissance microdrones,[234] kamikaze drones, bomb-dropping modified drones,[235] and countermeasures such as electronic ones.[234][231][236][237]\nThe first data transmission to exceed 1 petabit per second (Pbit/s) using a single laser and a single optical chip was demonstrated by European researchers.[238][239]\nNews outlets reported a novel agricultural robot for viable weed control using lasers[image needed] or \"laserweeding\".[240] There are similar precision agriculture machines that have been reported before, also e.g. applying low amounts of herbicides and fertilizers with precision while mapping plant locations, in some cases autonomously.[241][242] Their benefits may include \"healthier crops and soil, decreased herbicide use, and reduced chemical and labor costs\".[240]\nA satellite-free GPS-alternative higher-resolution positioning system using existing telecommunications networks was demonstrated, SuperGPS.[243][244]\nImpossible Metals announced its first underwater robotic vehicle, 'Eureka 1', had completed its first trial of selectively harvesting polymetallic nodule rocks from the seabed nearly without harming the environment (as compared to other seabed mining) to help address the rising global need for metals for renewable energy system components – mainly batteries. It operates autonomously and uses advanced computer vision, e.g. using AI to determine which rocks have signs of visible life on them so that they are not harvested.[245]\nA report by the Royal Society listed potential or proposed countermeasures against misinformation, mainly online misinformation, such as, broadly described, building resilience to scientific misinformation and a healthy online information environment.[246] Further information: Misinformation § Online misinformation\nComputational biologists reported the largest detailed human genetic genealogy, unifying human genomes from many sources for insights about human history, ancestry and evolution. It demonstrates a novel computational method for estimating how human DNA is related, in specific as a series of 13 million linked trees along the genome, a tree-sequence, which has also been called \"the largest human family tree\".[image needed][247][248][249] Further information: Computational genomics\nResearchers reported the creation of a version control system for cell engineering, suggesting it to be a \"significant step toward more open, reproducible, easier to trace and share, more trustworthy engineering biology\", and possibly increased safety by enabling faster tracing of organisms lab of origin and design details via barcoding.[250][251]\nA preprint demonstrated how backdoors can be placed undetectably into classifying (e.g. posts as \"spam\" or well-visible \"not spam\") machine learning models which are often developed and/or trained by third parties. Parties can change the classification of any input, including in cases with types of data/software transparency, possibly including white-box access.[252][253][254] Further information: Machine learning § Other limitations and vulnerabilities\nResearchers reported routes for recycling 200 industrial waste chemicals into important drugs and agrochemicals using a software for computer-aided chemical synthesis design, helping enable \"circular chemistry\" as a potential area of a circular economy.[255][256] Further information: Drug design § Computer-aided drug design\nThe first global, interactive AI- and satellite monitoring-based, map[image needed] and analysis of plastic waste sites to help prevention of plastic pollution, especially ocean pollution was published.[257][258] Further information: Environmental monitoring\nA study suggested that in children at age 9–12 during two years time, gaming or watching digital videos can be positively correlated with measures of intelligence, albeit correlations with overall screen time (including social media, socializing and TV) were not investigated and 'time gaming' did not differentiate between categories of video games (e.g. shares of games' platform and genre).[260][259] Further information: Digital media use and mental health § Impact on cognition\nComputing and the 2022 Russian invasion of Ukraine:An editorial published in a journal noted that remote surgery and types of videoconferencing for sharing expertise (e.g. ad hoc assistance) have been and could be used to support doctors in Ukraine.[261] A forum contribution analyzed Russian users' reactions to the Bucha massacre on social media – on nationalist Telegram channels.[262] Computer science and technology was also used to defend against the 2022 Russian invasion such as with military technology,[263][264] to document and communicate war events including via facial recognition of dead Russian soldiers and Russian war crimes,[265][266] and for aggregated information about support opportunities for Ukrainian scientists.[267][268] See also: Russo-Ukrainian cyberwarfare and Russian information war against Ukraine\nResearchers demonstrated an MRI-ML-based approach that can diagnose early Alzheimer's disease with high accuracy and may help identify unknown related changes in the brain.[269][270] Further information: Screening (medicine)\nA study explored the efficacy of GitHub Sponsors, launched in 2019, in terms of supporting FOSS-efforts and the sponsors' intentions as well as the motivation of sponsors and various quantitative and qualitative analyses relevant to this approach of FOSS-funding.[271][272]\nProgress in climate change mitigation (CCM) living review-like works:The living document-like aggregation, assessment, integration and review website Project Drawdown added 11 new CCM solutions to its organized set[image needed] of mitigation techniques.[273][274] The website's modeling framework was used in a study document to show that metal recycling has significant potential for CCM.[275] A revised or updated version, using computer models, of a major worldwide 100% renewable energy proposed plan and model was published.[276][277] Further information: Climate change mitigation § Overviews, integration and comparisons of measures\nTeaching hospital press release: [278] Further information: Multimodal learning\nNews outlets reported that in July, for the first time, more people watched streaming TV than cable within the U.S.[globalize].[279][280]\nA researcher reported that the social media app TikTok adds a keylogger to its, on iOS essentially unavoidable, in-app browser in iOS, which allows its Chinese company to gather, for example, passwords, credit card details, and everything else that is typed into websites opened from taps on any external links within the app. Shortly after the report, the company claimed such capabilities are only used for debugging-types of purposes.[281][282] To date, it has largely not been investigated which and to which extent (other) apps have capacities for such or similar data-collection.[281][282][additional citation(s) needed]\nA university reported the development of a driver isolation framework to protect operating system kernels, primarily the monolithic Linux kernel which gets ~80,000 commits/year to its drivers,[image needed] from defects and vulnerabilities in device drivers,[283][284] with the Mars Research Group developers describing this lack of isolation as one of the main factors undermining kernel security.[285]\nA study concluded that advanced artificial intelligence with learned goal planning would or may intervene in the provision of reward to short-circuit reward via advanced exploits of ambiguity in the data about its goal such as considering the sending of the reward itself as humans' goal and intervening in the data-provision about its goal.[286][287]\nUniversity press release:[288]\nA research report by NewsGuard indicated there is a high level of online misinformation delivered[image needed] – to a mainly young user base – with TikTok, whose usage is increasing.[289][290]\nThe second largest cryptocurrency, Ethereum, switched from the proof-of-work (electricity consumption for validation) to the proof-of-stake (staked holdings for validation) algorithm, which cuts its large electricity consumption.[291]\nResults of investigations about the issue of recommendation systems shifting their users' preferences \"so they are easier to satisfy\" were reported, including actively optimizing such software to avoid problematic shifts/manipulation, suggesting \"that recommenders that optimize for staying in the trust region can avoid manipulative behaviors while still generating engagement\".[292][293]\nAn open source platform to match genomically profiled cancer patients to precision medicine drug trials was reported.[294][295]\nAfter domain seizures of Z-Library by copyright law enforcement and moves toward dark web and IPFS technologies by its content providers, the open source shadow library UI Anna's Archive – which also provides access to a full copy of Z-Library content and scientific articles – was established by a team of archivists,[296][297] essentially providing the largest human book and literature library.\nNews outlets reported the development of a post-editing model using GPT-3 that improves machine translations after identification of current translation problems.[298][299]\nThe largest global inventory and interactive map of greenhouse gas emission sources was released by Climate TRACE (9 November).[300][301]\nAround the acquisition of Twitter by Elon Musk (27 October), interest in alternatives to the site – described as \"one of the world's most high-profile information ecosystems\", a contemporary suboptimal public square, and as heavily used by many journalists and news media – increased substantially. However, no alternative such as Mastodon, Reddit or the Bluesky protocol was found to match its features such as ease of use to date, in terms of being able to substitute the site.[302][303][304]\nTwo studies demonstrated platform-built-in as well browser-integrated misinformation mitigation.[305][306][307]\nResearchers developed falsity scores for over 800 contemporary elites on Twitter and associated exposure scores.[308][309]\nNews outlets reported the first fully self-supervised anti–money laundering AI software using contemporary suboptimal datasets, LaundroGraph.[310][311]\nA university reported on the first study of the new privacy-intrusion Web tracking technique of \"UID smuggling\" by the ad industry, which finds it to be prevalent and largely not mitigated by the latest protection tools – such as Firefox's tracking protection and uBlock Origin – and contributes to countermeasures.[312][313]\nText-to-3D software became sophisticated, shortly after generative AI art. OpenAI released Point-E, a machine learning system that can generate 3D models from text prompts,[314][315] similar to previously released GET3D[316][317] and Magic3D[318] by Nvidia. DreamFusion from Google may also be notable.[316]\nA logic gate for computation at femtosecond timescales was demonstrated.[319][320]\nA study estimated losses of 61 metals to help the development of circular economy strategies, showing that usespans of, often scarce, tech-critical metals are short.[321][322] Further information: Technology-critical element\n[relevant?] Researchers reported a robotic finger covered in a type of manufactured living human skin.[323][324] Researchers demonstrated an electronic skin giving biological skin-like haptic sensations and touch/pain-sensitivity to a robotic hand.[325][326] A system of an electronic skin and a human-machine interface was reported that can enable remote sensed tactile perception, and wearable or robotic sensing of many hazardous substances and pathogens.[327][328] A multilayer tactile sensor hydrogel-based robot skin was demonstrated.[329][330] Further information: Robotic sensing\nSamsung announced the first mass production of computer chips using a 3 nm process. These feature a gate-all-around transistor architecture that reduces power consumption by up to 45%, improves performance by 23% and reduces area by 16% compared to 5 nm.[331][332]\nResearchers reported the development of nanoscale brain-inspired artificial synapses, using the ion proton (H+), for 'analog deep learning'.[333][334] Further information: Physical neural network\nThe creation of artificial neurons that can receive and release dopamine (chemical signals rather than electrical signals) and communicate with natural rat muscle and brain cells was reported, with potential for use in BCIs/prosthetics.[335][336]\nScientists reported a so far unique and unknown feature of material VO2 – it can \"remember\" previous external stimuli (via structural rather than electronic states), with potential e.g. data storage.[337][338]\nResearchers reported the development of remote controlled cyborg cockroaches functional if moving to sunlight for recharging.[339][340]\nResearchers from the Max Planck Institute for Polymer Research reported an organic artificial spiking neuron[image needed] for in-situ sensing and biointerface that exhibits the signal diversity of biological neurons.[341][342]\n[Meta/Policy/Philosophy] – Thomas Metzinger, a German philosopher of cognitive science and applied ethics, called for a \"global moratorium on synthetic phenomenology\" which, \"until 2050\", precautionarily bans \"all research that directly aims at or knowingly risks the emergence of artificial consciousness on post-biotic carrier systems\" – and could be gradually refined. The paper does not describe mechanisms of global enforcement of such proposed regulations which do not consider biotic or semi-biotic systems and aims to limit suffering risks.[343][344]\n[Type of database] – A new global food emissions database indicated that the current food systems are responsible for one third of the global anthropogenic greenhouse gas emissions.[345][346]\n[Data usage] – In a static proprietary article that appeared in and was co-reviewed by a scientific journal, authenticated scientists analyzed data from multiple public databases to create a regional representation of levels of deforestation induced by nations' recent, largely unmodulated, trade-, production- and consumption-patterns.[347][348]\nA study found that carbon emissions from Bitcoin mining in China – where a majority of the proof-of-work algorithm that generates current economic value is computed, largely fueled by nonrenewable sources – had accelerated rapidly and would soon exceed total annual emissions of countries like Italy, interfering with climate change mitigation commitments.[349][350]\nNeuralink revealed a male macaque with chips embedded on each side of its brain, playing a mind-controlled version of Pong. While similar technology has been demonstrated for decades, and wireless implants have existed for years, some observers noted that the organization increased the number of implanted electrodes that are read wirelessly.[351][352][353]\nScientists reviewed materials strategies for organic neuromorphic devices, suggesting that \"their biocompatibility and mechanical conformability give them an advantage for creating adaptive biointerfaces, brain-machine interfaces, and biology-inspired prosthetics\".[354][355][relevant?]\nResearchers published the first in-depth study of Web browser tab interfaces. They found that many people struggle with tab overload and conducted surveys and interviews about people's tab use. Thereby they formalized pressures for closing tabs and for keeping tabs open. The authors then developed related UI design considerations which could enable better tools and changes to the code of Web browsers – like Firefox – that allow knowledge workers and other users to better manage their tabs.[356][357]\nOperation of the U.S. Colonial Pipeline was interrupted by a ransomware cyber attack.[358]\nA new record for the smallest single-chip system was achieved, occupying a total volume of less than 0.1 mm3.[359][360]\nScientists demonstrated the first brain–computer interface that decodes neural signals for handwriting. The character output speed of a patient with a paralyzed hand was up to 90 characters per minute – more than double the previous record. Each letter is associated with a highly distinctive pattern of activity in the brain, making it relatively easy for the algorithm to distinguish them.[361][362]\nArchivists initiated a rescue mission to secure enduring access to humanity's largest public library of scientific articles, Sci-Hub, due to the site's increased legal troubles, using Web and BitTorrent technologies.[363]\nGoogle demonstrated a research project called LaMDA, an automatic language generation system designed to sustain a conversation with a person on any topic.[364][365]\nThe most comprehensive 3D map of the human brain – of a millionth of a brain and requiring 1.4 petabytes of storage space – was published.[366][367]\nEl Salvador passed the Bitcoin Law, making it the first country to give cryptocurrency and bitcoin a status of legal tender.[368] The law was passed by the Legislative Assembly of El Salvador on June 8, 2021, giving the cryptocurrency bitcoin the status of legal tender within El Salvador after September 7, 2021.[369] It was proposed by President Nayib Bukele. The text of the law states that \"the purpose of this law is to regulate bitcoin as unrestricted legal tender with liberating power, unlimited in any transaction, and to any title that public or private natural or legal persons require carrying out\".[370]\nGitHub Copilot, a programmer assistant AI, was released.[371][372] Later FOSS variants of the tool included FauxPilot.[373]\nIn the debate regarding the cognitive impacts of smartphones and digital technology, a group reported that, contrary to widespread belief, scientific evidence does not show that these technologies harm biological cognitive abilities and that they instead change predominant ways of cognition – such as a reduced need to remember facts or conduct mathematical calculations by pen and paper outside contemporary schools. However, some activities – like reading novels – that require long attention-spans and don't feature ongoing rewarding stimulation may become more challenging in general.[374][375]\nOpen 3D Engine – a game engine that is free and open source software (FOSS) and has Linux support – was released.[376]\nResearchers used a brain–computer interface to enable a man who was paralyzed since 2003 to produce comprehensible words and sentences by decoding signals from electrodes in the speech areas of his brain.[377][378]\nJapan achieved a new world record Internet speed: 319 Tbit/s over ~3000 km which, albeit not being the fastest speed overall, beats the previous record of 178 Tbit/s.[379][380]\nScientists reported that worldwide adolescent loneliness and depression increased substantially after 2012 and that loneliness in contemporary schools appears to be associated with smartphone access and Internet use.[381][382]\nDeepMind announced that its AlphaFold AI had predicted the structures of over 350,000 proteins, including 98.5% of the ~20,000 proteins in the human body. The 3D data along with their degrees of confidence for accuracy was made freely available with a database, doubling the previous number of protein structures in the public domain.[383]\nScientists published the first complete neuron-level-resolution 3D map of a monkey brain which they scanned within 100 hours.[384][385]\nA researcher reported that solar superstorms would cause large-scale global months-long Internet outages. She described potential mitigation measures and exceptions – such as user-powered mesh networks and related peer-to-peer applications – and the robustness of the current Internet infrastructure.[386][387][388] Further information: Space weather § Effects\nScientists concluded that personal carbon allowances (PCAs) could be a component of climate change mitigation. They found that the economic recovery from COVID-19 and novel digital technology capacities open a window of opportunity for first implementations. PCAs would consist of – e.g. monetary – credit-feedbacks and decreasing default levels of per capita emissions concessions. The researchers found that recent advances in machine learning technology and \"smarter home and transport options make it possible to easily track and manage a large share of individuals' emissions\" and that feedback effective in engaging individuals to reduce their energy-related emissions and relevant new personalized apps could be designed.[389][390][391] Issues may include privacy, evaluating emissions from individuals co-running multinational companies and the availability and prices of products and services. Further information: Personal carbon trading § Research and development\nCerebras announced a new hardware and software platform that can support AI models of 120 trillion parameters, enabling neural networks greater than the equivalent number of human brain synapses.[392]\nPathogen researchers reported the development of machine learning models for genome-based early detection and prioritization of high-risk potential zoonotic viruses in animals prior to spillover to humans. They concluded that their tool could be used for virus surveillance for pandemic prevention via (i.a.) measures of \"early investigation and outbreak preparedness\" and would have been capable of predicting SARS-CoV-2 as a high-risk strain.[393][394]\nA loss of public IP routes to the Facebook DNS servers due to malfunctioning capacity-assessment code, routinely triggered after configuration changes of routers of the company's data centers, resulted in stoppage of BGP routing information broadcasts caused the 2021 Facebook outage.[395][396]\nA study of data traffic by popular smartphones running variants of the Android software found substantial by-default data collection and sharing with no opt-out (i.e. even the NetGuard firewall, which is not installed by default, may not reliably and completely prevent such data traffic) and implications for users' privacy, control and security.[397][398]\nMedia outlets reported novel technologies for virtual try-ons of clothes for more sustainable fashion and improved online shopping, which increased relative to shopping at local shops that store clothes due to the COVID-19 pandemic.[399][400]\nA method of DNA data storage with 100 times the density of previous techniques was announced.[401]\nScientists demonstrated that grown brain cells integrated into digital systems can carry out goal-directed tasks with performance-scores. In particular, playing a simulated (via electrophysiological stimulation) Pong which the cells learned to play faster than known machine intelligence systems, albeit to a lower skill-level than both AI and humans, was reported. Moreover, the study suggested it provides the \"first empirical evidence\" of information-processing capacity differences between neurons from different species.[402][403] Further information: Wetware computer § Prototypes\nResearchers reported the development of organic low-power neuromorphic electronics which they built into a robot, enabling it to learn sensorimotorically within the real world, rather than via simulations like in the study above. For the chip, polymers were used and coated with an ion-rich gel to enable the material to carry an electric charge like real neurons.[404][405]\nResearchers reported the development of a system of machine learning and hyperspectral camera that can distinguish between 12 different types of plastics such as PET and PP for automated separation of waste of, as of 2020, highly unstandardized[406][additional citation(s) needed] plastics products and packaging.[407][408] Further information: Waste sorting § Mechanisms for automated sorting\nA scientific review summarized research and data about telemedicine. Its results indicated that, in general, outcomes of such ICT-use are as good as in-person care with health care use staying similar.[409][410]\nThe Log4Shell security vulnerability in a Java logging framework was publicly disclosed two weeks after its discovery. Because of the ubiquity of the affected software, experts have described it as a most serious computer vulnerability.[411] In a high-level meeting, the importance of security maintenance of open-source software – often also carried out largely by few volunteers – to national security was clarified.[412][413]\nResearchers reported the development of a database and analysis tool about perovskite solar cells which systematically integrates over 15,000 publications, in particular device-data about over 42,400 of such photovoltaic devices. Authors described the site – which requires signing up to access the data and uses software that is partly open source but to date not free software[415] – as a participative \"Wikipedia for perovskite solar cell research\" and suggest that extensively capturing the progress of an entire field including interactive data exploration functionalities could also be applicable to many fields in materials science, engineering and biosciences.[416][414]\nA third[417] main convergent graphical shell (Maui Shell) and UI framework (MauiKit), based on KDE/Kirigami, for the Linux operating system on smartphones, desktops and other devices, was released.[418][419][420][421]\nFebruary 7 – AMD released the Ryzen Threadripper 3990X, the first 64 core CPU for consumer market based on the Zen 2 microarchitecture.[422]\nMarch 12 – 15.ai, a free web application that used artificial intelligence to generate text-to-speech voices of fictional characters, was launched. Created by an AI researcher at MIT, it was notable for its ability to clone voices using as little as 15 seconds of audio data and became widely popular for creating memes and fan content. The platform introduced novel features like emotional contextualizers using DeepMoji for sentiment analysis and supported precise pronunciation control through ARPABET phonetic transcriptions.[423][424]\nMarch 26 – After one of the first and largest public volunteer distributed computing projects, SETI@home announced its shutdown by March 31, 2020, and due to heightened interest as a result of the COVID-19 pandemic, the distributed computing project Folding@home became the world's first system to reach one exaFLOPS.[425][426][427] The system simulates protein folding, is used for medical research on COVID-19 and achieved a speed of approximately 2.43 x86 exaFLOPS by April 13, 2020 –  many times faster than the fastest supercomputer, Summit.[428]\nApril 20 – Researchers demonstrated a diffusive memristor fabricated from protein nanowires of the bacterium Geobacter sulfurreducens which functions at substantially lower voltages than previously described ones and may allow the construction of artificial neurons which function at voltages of biological action potentials. The nanowires have a range of advantages over silicon nanowires and the memristors may be used to directly process biosensing signals, for neuromorphic computing and/or direct communication with biological neurons.[429][430][431]\nMay 22 – Australian computer scientists reported achieving, thus far, the highest internet speed in the world from a single optical chip source over standard optical fiber, amounting to 44.2 Terabits per sec, or \"downloading 1000 high definition movies in a split second\".[432][433][434]\nMay 27 – A study showed that social networks can function poorly as pathways for inconvenient truths, that the interplay between communication and action during disasters may depend on the structure of social networks, that communication networks suppress necessary \"evacuations\" in test-scenarios because of false reassurances when compared to groups of isolated individuals and that larger networks with a smaller proportion of informed subjects can suffer more damage due to human-caused misinformation.[435][436] Further information: Disaster response § Disaster response technologies\nJune 11 – Chatbot-technology and text-producing AI GPT-3 was released.[437][438] Further information: Natural language processing § Neural NLP (present)\nJuly 6 – [Novel protocol/standard] – The Versatile Video Coding standard (H.266) was finalised, designed to halve the bitrate of previous formats, reducing data volume and being especially useful for on-demand 8K streaming services.[439][440] Further information: Streaming media\nJune 15 – Researchers reported the development of a polymer device that can receive dopamine signals from real cells and learns from it.[354][441]\nJuly 15 – A cyborg beetle with a camera was demonstrated. It streams video to a smartphone via Bluetooth for a \"bug's eye view\".[442][443] Further information: Cyborg § Animal cyborgs\nAugust 28 – Elon Musk revealed a model of the prototype brain–computer interface chip, implanted in pigs, that his company Neuralink has been working on.[444][445]\nSeptember 3 – Scientists reported finding \"176 Open Access journals that, through lack of comprehensive and open archives, vanished from the Web between 2000 and 2019, spanning all major research disciplines and geographic regions of the world\" and that in 2019 only about a third of the 14,068 DOAJ-indexed journals ensured the long-term preservation of their content themselves, with many papers not getting archived by Web archiving initiatives such as the Internet Archive.[446][447][448] Further information: Digital preservation\nSeptember 18 – Media reported what may be the first publicly confirmed case of a civilian fatality as a nearly direct consequence of a cyberattack, after ransomware disrupted a hospital in Germany.[449][relevant?]\nSeptember 25 – [Novel application of computing / software] – Chemists described, for the first time, possible chemical pathways from nonliving prebiotic chemicals to complex biochemicals that could give rise to living organisms, based on a new computer program named ALLCHEMY.[450][451] Further information: Computational chemistry\nOctober 28 – A review suggested only surgical robot platforms \"that can effectively communicate their intent and explain their decisions to their human companions will find their way into the operating room of the future\", defined levels of autonomy and suggested \"positive evidence will soon emerge and build up\" that would motivate \"transition to clinical trials\".[452][453]\nAwards and challenges\nIn 2024, the European Union approved the Artificial Intelligence Act.[460][461]\nIn 2024, the European Union approved the Cyber Resilience Act.[462]\nOpen policy proposals\nFebruary 2: John Walker, 74, American computer programmer, author and co-founder of Autodesk[463]\nApril 23: Robert H. Dennard, 91, American electrical engineer and inventor of DRAM[464]\nMay 17: Gordon Bell, 89, American electrical engineer and manager[465]\nJune 9: Lynn Conway, 86, American computer scientist, electrical engineer, known for Mead–Conway VLSI chip design revolution[466]\nAugust 9: Susan Wojcicki, 56, American business executive, CEO of YouTube[467]\nNovember 12: Thomas E. Kurtz, 96, American computer scientist and educator[468]\nMarch 24: Gordon Moore, 94, American businessman, engineer, and co-founder of Intel Corporation[469]\nMay 5: Ian Witten, 76, English-New Zealand computer scientist, co-creator of the Sequitur algorithm, Fellow of the Royal Society of New Zealand (b. 1947).[470]\nJanuary 2: Hagit Shatkay, 56, Israeli-American computer scientist[471]\nJanuary 30: Takao Nishizeki, 74, Japanese mathematician and computer scientist[472]\nFebruary 16: Lorinda Cherry, 77, American computer scientist and programmer[473]\nFebruary 28: Mary Coombs, 93, British computer programmer[474]\nSeptember 2: Peter Eckersley, 43, Australian computer scientist[475]\nJanuary 2: Brad Cox, American computer scientist, and inventor of the Objective-C programming language (b. 1944)\nJanuary 28: Alice Recoque, French computer scientist (b. 1929)\nFebruary 1: Walter Savitch, American computer scientist and theoretical mathematician (b. 1943)\nFebruary 6: Ioan Dzițac, Romanian computer scientist and mathematician (b. 1953)\nMarch 6: Lou Ottens, Dutch engineer and inventor of the cassette tape (b. 1926)\nApril 1: Isamu Akasaki, Japanese engineer and physicist, and inventor of the blue LED (b. 1929)\nApril 16: Charles Geschke, American computer scientist, and co-founder of Adobe Inc. (b. 1939)\nApril 23: Dan Kaminsky, American computer security researcher (b. 1979)\nMay 23: Makoto Nagao, Japanese natural language processing pioneer (b. 1936)\nJune 23: John McAfee, British-American antivirus software pioneer, and founder of McAfee (b. 1945)\nJanuary 2: Robert M. Graham, American computer scientist (b. 1929)\nJanuary 3: Joseph Karr O'Connor, American computer scientist (b. 1953)\nJanuary 8: Peter T. Kirstein, British computer scientist (b. 1933)\nFebruary 11: Yasumasa Kanada, Japanese computer scientist (b. 1949)\nFebruary 16:\nLarry Tesler, American computer scientist (b. 1945)\nJohn Iliffe, British computer designer (b. 1931)\nLarry Tesler, American computer scientist (b. 1945)\nJohn Iliffe, British computer designer (b. 1931)\nFebruary 18: Bert Sutherland, American computer scientist (b. 1936)\nMarch 2: Vera Pless, American mathematician (b. 1931)\nMarch 15: Olvi L. Mangasarian, Iraqi-American computer scientist and mathematician (b. 1934)\nApril 7\nMishik Kazaryan, Russian physicist (b. 1948)\nAdrian V. Stokes, British computer scientist (b. 1945)\nMishik Kazaryan, Russian physicist (b. 1948)\nAdrian V. Stokes, British computer scientist (b. 1945)\nApril 11: John Horton Conway, British mathematician (b. 1937)\nApril 25: Thomas Huang, American computer scientist (b. 1936)\nMay 9: Timo Honkela, Finnish computer scientist (b. 1962)\nJune 5: Deborah Washington Brown, American computer scientist (b. 1952)\nJuly 10: Michael M. Richter, German mathematician and computer scientist (b. 1938)\nJuly 26: Bill English, American computer engineer and co-developer of the computer mouse (b. 1929)\nAugust 4: Frances Allen, American computer scientist, first woman to win the Turing Award (b. 1932)\nAugust 11: Russell Kirsch, American computer scientist and inventor of the first digital image scanner (b. 1929)\nAugust 25: Rebeca Guber, Argentine mathematician and computer scientist (b.1926)\nOctober 2: Victor Zalgaller, Russian-Israeli mathematician (b. 1920)\nNovember 7: Chung Laung Liu, Taiwanese computer scientist (b. 1934)\nNovember 14: Peter Pagé, German computer scientist (b. 1939)\nNovember 23: Konrad Fiałkowski, Polish computer engineer (b. 1939)\nDecember 1\nNorman Abramson, American computer scientist and engineer (b. 1932)\nEric Engstrom, American software engineer and co-creator of DirectX (b. 1965)\nNorman Abramson, American computer scientist and engineer (b. 1932)\nEric Engstrom, American software engineer and co-creator of DirectX (b. 1965)\nDecember 14: Claudio Baiocchi, Italian mathematician (b. 1940)\nDecember 22: Edmund M. Clarke, American computer scientist (b. 1945)\nDecember 23: Lars Arge, Danish computer scientist (b. 1967)\nVery broad outlines of topic domains and topics with substantial progress during the decade not yet included above with a Further information: link:\nApplications of wearable technology\nRecent applications of automation\nSmart grid#Research\nR&D of novel machine-readable media[needs update]\nDigital literacy\nRemote sensing\nCategory:Earth observation platforms\nCategory:Earth observation platforms\nDigital agriculture\nPrecision agriculture#Emerging technologies\nPrecision agriculture#Emerging technologies\nPrecision medicine\nRemote control animal\nElectronic health record\nNeurotechnology#Implants\nNeuromorphic engineering\nResearch question#ICTs, participation and routine procedures\nCategory:Free BIOS implementations\nList of open-source hardware\nInformation and communications technology\nList of unsolved problems in computer science\nOutline of finance\nOutline of public relations\nOutline of computing\nApplications of artificial intelligence\nArgumentation theory#Artificial intelligence\nExplainable artificial intelligence\nArtificial intelligence art\nArgumentation theory#Artificial intelligence\nExplainable artificial intelligence\nArtificial intelligence art\nClimate change mitigation#Research\nEducation#Development\nArchivist#On the Internet\nDecision-making software\nEmulator\nVideo game console emulator[needs update]\nVideo game console emulator[needs update]\nTechnical standard\nSupply chain sustainability#Software\nSustainability standards and certification[needs update]\nSustainability standards and certification[needs update]\nLinux for mobile devices\nUsage share of operating systems\nImpact of the COVID-19 pandemic on education\nLearning management system#COVID-19 and learning management systems[needs update]\nLearning management system#COVID-19 and learning management systems[needs update]\nImpact of the COVID-19 pandemic on science and technology\nSoftware for COVID-19 pandemic mitigation\nEconomic events and economics\n2020–present global chip shortage\nCryptocurrency bubble#2020–2022 cryptocurrency bubble\nBug bounty program#Notable programs[needs update]\nChina–United States trade war#2020 or general technological sovereignty[needs update] policies\nBusiness models for open-source software#FOSS and economy[476]\nDigital transformation#History[needs update]\nDistributive justice[needs update]\nSustainable distribution[needs update]\nSustainable design[needs update]\nAlgorithms for resource allocation\nSustainable food system decision-making[additional citation(s) needed]\n2020s in economic history#Remote work\nMoore's law#Recent trends\nSmartphone#Other developments in the 2020s\nSmartwatch#2020s\nTimeline of quantum computing and communication#2020s\nTimeline of free and open-source software#2020s[needs update]\nFirefox version history\nHistory of Linux\nTimeline of Linux adoption[needs update]\nLinux gaming#2017-present\nFirefox version history\nHistory of Linux\nTimeline of Linux adoption[needs update]\nLinux gaming#2017-present\nTimeline of Linux adoption[needs update]\nLinux gaming#2017-present\nTimeline of social media\nTimeline of file sharing#2010s[needs update]\nTimeline of e-commerce[needs update]\nTimeline of transportation technology#Autonomous vehicles\nTimeline of WhatsApp\nTimeline of programming languages#2020s\nTimeline of machine learning\nTimeline of hypertext technology[needs update]\nTimeline of artificial intelligence\nHistory of supercomputing\nTOP500#TOP 500\nHistory of Wikipedia\n^ @fifteenai (May 18, 2025). \"We are so back. https://15.dev Only MLP characters for now. More characters, features, and improvements will be added soon. Check Twitter and/or the Discord server (linked on the website) for updates! (Expect possible downtime as I calibrate server capacity and GPU allocations depending on how busy the website gets.)\" (Tweet). Archived from the original on October 4, 2025. Retrieved May 18, 2025 – via Twitter.\n^ Allyn, Bobby (January 14, 2025). \"'The New York Times' takes OpenAI to court. ChatGPT's future could be on the line\". NPR. Retrieved January 21, 2025.\n^ \"OpenAI has created an AI model for longevity science\". MIT Technology Review. Retrieved January 21, 2025.\n^ \"DeepSeek explained: Everything you need to know\". WhatIs. Retrieved January 30, 2025.\n^ Scotellaro, Shaun (May 19, 2025). \"15.ai Returns with Pony Voice Creation as the Focus\". Equestria Daily. Archived from the original on August 22, 2025. Retrieved May 19, 2025.\n^ Prisco, Jacopo (January 12, 2024). \"Are fingerprints unique? Not really, AI-based study says\". CNN. Retrieved May 9, 2024.\n^ Guo, Gabe; Ray, Aniv; Izydorczak, Miles; Goldfeder, Judah; Lipson, Hod; Xu, Wenyao (January 12, 2024). \"Unveiling intra-person fingerprint similarity via deep contrastive learning\". Science Advances. 10 (2) eadi0329. Bibcode:2024SciA...10I.329G. doi:10.1126/sciadv.adi0329. ISSN 2375-2548. PMC 10786417. PMID 38215200.\n^ Petersen, Tanya. \"AI's new power of persuasion: Study shows LLMs can exploit personal information to change your mind\". techxplore.com. Retrieved May 15, 2024.\n^ Salvi, Francesco; Manoel Horta Ribeiro; Gallotti, Riccardo; West, Robert (May 2025). \"On the conversational persuasiveness of GPT-4\". Nature Human Behaviour. 9 (8): 1645–1653. arXiv:2403.14380. doi:10.1038/s41562-025-02194-6. ISSN 2397-3374. PMC 12367540. PMID 40389594.\n^ Wiggers, Kyle (February 15, 2024). \"This German nonprofit is building an open voice assistant that anyone can use\". TechCrunch. Retrieved May 13, 2024.\n^ Emir, Can. \"AI waste-sorting robot to detect over 500 waste categories\". Interesting Engineering. Retrieved May 13, 2024.\n^ Liang, Yaobo; Wu, Chenfei; Song, Ting; Wu, Wenshan; Xia, Yan; Liu, Yu; Ou, Yang; Lu, Shuai; Ji, Lei; Mao, Shaoguang; Wang, Yun; Shou, Linjun; Gong, Ming; Duan, Nan (January 2024). \"TaskMatrix.AI: Completing Tasks by Connecting Foundation Models with Millions of APIs\". Intelligent Computing. 3 0063. arXiv:2303.16434. doi:10.34133/icomputing.0063. ISSN 2771-5892.\n^ David, Emilia (March 18, 2024). \"xAI open sources Grok\". The Verge. Retrieved June 8, 2024.\n^ \"Grokking X.ai's Grok—Real Advance or Just Real Troll? - IEEE Spectrum\". IEEE. Retrieved June 8, 2024.\n^ \"The Nobel Prize in Physics 2024\". NobelPrize.org. Archived from the original on October 9, 2024. Retrieved October 12, 2025.\n^ Yirka, Bob. \"A DVD-sized disk that can store 1 million movies\". techxplore.com. Retrieved May 13, 2024.\n^ Zhao, Miao; Wen, Jing; Hu, Qiao; Wei, Xunbin; Zhong, Yu-Wu; Ruan, Hao; Gu, Min (February 2024). \"A 3D nanoscale optical disk memory with petabit capacity\". Nature. 626 (8000): 772–778. Bibcode:2024Natur.626..772Z. doi:10.1038/s41586-023-06980-y. ISSN 1476-4687. PMID 38383625.\n^ \"Global Internet use continues to rise but disparities remain, especially in low-income regions\". International Telecommunication Union.\n^ \"ITU: Global Internet users hit 5.5 billion, digital divide persists\". Developing Telecom.\n^ a b Bubeck, Sébastien; Chandrasekaran, Varun; Eldan, Ronen; Gehrke, Johannes; Horvitz, Eric; Kamar, Ece; Lee, Peter; Lee, Yin Tat; Li, Yuanzhi; Lundberg, Scott; Nori, Harsha; Palangi, Hamid; Ribeiro, Marco Tulio; Zhang, Yi (April 13, 2023). \"Sparks of Artificial General Intelligence: Early experiments with GPT-4\". arXiv:2303.12712 [cs.CL].\n^ \"What is ChatGPT and why does it matter? Here's everything you need to know\". ZDNET. Archived from the original on February 15, 2023. Retrieved February 18, 2023.\n^ Villasenor, John. \"How ChatGPT Can Improve Education, Not Threaten it\". Scientific American. Archived from the original on February 17, 2023. Retrieved February 18, 2023.\n^ Ruzich, Dan (February 14, 2023). \"CU Denver Panel Discusses the Role of ChatGPT in Higher Education -\". CU Denver News. Archived from the original on February 18, 2023. Retrieved February 18, 2023.\n^ Dastin, Jeffrey (March 21, 2023). \"Google begins opening access to its ChatGPT competitor Bard\". Reuters. Retrieved April 23, 2023.\n^ \"Google Bard can now help write software code\". Reuters. April 21, 2023. Retrieved April 23, 2023.\n^ \"DuckDuckGo launches DuckAssist: a new feature that generates natural language answers to search queries using Wikipedia\". March 8, 2023. Retrieved April 23, 2023.\n^ Lomas, Natasha (March 8, 2023). \"DuckDuckGo dabbles with AI search\". TechCrunch. Retrieved April 23, 2023.\n^ Roth, Emma (March 8, 2023). \"DuckDuckGo's building AI-generated answers into its search engine\". The Verge. Retrieved April 23, 2023.\n^ Weller, Orion; Marone, Marc; Weir, Nathaniel; Lawrie, Dawn; Khashabi, Daniel; Benjamin Van Durme (May 22, 2023). \"\"According to ...\" Prompting Language Models Improves Quoting from Pre-Training Data\". arXiv:2305.13252 [cs.CL].\n^ Pinchuk, Maryana (July 13, 2023). \"Exploring paths for the future of free knowledge: New Wikipedia ChatGPT plugin, leveraging rich media social apps, and other experiments\". Diff. Retrieved August 10, 2023.\n^ Bello, Camille (April 1, 2023). \"These AI tools could help boost your academic research\". euronews. Retrieved April 23, 2023.\n^ \"AI literacy might be ChatGPT's biggest lesson for schools\". MIT Technology Review. Retrieved April 23, 2023.\n^ Hillier, Mathew (February 20, 2023). \"Why does ChatGPT generate fake references?\". TECHE. Retrieved April 23, 2023.\n^ Bello, Camille (May 8, 2023). \"These AI tools could help boost your academic research\". euronews. Retrieved May 15, 2023.\n^ Edwards, Benj (March 13, 2023). \"You can now run a GPT-3-level AI model on your laptop, phone, and Raspberry Pi\". Ars Technica.\n^ \"RedPajama replicates LLaMA dataset to build open source, state-of-the-art LLMs\". VentureBeat. April 18, 2023. Retrieved May 28, 2023.\n^ Metz, Cade; Isaac, Mike (May 18, 2023). \"In Battle Over A.I., Meta Decides to Give Away Its Crown Jewels\". The New York Times. Retrieved May 28, 2023.\n^ \"What is Auto-GPT? Everything to know about the next powerful AI tool\". ZDNET. Retrieved May 28, 2023.\n^ Liu, Nelson F.; Zhang, Tianyi; Liang, Percy (2023). \"Evaluating Verifiability in Generative Search Engines\". arXiv:2304.09848 [cs.CL].\n^ Huang, Rongjie; Li, Mingze; Yang, Dongchao; Shi, Jiatong; Chang, Xuankai; Ye, Zhenhui; Wu, Yuning; Hong, Zhiqing; Huang, Jiawei; Liu, Jinglin; Ren, Yi; Zhao, Zhou; Watanabe, Shinji (2023). \"AudioGPT: Understanding and Generating Speech, Music, Sound, and Talking Head\". arXiv:2304.12995 [cs.CL].\n^ Spirling, Arthur (April 18, 2023). \"Why open-source generative AI models are an ethical way forward for science\". Nature. 616 (7957): 413. Bibcode:2023Natur.616..413S. doi:10.1038/d41586-023-01295-4. PMID 37072520. S2CID 258183146.\n^ Roth, Emma (April 19, 2023). \"Stability AI announces new open-source large language model\". The Verge. Retrieved May 28, 2023.\n^ Gao, Kyle; Gao, Yina; He, Hongjie; Lu, Dening; Xu, Linlin; Li, Jonathan (December 18, 2022). \"NeRF: Neural Radiance Field in 3D Vision, A Comprehensive Review\". arXiv:2210.00379 [cs.CV].\n^ \"UC Berkeley's Instruct-NeRF2NeRF Edits 3D Scenes With Text Instructions | Synced\". syncedreview.com. April 11, 2023. Retrieved April 23, 2023.\n^ Haque, Ayaan; Tancik, Matthew; Efros, Alexei A.; Holynski, Aleksander; Kanazawa, Angjoo (March 22, 2023). \"Instruct-NeRF2NeRF: Editing 3D Scenes with Instructions\". arXiv:2303.12789 [cs.CV].\n^ \"Musk, scientists call for halt to AI race sparked by ChatGPT\". AP NEWS. March 29, 2023. Retrieved April 23, 2023.\n^ \"Pause Giant AI Experiments: An Open Letter\". Future of Life Institute. Retrieved April 23, 2023.\n^ Knight, Will. \"Some Glimpse AGI in ChatGPT. Others Call It a Mirage\". Wired. Retrieved April 23, 2023.\n^ VK, Anirudh (April 13, 2023). \"LLMs Can Now Self-Debug. Should Developers Be Worried?\". Analytics India Magazine. Retrieved April 23, 2023.\n^ \"AI has better 'bedside manner' than some doctors, study finds\". The Guardian. April 28, 2023. Retrieved April 29, 2023.\n^ Ayers, John W.; Poliak, Adam; Dredze, Mark; Leas, Eric C.; Zhu, Zechariah; Kelley, Jessica B.; Faix, Dennis J.; Goodman, Aaron M.; Longhurst, Christopher A.; Hogarth, Michael; Smith, Davey M. (April 28, 2023). \"Comparing Physician and Artificial Intelligence Chatbot Responses to Patient Questions Posted to a Public Social Media Forum\". JAMA Internal Medicine. 183 (6): 589–596. doi:10.1001/jamainternmed.2023.1838. ISSN 2168-6106. PMC 10148230. PMID 37115527.\n^ \"Google's AI is best yet at answering medical and health questions\". New Scientist. Archived from the original on January 25, 2023. Retrieved February 18, 2023.\n^ Papadopoulos, Loukia (January 4, 2023). \"Google and DeepMind just launched MedPaLM, a large language model\". interestingengineering.com. Archived from the original on February 11, 2023. Retrieved February 18, 2023.\n^ Singhal, Karan; Azizi, Shekoofeh; Tu, Tao; Mahdavi, S. Sara; Wei, Jason; Chung, Hyung Won; Scales, Nathan; Tanwani, Ajay; Cole-Lewis, Heather; Pfohl, Stephen; Payne, Perry; Seneviratne, Martin; Gamble, Paul; Kelly, Chris; Scharli, Nathaneal; Chowdhery, Aakanksha; Mansfield, Philip; Arcas, Blaise Aguera y; Webster, Dale; Corrado, Greg S.; Matias, Yossi; Chou, Katherine; Gottweis, Juraj; Tomasev, Nenad; Liu, Yun; Rajkomar, Alvin; Barral, Joelle; Semturs, Christopher; Karthikesalingam, Alan; Natarajan, Vivek (December 26, 2022). \"Large Language Models Encode Clinical Knowledge\". arXiv:2212.13138 [cs.CL].\n^ Langford, Aisha T.; Roberts, Timothy; Gupta, Jaytin; Orellana, Kerli T.; Loeb, Stacy (May 2020). \"Impact of the Internet on Patient-Physician Communication\". European Urology Focus. 6 (3): 440–444. doi:10.1016/j.euf.2019.09.012. PMID 31582312. S2CID 203660703.\n^ Tan, Sharon Swee-Lin; Goonawardene, Nadee (January 19, 2017). \"Internet Health Information Seeking and the Patient-Physician Relationship: A Systematic Review\". Journal of Medical Internet Research. 19 (1) e9. doi:10.2196/jmir.5729. PMC 5290294. PMID 28104579.\n^ Ramsey, Imogen; Corsini, Nadia; Peters, Micah D.J.; Eckert, Marion (September 2017). \"A rapid review of consumer health information needs and preferences\". Patient Education and Counseling. 100 (9): 1634–1642. doi:10.1016/j.pec.2017.04.005. PMID 28442155.\n^ Boyer, Célia; Gaudinat, Arnaud; Hanbury, Allan; Appel, Ron D.; Ball, Marion J.; Carpentier, Michel; van Bemmel, Jan H.; Bergmans, Jean-Paul; Hochstrasser, Denis; Lindberg, Donald; Miller, Randolph; Peterschmitt, Jean-Claude; Safran, Charles; Thonnet, Michèle; Geissbühler, Antoine (2017). \"Accessing Reliable Health Information on the Web: A Review of the HON Approach\". MEDINFO 2017: Precision Healthcare Through Informatics. Studies in Health Technology and Informatics. 245: 1004–1008. doi:10.3233/978-1-61499-830-3-1004. PMID 29295252.\n^ a b Gonchar, Michael; Engle, Jeremy (October 26, 2020). \"Should Media Literacy Be a Required Course in School?\". The New York Times. Archived from the original on October 7, 2022. Retrieved February 18, 2023.\n^ a b Pangrazio, Luci; Godhe, Anna-Lena; Ledesma, Alejo González López (November 2020). \"What is digital literacy? A comparative review of publications across three language contexts\". E-Learning and Digital Media. 17 (6): 442–459. doi:10.1177/2042753020946291. S2CID 223518782.\n^ Bugeja, Michael. \"Opinion: Our schools need digital literacy as machine learning, artificial intelligence expand\". The Des Moines Register. Archived from the original on February 19, 2023. Retrieved February 18, 2023.\n^ a b Lancet, The (November 12, 2022). \"Why is health literacy failing so many?\". The Lancet. 400 (10364): 1655. doi:10.1016/S0140-6736(22)02301-7. ISSN 0140-6736. PMID 36366878. S2CID 253457427.\n^ \"Google's Muse model could be the next big thing for generative AI\". VentureBeat. January 13, 2023. Archived from the original on February 18, 2023. Retrieved February 18, 2023.\n^ Chang, Huiwen; Zhang, Han; Barber, Jarred; Maschinot, A. J.; Lezama, Jose; Jiang, Lu; Yang, Ming-Hsuan; Murphy, Kevin; Freeman, William T.; Rubinstein, Michael; Li, Yuanzhen; Krishnan, Dilip (January 2, 2023). \"Muse: Text-To-Image Generation via Masked Generative Transformers\". arXiv:2301.00704 [cs.CV].\n^ Insinna, Valerie (January 4, 2023). \"Inside the special F-16 the Air Force is using to test out AI\". Breaking Defense. Archived from the original on February 9, 2023. Retrieved February 18, 2023.\n^ Gitlin, Jonathan M. (February 14, 2023). \"The US Air Force successfully tested this AI-controlled jet fighter\". Ars Technica. Archived from the original on February 16, 2023. Retrieved February 18, 2023.\n^ \"Fully autonomous F-16 fighter jet takes part in simulated dogfights\". New Scientist. Archived from the original on February 18, 2023. Retrieved February 18, 2023.\n^ Paleja, Ameya (January 10, 2023). \"Microsoft unveils VALL-E, a text-to-speech AI that can be trained in just 3 seconds\". interestingengineering.com. Archived from the original on February 18, 2023. Retrieved February 18, 2023.\n^ Wang, Chengyi; Chen, Sanyuan; Wu, Yu; Zhang, Ziqiang; Zhou, Long; Liu, Shujie; Chen, Zhuo; Liu, Yanqing; Wang, Huaming; Li, Jinyu; He, Lei; Zhao, Sheng; Wei, Furu (2025). \"Neural Codec Language Models are Zero-Shot Text to Speech Synthesizers\". IEEE Transactions on Audio. 33: 705. arXiv:2301.02111. Bibcode:2025ITASL..33..705C. doi:10.1109/TASLPRO.2025.3530270.\n^ Saha, Shritama (January 12, 2023). \"DeepMind Unleashes DreamerV3, A Multi-Domain World Model\". Analytics India Magazine. Archived from the original on February 18, 2023. Retrieved February 18, 2023.\n^ Hafner, Danijar; Pasukonis, Jurgis; Ba, Jimmy; Lillicrap, Timothy (January 10, 2023). \"Mastering Diverse Domains through World Models\". arXiv:2301.04104 [cs.AI].\n^ Lowe, Derek. \"Making Up Proteins\". Science. Archived from the original on February 18, 2023. Retrieved February 18, 2023.\n^ Madani, Ali; Krause, Ben; Greene, Eric R.; Subramanian, Subu; Mohr, Benjamin P.; Holton, James M.; Olmos, Jose Luis; Xiong, Caiming; Sun, Zachary Z.; Socher, Richard; Fraser, James S.; Naik, Nikhil (January 26, 2023). \"Large language models generate functional protein sequences across diverse families\". Nature Biotechnology. 41 (8): 1099–1106. Bibcode:2023NatBi..41.1099M. doi:10.1038/s41587-022-01618-2. ISSN 1546-1696. OSTI 2282481. PMC 10400306. PMID 36702895. S2CID 256304602.\n^ McFadden, Christopher (January 26, 2023). \"A new AI-powered gene-editing technique could be set to replace CRISPR\". interestingengineering.com. Archived from the original on February 18, 2023. Retrieved February 18, 2023.\n^ Ichikawa, David M.; Abdin, Osama; Alerasool, Nader; Kogenaru, Manjunatha; Mueller, April L.; Wen, Han; Giganti, David O.; Goldberg, Gregory W.; Adams, Samantha; Spencer, Jeffrey M.; Razavi, Rozita; Nim, Satra; Zheng, Hong; Gionco, Courtney; Clark, Finnegan T.; Strokach, Alexey; Hughes, Timothy R.; Lionnet, Timothee; Taipale, Mikko; Kim, Philip M.; Noyes, Marcus B. (January 26, 2023). \"A universal deep-learning model for zinc finger design enables transcription factor reprogramming\". Nature Biotechnology. 41 (8): 1117–1129. doi:10.1038/s41587-022-01624-4. ISSN 1546-1696. PMC 10421740. PMID 36702896.\n^ Saha, Shritama (February 8, 2023). \"Give a Prompt, Make a Video\". Analytics India Magazine. Archived from the original on February 18, 2023. Retrieved February 18, 2023.\n^ Singer, Uriel; Sheynin, Shelly; Polyak, Adam; Ashual, Oron; Makarov, Iurii; Kokkinos, Filippos; Goyal, Naman; Vedaldi, Andrea; Parikh, Devi; Johnson, Justin; Taigman, Yaniv (January 26, 2023). \"Text-To-4D Dynamic Scene Generation\". arXiv:2301.11280 [cs.CV].\n^ Young, Chris (January 31, 2023). \"AI algorithm pinpoints 8 radio signals that may have come from aliens\". interestingengineering.com. Archived from the original on February 18, 2023. Retrieved February 18, 2023.\n^ Ma, Peter Xiangyuan; Ng, Cherry; Rizk, Leandro; Croft, Steve; Siemion, Andrew P. V.; Brzycki, Bryan; Czech, Daniel; Drew, Jamie; Gajjar, Vishal; Hoang, John; Isaacson, Howard; Lebofsky, Matt; MacMahon, David H. E.; de Pater, Imke; Price, Danny C.; Sheikh, Sofia Z.; Worden, S. Pete (January 30, 2023). \"A deep-learning search for technosignatures from 820 nearby stars\". Nature Astronomy. 7: 492. arXiv:2301.12670. Bibcode:2023NatAs...7..492M. doi:10.1038/s41550-022-01872-z. ISSN 2397-3366. S2CID 256389424.\n^ Knight, Will. \"Should Algorithms Control Nuclear Launch Codes? The US Says No\". Wired. Retrieved March 27, 2023.\n^ \"US issues declaration on responsible use of AI in the military\". Reuters. February 16, 2023. Retrieved March 27, 2023.\n^ \"Political Declaration on Responsible Military Use of Artificial Intelligence and Autonomy\". U.S. Department of State – Bureau of Arms Control, Verification and Compliance. February 16, 2023. Retrieved March 27, 2023.\n^ Sterling, Toby (February 16, 2023). \"U.S., China, other nations urge 'responsible' use of military AI\". Reuters. Retrieved April 1, 2023.\n^ \"'It's perfect': World's first generative AI-designed COVID drug to start clinical trials\". The Star. February 23, 2023. Retrieved February 24, 2023.\n^ Wiggers, Kyle (March 14, 2023). \"OpenAI releases GPT-4, a multimodal AI that it claims is state-of-the-art\". TechCrunch. Retrieved April 23, 2023.\n^ \"GPT-4\". OpenAI. March 14, 2023. Retrieved March 14, 2023.\n^ Ahmed, Nur; Wahed, Muntasir; Thompson, Neil C. (2023). \"The growing influence of industry in AI research\" (PDF). Science. 379 (6635): 884–886. Bibcode:2023Sci...379..884A. doi:10.1126/science.ade2420. PMID 36862769. S2CID 257283258.\n^ \"Google's PaLM-E is a generalist robot brain that takes commands\". Ars Technica. March 7, 2023. Retrieved March 9, 2023.\n^ \"PaLM-E: An Embodied Multimodal Language Model\". Github. March 7, 2023. Retrieved March 9, 2023. arXiv:2303.03378\n^ a b Cornelio, Cristina; Dash, Sanjeeb; Austel, Vernon; Josephson, Tyler R.; Goncalves, Joao; Clarkson, Kenneth L.; Megiddo, Nimrod; El Khadir, Bachir; Horesh, Lior (April 12, 2023). \"Combining data and theory for derivable scientific discovery with AI-Descartes\". Nature Communications. 14 (1): 1777. Bibcode:2023NatCo..14.1777C. doi:10.1038/s41467-023-37236-y. ISSN 2041-1723. PMC 10097814. PMID 37045814.\n^ Sorokina, Olsy. \"'AI scientist' brings us a step closer to the age of machine-generated scientific discovery\". CBC. Retrieved May 28, 2023.\n^ Tang, Jerry; LeBel, Amanda; Jain, Shailee; Huth, Alexander G. (May 2023). \"Semantic reconstruction of continuous language from non-invasive brain recordings\". Nature Neuroscience. 26 (5): 858–866. bioRxiv 10.1101/2022.09.29.509744. doi:10.1038/s41593-023-01304-9. ISSN 1546-1726. PMC 11304553. PMID 37127759. S2CID 252684880.\n^ Zhang, He; Zhang, Liang; Lin, Ang; Xu, Congcong; Li, Ziyu; Liu, Kaibo; Liu, Boxiang; Ma, Xiaopin; Zhao, Fanfan; Jiang, Huiling; Chen, Chunxiu; Shen, Haifa; Li, Hangwen; Mathews, David H.; Zhang, Yujian; Huang, Liang (May 2, 2023). \"Algorithm for Optimized mRNA Design Improves Stability and Immunogenicity\" (PDF). Nature. 621 (7978): 396–403. arXiv:2004.10177. Bibcode:2023Natur.621..396Z. doi:10.1038/s41586-023-06127-z. ISSN 1476-4687. PMC 10499610. PMID 37130545. S2CID 247594015.\n^ a b Schirner, Michael; Deco, Gustavo; Ritter, Petra (May 23, 2023). \"Learning how network structure shapes decision-making for bio-inspired computing\". Nature Communications. 14 (1): 2963. Bibcode:2023NatCo..14.2963S. doi:10.1038/s41467-023-38626-y. ISSN 2041-1723. PMC 10206104. PMID 37221168.\nUniversity press release: Seltmann, Stefanie. \"Intelligent brains take longer to solve difficult problems, shows simulation study\". Berlin Institute of Health in der Charité via medicalxpress.com. Retrieved June 24, 2023.\nUniversity press release: Seltmann, Stefanie. \"Intelligent brains take longer to solve difficult problems, shows simulation study\". Berlin Institute of Health in der Charité via medicalxpress.com. Retrieved June 24, 2023.\n^ \"Schlau heißt nicht schnell: Intelligente Gehirne \"ticken\" oft langsamer | MDR.DE\". MDR (in German). Retrieved June 24, 2023.\n^ Liu, Gary; Catacutan, Denise B.; Rathod, Khushi; Swanson, Kyle; Jin, Wengong; Mohammed, Jody C.; Chiappino-Pepe, Anush; Syed, Saad A.; Fragis, Meghan; Rachwalski, Kenneth; Magolan, Jakob; Surette, Michael G.; Coombes, Brian K.; Jaakkola, Tommi; Barzilay, Regina; Collins, James J.; Stokes, Jonathan M. (May 25, 2023). \"Deep learning-guided discovery of an antibiotic targeting Acinetobacter baumannii\". Nature Chemical Biology. 19 (11): 1342–1350. doi:10.1038/s41589-023-01349-8. ISSN 1552-4469. PMID 37231267. S2CID 258909341.\nUniversity press release: \"Scientists use AI to find promising new antibiotic to fight evasive hospital superbug\". McMaster University. May 25, 2023. Retrieved May 25, 2023.\nUniversity press release: \"Scientists use AI to find promising new antibiotic to fight evasive hospital superbug\". McMaster University. May 25, 2023. Retrieved May 25, 2023.\n^ \"AI algorithms find drugs that could combat ageing\". University of Edinburgh. June 14, 2023. Retrieved June 16, 2023.\n^ Smer-Barreto, Vanessa; Quintanilla, Andrea; Elliott, Richard J. R.; Dawson, John C.; Sun, Jiugeng; Campa, Víctor M.; Lorente-Macías, Álvaro; Unciti-Broceta, Asier; Carragher, Neil O.; Acosta, Juan Carlos; Oyarzún, Diego A. (June 10, 2023). \"Discovery of senolytics using machine learning\". Nature Communications. 14 (1): 3445. Bibcode:2023NatCo..14.3445S. doi:10.1038/s41467-023-39120-1. ISSN 2041-1723. PMC 10257182. PMID 37301862.\n^ \"How this moment for AI will change society forever (and how it won't)\". New Scientist. Retrieved July 27, 2023.\n^ \"Stop talking about tomorrow's AI doomsday when AI poses risks today\". Nature. 618 (7967): 885–886. June 27, 2023. Bibcode:2023Natur.618..885.. doi:10.1038/d41586-023-02094-7. PMID 37369844. S2CID 259254557.\n^ Arnold, Carrie (June 1, 2023). \"Inside the nascent industry of AI-designed drugs\". Nature Medicine. 29 (6): 1292–1295. doi:10.1038/s41591-023-02361-0. PMID 37264208. S2CID 259025019.\n^ Hu, Shengran; Clune, Jeff (2023). \"Thought Cloning: Learning to Think while Acting by Imitating Human Thinking\". arXiv:2306.00323 [cs.AI].\n^ Sourati, Jamshid; Evans, James A. (July 13, 2023). \"Accelerating science with human-aware artificial intelligence\". Nature Human Behaviour. 7 (10): 1682–1696. arXiv:2306.01495. doi:10.1038/s41562-023-01648-z. ISSN 2397-3374. PMID 37443269. S2CID 259064119.\n^ Liesenfeld, Andreas; Lopez, Alianda; Dingemanse, Mark (July 19, 2023). \"Opening up ChatGPT: Tracking openness, transparency, and accountability in instruction-tuned text generators\". Proceedings of the 5th International Conference on Conversational User Interfaces. ACM. pp. 1–6. arXiv:2307.05532. doi:10.1145/3571884.3604316. ISBN 979-8-4007-0014-9. S2CID 259837343.\n\"Interactive up-to-date table\".\n\"Interactive up-to-date table\".\n^ Lång, Kristina; Josefsson, Viktoria; Larsson, Anna-Maria; Larsson, Stefan; Högberg, Charlotte; Sartor, Hanna; Hofvind, Solveig; Andersson, Ingvar; Rosso, Aldana (August 2023). \"Artificial intelligence-supported screen reading versus standard double reading in the Mammography Screening with Artificial Intelligence trial (MASAI): a clinical safety analysis of a randomised, controlled, non-inferiority, single-blinded, screening accuracy study\". The Lancet Oncology. 24 (8): 936–944. doi:10.1016/S1470-2045(23)00298-X. hdl:10037/32977. PMID 37541274. S2CID 260414569.\n^ Wang, Hanchen; Fu, Tianfan; Du, Yuanqi; Gao, Wenhao; Huang, Kexin; Liu, Ziming; Chandak, Payal; Liu, Shengchao; Van Katwyk, Peter; Deac, Andreea; Anandkumar, Anima; Bergen, Karianne; Gomes, Carla P.; Ho, Shirley; Kohli, Pushmeet; Lasenby, Joan; Leskovec, Jure; Liu, Tie-Yan; Manrai, Arjun; Marks, Debora; Ramsundar, Bharath; Song, Le; Sun, Jimeng; Tang, Jian; Veličković, Petar; Welling, Max; Zhang, Linfeng; Coley, Connor W.; Bengio, Yoshua; Zitnik, Marinka (August 2023). \"Scientific discovery in the age of artificial intelligence\" (PDF). Nature. 620 (7972): 47–60. Bibcode:2023Natur.620...47W. doi:10.1038/s41586-023-06221-2. ISSN 1476-4687. PMID 37532811. S2CID 260384616.\n^ Saad, Omar M.; Chen, Yunfeng; Savvaidis, Alexandros; Fomel, Sergey; Jiang, Xiuxuan; Huang, Dino; Oboué, Yapo Abolé Serge Innocent; Yong, Shanshan; Wang, Xin'an; Zhang, Xing; Chen, Yangkang (September 5, 2023). \"Earthquake Forecasting Using Big Data and Artificial Intelligence: A 30-Week Real-Time Case Study in China\". Bulletin of the Seismological Society of America. 113 (6): 2461–2478. Bibcode:2023BuSSA.113.2461S. doi:10.1785/0120230031. S2CID 261570732.\nUniversity press release: \"AI-driven earthquake forecasting shows promise in trials\". University of Texas at Austin via phys.org. Retrieved November 12, 2023.\nUniversity press release: \"AI-driven earthquake forecasting shows promise in trials\". University of Texas at Austin via phys.org. Retrieved November 12, 2023.\n^ Walsh, Brendan; Hamilton, Mark; Newby, Greg; Wang, Xi; Ruan, Serena; Zhao, Sheng; He, Lei; Zhang, Shaofei; Dettinger, Eric; Freeman, William T.; Weimer, Markus (2023). \"Large-Scale Automatic Audiobook Creation\". arXiv:2309.03926 [cs.SD].\n^ Fadelli, Ingrid. \"An interactive platform that explains machine learning models to its users\". techxplore.com. Retrieved November 12, 2023.\n^ Slack, Dylan; Krishna, Satyapriya; Lakkaraju, Himabindu; Singh, Sameer (August 2023). \"Explaining machine learning models with interactive natural language conversations using TalkToModel\". Nature Machine Intelligence. 5 (8): 873–883. doi:10.1038/s42256-023-00692-8. ISSN 2522-5839.\n^ Nasr, Milad; Carlini, Nicholas; Hayase, Jonathan; Jagielski, Matthew; Feder Cooper, A.; Ippolito, Daphne; Choquette-Choo, Christopher A.; Wallace, Eric; Tramèr, Florian; Lee, Katherine (2023). \"Scalable Extraction of Training Data from (Production) Language Models\". arXiv:2311.17035 [cs.LG].\n^ \"Introducing Gemini: our largest and most capable AI model\". Google. December 6, 2023.\n^ \"Gemini - Google DeepMind\". deepmind.google. May 14, 2024.\n^ \"Google claims new Gemini AI 'thinks more carefully'\". December 6, 2023 – via www.bbc.co.uk.\n^ Team, Gemini; et al. (2023). \"Gemini: A Family of Highly Capable Multimodal Models\". arXiv:2312.11805 [cs.CL].\n^ \"Using AI, MIT researchers identify a new class of antibiotic candidates\". MIT. December 20, 2023. Retrieved December 30, 2023.\n^ Wong, Felix; Zheng, Erica J.; Valeri, Jacqueline A.; Donghia, Nina M.; Anahtar, Melis N.; Omori, Satotaka; Li, Alicia; Cubillos-Ruiz, Andres; Krishnan, Aarti; Jin, Wengong; Manson, Abigail L.; Friedrichs, Jens; Helbig, Ralf; Hajian, Behnoush; Fiejtek, Dawid K.; Wagner, Florence F.; Soutter, Holly H.; Earl, Ashlee M.; Stokes, Jonathan M.; Renner, Lars D.; Collins, James J. (February 2024). \"Discovery of a structural class of antibiotics with explainable deep learning\" (PDF). Nature. 626 (7997): 177–185. Bibcode:2024Natur.626..177W. doi:10.1038/s41586-023-06887-8. ISSN 1476-4687. PMC 10866013. PMID 38123686.\n^ Dama, Adam C.; Kim, Kevin S.; Leyva, Danielle M.; Lunkes, Annamarie P.; Schmid, Noah S.; Jijakli, Kenan; Jensen, Paul A. (June 2023). \"BacterAI maps microbial metabolism without prior knowledge\". Nature Microbiology. 8 (6): 1018–1025. doi:10.1038/s41564-023-01376-0. ISSN 2058-5276. PMID 37142775. S2CID 258508291.\nUniversity press release: \"AI could run a million microbial experiments per year\". University of Michigan News. May 4, 2023. Retrieved June 25, 2023.\nUniversity press release: \"AI could run a million microbial experiments per year\". University of Michigan News. May 4, 2023. Retrieved June 25, 2023.\n^ Xuan, Yinan; Barry, Colin; De Souza, Jessica; Wen, Jessica H.; Antipa, Nick; Moore, Alison A.; Wang, Edward J. (May 29, 2023). \"Ultra-low-cost mechanical smartphone attachment for no-calibration blood pressure measurement\". Scientific Reports. 13 (1): 8105. Bibcode:2023NatSR..13.8105X. doi:10.1038/s41598-023-34431-1. ISSN 2045-2322. PMC 10227087. PMID 37248245.\n^ \"ctheodoris/Geneformer · Hugging Face\". huggingface.co. June 25, 2023. Retrieved June 26, 2023.\n^ Theodoris, Christina V.; Xiao, Ling; Chopra, Anant; Chaffin, Mark D.; Al Sayed, Zeina R.; Hill, Matthew C.; Mantineo, Helene; Brydon, Elizabeth M.; Zeng, Zexian; Liu, X. Shirley; Ellinor, Patrick T. (June 2023). \"Transfer learning enables predictions in network biology\". Nature. 618 (7965): 616–624. Bibcode:2023Natur.618..616T. doi:10.1038/s41586-023-06139-9. ISSN 1476-4687. PMC 10949956. PMID 37258680. S2CID 259002047.\nLay summary: Williams, Sarah C. P. \"Artificial intelligence system predicts consequences of gene modifications\". Gladstone Institutes via medicalxpress.com. Retrieved June 25, 2023.\nLay summary: Williams, Sarah C. P. \"Artificial intelligence system predicts consequences of gene modifications\". Gladstone Institutes via medicalxpress.com. Retrieved June 25, 2023.\n^ Watson, Joseph L.; Juergens, David; Bennett, Nathaniel R.; Trippe, Brian L.; Yim, Jason; Eisenach, Helen E.; Ahern, Woody; Borst, Andrew J.; Ragotte, Robert J.; Milles, Lukas F.; Wicky, Basile I. M.; Hanikel, Nikita; Pellock, Samuel J.; Courbet, Alexis; Sheffler, William; Wang, Jue; Venkatesh, Preetham; Sappington, Isaac; Torres, Susana Vázquez; Lauko, Anna; De Bortoli, Valentin; Mathieu, Emile; Ovchinnikov, Sergey; Barzilay, Regina; Jaakkola, Tommi S.; DiMaio, Frank; Baek, Minkyung; Baker, David (August 2023). \"De novo design of protein structure and function with RFdiffusion\". Nature. 620 (7976): 1089–1100. Bibcode:2023Natur.620.1089W. doi:10.1038/s41586-023-06415-8. ISSN 1476-4687. PMC 10468394. PMID 37433327.\n^ Tu, Tao; et al. (2023). \"Towards Generalist Biomedical AI\". arXiv:2307.14334 [cs.CL].\n^ Gasparini, Allison (March 14, 2023). \"A trick inspired by Hansel and Gretel could help rovers explore other worlds\". Science News. Retrieved April 20, 2023.\n^ Fink, Wolfgang; Fuhrman, Connor; Nuncio Zuniga, Andres; Tarbell, Mark (February 11, 2023). \"A Hansel & Gretel Breadcrumb-Style Dynamically Deployed Communication Network Paradigm using Mesh Topology for Planetary Subsurface Exploration\". Advances in Space Research. 72 (2): 518–528. Bibcode:2023AdSpR..72..518F. doi:10.1016/j.asr.2023.02.012. ISSN 0273-1177. PMC 10399462. PMID 37547478. S2CID 256818650.\n^ Anthes, Emily (April 21, 2023). \"Polly Wants a Video Chat\". The New York Times. Retrieved May 27, 2023.\n^ Kleinberger, Rebecca; Cunha, Jennifer; Vemuri, Megha M; Hirskyj-Douglas, Ilyena (April 19, 2023). \"Birds of a Feather Video-Flock Together: Design and Evaluation of an Agency-Based Parrot-to-Parrot Video-Calling System for Interspecies Ethical Enrichment\". Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery. pp. 1–16. doi:10.1145/3544548.3581166. ISBN 978-1-4503-9421-5. S2CID 258216835.\n^ \"Robot 'chef' learns to recreate recipes from watching food videos\". University of Cambridge. June 5, 2023. Retrieved June 8, 2023.\n^ Sochacki, Grzegorz; Abdulali, Arsen; Hosseini, Narges Khadem; Iida, Fumiya (2023). \"Recognition of Human Chef's Intentions for Incremental Learning of Cookbook by Robotic Salad Chef\". IEEE Access. 11: 57006–57020. Bibcode:2023IEEEA..1157006S. doi:10.1109/ACCESS.2023.3276234. ISSN 2169-3536.\n^ Kaufmann, Elia; Bauersfeld, Leonard; Loquercio, Antonio; Müller, Matthias; Koltun, Vladlen; Scaramuzza, Davide (August 2023). \"Champion-level drone racing using deep reinforcement learning\". Nature. 620 (7976): 982–987. Bibcode:2023Natur.620..982K. doi:10.1038/s41586-023-06419-4. ISSN 1476-4687. PMC 10468397. PMID 37648758.\n^ a b Szymanski, Nathan J.; Rendy, Bernardus; Fei, Yuxing; Kumar, Rishi E.; He, Tanjin; Milsted, David; McDermott, Matthew J.; Gallant, Max; Cubuk, Ekin Dogus; Merchant, Amil; Kim, Haegyeom; Jain, Anubhav; Bartel, Christopher J.; Persson, Kristin; Zeng, Yan; Ceder, Gerbrand (December 2023). \"An autonomous laboratory for the accelerated synthesis of novel materials\". Nature. 624 (7990): 86–91. Bibcode:2023Natur.624...86S. doi:10.1038/s41586-023-06734-w. ISSN 1476-4687. PMC 10700133. PMID 38030721.\n^ Verma, Kavita (March 17, 2023). \"MIT researchers create a novel low-cost and portable air pollution sensor\". interestingengineering.com. Retrieved April 23, 2023.\n^ Wang, An; Machida, Yuki; deSouza, Priyanka; Mora, Simone; Duhl, Tiffany; Hudda, Neelakshi; Durant, John L.; Duarte, Fábio; Ratti, Carlo (May 15, 2023). \"Leveraging machine learning algorithms to advance low-cost air sensor calibration in stationary and mobile settings\". Atmospheric Environment. 301 119692. Bibcode:2023AtmEn.30119692W. doi:10.1016/j.atmosenv.2023.119692. hdl:11250/3115453. ISSN 1352-2310. S2CID 257295277.\n^ Soskind, Michael G.; Li, Nathan P.; Moore, Daniel P.; Chen, Yifeng; Wendt, Lars P.; McSpiritt, James; Zondlo, Mark A.; Wysocki, Gerard (May 1, 2023). \"Stationary and drone-assisted methane plume localization with dispersion spectroscopy\". Remote Sensing of Environment. 289 113513. Bibcode:2023RSEnv.28913513S. doi:10.1016/j.rse.2023.113513. ISSN 0034-4257. S2CID 257320852.\n^ \"Mind-reading AI can translate brainwaves into written text\". New Scientist. Retrieved February 17, 2024.\n^ Duan, Yiqun; Zhou, Jinzhao; Wang, Zhen; Wang, Yu-Kai; Lin, Chin-Teng (2023). \"DeWave: Discrete EEG Waves Encoding for Brain Dynamics to Text Translation\". arXiv:2309.14030 [cs.HC].\n^ Yirka, Bob. \"Android phones sold to customers in China found to be loaded with apps that send user data to third parties\". techxplore.com.\n^ Liu, Haoyu; Leith, Douglas J.; Patras, Paul (February 3, 2023). \"Android OS Privacy Under the Loupe – A Tale from the East\". arXiv:2302.01890 [cs.CR].\n^ Hoffmann, Stefan A.; Diggans, James; Densmore, Douglas; Dai, Junbiao; Knight, Tom; Leproust, Emily; Boeke, Jef D.; Wheeler, Nicole; Cai, Yizhi (March 17, 2023). \"Safety by design: Biosafety and biosecurity in the age of synthetic genomics\". iScience. 26 (3) 106165. Bibcode:2023iSci...26j6165H. doi:10.1016/j.isci.2023.106165. ISSN 2589-0042. PMC 9988571. PMID 36895643.\n^ a b c Räsänen, Joona (February 2023). \"Sexual loneliness: A neglected public health problem?\". Bioethics. 37 (2): 101–102. doi:10.1111/bioe.13134. ISSN 0269-9702. PMID 36662712. S2CID 256031783.\n^ \"What it's like to be a man in the top 0.01 per cent on dating apps\". The Independent. February 21, 2023. Retrieved March 27, 2023.\n^ Mann, Denise. \"Looking for love on V-day? All that swiping may not help\". phys.org. Retrieved March 27, 2023.\n^ Thomas, Marina F.; Binder, Alice; Stevic, Anja; Matthes, Jörg (March 1, 2023). \"99 + matches but a spark ain't one: Adverse psychological effects of excessive swiping on dating apps\". Telematics and Informatics. 78 101949. doi:10.1016/j.tele.2023.101949. ISSN 0736-5853.\n^ Sears, Richard (March 21, 2023). \"Mental Health Awareness Campaigns May Actually Lead to Increases in Mental Distress\". Mad In America. Retrieved April 22, 2023.\n^ Foulkes, Lucy; Andrews, Jack L. (April 1, 2023). \"Are mental health awareness efforts contributing to the rise in reported mental health problems? A call to test the prevalence inflation hypothesis\". New Ideas in Psychology. 69 101010. doi:10.1016/j.newideapsych.2023.101010. ISSN 0732-118X. S2CID 256776819.\n^ Fogel, Sam. \"I Got Investigated by the Secret Service. Here's How to Not Be Me\". Wired. Retrieved April 19, 2023.\n^ \"VPNalyzer: Systematic Investigation of the VPN Ecosystem\" (PDF). Retrieved April 19, 2023.\nWebsite: \"VPNInspector: Systematic Investigation of the VPN Ecosystem\". NDSS Symposium. Retrieved April 19, 2023.\nUniversity press release: \"Are VPNs really the answer?\". Computer Science and Engineering. Retrieved April 19, 2023.\nWebsite: \"VPNInspector: Systematic Investigation of the VPN Ecosystem\". NDSS Symposium. Retrieved April 19, 2023.\nUniversity press release: \"Are VPNs really the answer?\". Computer Science and Engineering. Retrieved April 19, 2023.\n^ Fong, Meiling; Arsel, Zeynep. \"Protecting privacy online begins with tackling 'digital resignation,' say researchers\". techxplore.com.\n^ Wiggers, Kyle (March 31, 2023). \"Twitter reveals some of its source code, including its recommendation algorithm\". TechCrunch. Retrieved April 19, 2023.\n^ Geurkink, Brandi. \"Twitter's Open Source Algorithm Is a Red Herring\". Wired. Retrieved April 19, 2023.\n^ Clark, Mitchell. \"Twitter takes its algorithm 'open-source,' as Elon Musk promised\". The Verge. Retrieved April 19, 2023.\n^ Willingham, A. J. (February 3, 2023). \"Why Twitter users are upset about the platform's latest change\". CNN. Retrieved May 15, 2023.\n^ Wiggers, Kyle (April 18, 2023). \"Reddit will begin charging for access to its API\". TechCrunch. Retrieved May 15, 2023.\n^ \"Twitter pulls check mark from main New York Times account\". The Associated Press via techxplore.com. Retrieved April 19, 2023.\n^ \"Parts of Twitter source code leaked online, court filing shows\". Reuters. March 27, 2023. Retrieved April 19, 2023.\n^ Duffy, Clare (April 12, 2023). \"NPR and PBS stop using Twitter after receiving 'government funded media' label\". CNN. Retrieved April 19, 2023.\n^ \"NPR quits Twitter after being falsely labeled as 'state-affiliated media'\". NPR. Retrieved April 19, 2023.\n^ Lomas, Natasha (April 26, 2023). \"EU warns Twitter over disinformation after Musk policy shifts found to boost Kremlin propaganda\". TechCrunch. Retrieved May 28, 2023.\n^ Bozdag, Engin; van den Hoven, Jeroen (December 1, 2015). \"Breaking the filter bubble: democracy and design\". Ethics and Information Technology. 17 (4): 249–265. doi:10.1007/s10676-015-9380-y. ISSN 1572-8439. S2CID 254461715.\n^ Thompson, Joanna. \"People, Not Google's Algorithm, Create Their Own Partisan 'Bubbles' Online\". Scientific American. Retrieved June 26, 2023.\n^ Robertson, Ronald E.; Green, Jon; Ruck, Damian J.; Ognyanova, Katherine; Wilson, Christo; Lazer, David (June 2023). \"Users choose to engage with more partisan news than they are exposed to on Google Search\". Nature. 618 (7964): 342–348. Bibcode:2023Natur.618..342R. doi:10.1038/s41586-023-06078-5. ISSN 1476-4687. PMID 37225979. S2CID 258904693.\n^ Grant, Nico; Myers, Steven Lee (May 2, 2023). \"Google Promised to Defund Climate Lies, but the Ads Keep Coming\". The New York Times. Retrieved May 28, 2023.\n^ \"YouTube accused of not tackling Musk Bitcoin scam streams\". BBC News. June 9, 2022. Retrieved May 28, 2023.\n^ Kay, Grace. \"Elon Musk disses YouTube for 'nonstop scam ads' after threatening to walk away from Twitter purchase over bots\". Business Insider.\n^ Hsu, Tiffany (February 11, 2023). \"Why Are You Seeing So Many Bad Digital Ads Now?\". The New York Times. Retrieved June 26, 2023.\n^ Sanders, Taren; Noetel, Michael; Parker, Philip; Del Pozo Cruz, Borja; Biddle, Stuart; Ronto, Rimante; Hulteen, Ryan; Parker, Rhiannon; Thomas, George; De Cocker, Katrien; Salmon, Jo; Hesketh, Kylie; Weeks, Nicole; Arnott, Hugh; Devine, Emma; Vasconcellos, Roberta; Pagano, Rebecca; Sherson, Jamie; Conigrave, James; Lonsdale, Chris (January 2024). \"An umbrella review of the benefits and risks associated with youths' interactions with electronic screens\" (PDF). Nature Human Behaviour. 8 (1): 82–99. doi:10.1038/s41562-023-01712-8. ISSN 2397-3374. PMID 37957284. S2CID 265155159.\n^ Aslett, Kevin; Sanderson, Zeve; Godel, William; Persily, Nathaniel; Nagler, Jonathan; Tucker, Joshua A. (January 2024). \"Online searches to evaluate misinformation can increase its perceived veracity\". Nature. 625 (7995): 548–556. Bibcode:2024Natur.625..548A. doi:10.1038/s41586-023-06883-y. ISSN 1476-4687. PMC 10794132. PMID 38123685.\n^ \"2023 Word of the Year Is \"Enshittification\" - American Dialect Society\". January 5, 2024. Retrieved March 22, 2024.\n^ \"The 'Enshittification' of TikTok\". Retrieved March 22, 2024.\n^ Clark, Mitchell (April 3, 2023). \"The Tor Project's new privacy-focused browser doesn't use the Tor network\". The Verge. Retrieved May 28, 2023.\n^ \"New Privacy-Focused Browser Aims to Protect Your Data Online\". CNET. Retrieved May 28, 2023.\n^ \"Want a more secure browser that's not Tor? Check out Mullvad\". ZDNET. Retrieved May 28, 2023.\n^ Watercutter, Angela. \"Reddit Won't Be the Same. Neither Will the Internet\". Wired. Retrieved July 27, 2023.\n^ Porter, Jon (June 5, 2023). \"Major Reddit communities will go dark to protest threat to third-party apps\". The Verge. Retrieved July 27, 2023.\n^ \"Lemmy and Kbin: The Best Reddit Alternatives?\". PCMAG. Retrieved July 27, 2023.\n^ \"News at a glance: Long Covid treatment, global earthquake model, and deep-sea mining\". Science. June 15, 2023. Retrieved July 27, 2023.\n^ \"GEM | Press Release Embargoed\". GEM Foundation. Retrieved July 27, 2023.\n^ Perez, Sarah (August 2, 2023). \"X, formerly Twitter, streamlines its crowdsourced fact-checking system Community Notes\". TechCrunch. Retrieved March 22, 2024.\n^ Lanese, Nicoletta (January 12, 2023). \"New 'thought-controlled' device reads brain activity through the jugular\". livescience.com. Archived from the original on February 16, 2023. Retrieved February 16, 2023.\n^ Mitchell, Peter; Lee, Sarah C. M.; Yoo, Peter E.; Morokoff, Andrew; Sharma, Rahul P.; Williams, Daryl L.; MacIsaac, Christopher; Howard, Mark E.; Irving, Lou; Vrljic, Ivan; Williams, Cameron; Bush, Steven; Balabanski, Anna H.; Drummond, Katharine J.; Desmond, Patricia; Weber, Douglas; Denison, Timothy; Mathers, Susan; O'Brien, Terence J.; Mocco, J.; Grayden, David B.; Liebeskind, David S.; Opie, Nicholas L.; Oxley, Thomas J.; Campbell, Bruce C. V. (January 9, 2023). \"Assessment of Safety of a Fully Implanted Endovascular Brain-Computer Interface for Severe Paralysis in 4 Patients: The Stentrode With Thought-Controlled Digital Switch (SWITCH) Study\". JAMA Neurology. 80 (3): 270–278. doi:10.1001/jamaneurol.2022.4847. ISSN 2168-6149. PMC 9857731. PMID 36622685. S2CID 255545643.\n^ \"Israeli scientists develop sniffing robot with locust antennae\". Reuters. February 7, 2023. Retrieved March 28, 2023.\n^ Neta, Shvil; Ariel, Golan; Yossi, Yovel; Amir, Ayali; Ben, Maoz M. (February 1, 2023). \"The Locust antenna as an odor discriminator\". Biosensors and Bioelectronics. 221 114919. doi:10.1016/j.bios.2022.114919. ISSN 0956-5663. PMID 36446198. S2CID 253790885.\n^ Strickland, Ashley. \"Move over, artificial intelligence. Scientists announce a new 'organoid intelligence' field\". CNN. Retrieved March 25, 2023.\n^ Smirnova, Lena; Caffo, Brian S.; Gracias, David H.; Huang, Qi; Morales Pantoja, Itzy E.; Tang, Bohao; Zack, Donald J.; Berlinicke, Cynthia A.; Boyd, J. Lomax; Harris, Timothy D.; Johnson, Erik C.; Kagan, Brett J.; Kahn, Jeffrey; Muotri, Alysson R.; Paulhamus, Barton L.; Schwamborn, Jens C.; Plotkin, Jesse; Szalay, Alexander S.; Vogelstein, Joshua T.; Worley, Paul F.; Hartung, Thomas (February 28, 2023). \"Organoid intelligence (OI): the new frontier in biocomputing and intelligence-in-a-dish\". Frontiers in Science. 1 1017235. Bibcode:2023FrSci...117235S. doi:10.3389/fsci.2023.1017235. ISSN 2813-6330.\n^ \"Human brain cells used as living AIs to solve mathematical equations\". New Scientist. Retrieved April 18, 2023.\n^ Cai, Hongwei; Ao, Zheng; Tian, Chunhui; Wu, Zhuhao; Liu, Hongcheng; Tchieu, Jason; Gu, Mingxia; Mackie, Ken; Guo, Feng (March 1, 2023). \"Brain Organoid Computing for Artificial Intelligence\". bioRxiv 10.1101/2023.02.28.530502.\n^ \"Auf dem Weg in die Matrix: Mikroboboter loggt sich in neuronale Netzwerke ein | MDR.DE\". MDR (in German). Retrieved April 19, 2023.\n^ Kim, Eunhee; Jeon, Sungwoong; Yang, Yoon-Sil; Jin, Chaewon; Kim, Jin-young; Oh, Yong-Seok; Rah, Jong-Cheol; Choi, Hongsoo (March 2023). \"A Neurospheroid-Based Microrobot for Targeted Neural Connections in a Hippocampal Slice\". Advanced Materials. 35 (13) 2208747. Bibcode:2023AdM....3508747K. doi:10.1002/adma.202208747. ISSN 0935-9648. PMID 36640750. S2CID 257774877.\nUniversity press release: \"Microrobot capable of forming neural networks and sectioning hippocampal tissues in vitro\". Daegu Gyeongbuk Institute of Science and Technology via medicalxpress.com. Retrieved April 19, 2023.\nUniversity press release: \"Microrobot capable of forming neural networks and sectioning hippocampal tissues in vitro\". Daegu Gyeongbuk Institute of Science and Technology via medicalxpress.com. Retrieved April 19, 2023.\n^ Dixit, Mrigakshi (March 29, 2023). \"New fuel cell implant can help manage type-1 diabetes\". interestingengineering.com. Retrieved April 20, 2023.\n^ Maity, Debasis; Guha Ray, Preetam; Buchmann, Peter; Mansouri, Maysam; Fussenegger, Martin (March 28, 2023). \"Blood-Glucose-Powered Metabolic Fuel Cell for Self-Sufficient Bioelectronics\". Advanced Materials. 35 (21) 2300890. Bibcode:2023AdM....3500890M. doi:10.1002/adma.202300890. hdl:20.500.11850/608081. ISSN 0935-9648. PMID 36893359.\nUniversity press release: Rüegg, Peter. \"Implantable fuel cell that generates electricity from excess glucose in the blood\". ETH Zürich via medicalxpress.com. Retrieved April 20, 2023.\nUniversity press release: Rüegg, Peter. \"Implantable fuel cell that generates electricity from excess glucose in the blood\". ETH Zürich via medicalxpress.com. Retrieved April 20, 2023.\n^ a b Jiang, Chengpeng; Liu, Jiaqi; Ni, Yao; Qu, Shangda; Liu, Lu; Li, Yue; Yang, Lu; Xu, Wentao (March 11, 2023). \"Mammalian-brain-inspired neuromorphic motion-cognition nerve achieves cross-modal perceptual enhancement\". Nature Communications. 14 (1): 1344. Bibcode:2023NatCo..14.1344J. doi:10.1038/s41467-023-36935-w. ISSN 2041-1723. PMC 10008641. PMID 36906637.\nUniversity press release: \"Team realizes brain's sensory functions using artificial synapse devices\". Nankai University via techxplore.com. Retrieved May 28, 2023.\nUniversity press release: \"Team realizes brain's sensory functions using artificial synapse devices\". Nankai University via techxplore.com. Retrieved May 28, 2023.\n^ Sharma, Sejal (April 24, 2023). \"Nanowire networks can learn and memorize like the human brain, study says\". interestingengineering.com. Retrieved May 28, 2023.\n^ Loeffler, Alon; Diaz-Alvarez, Adrian; Zhu, Ruomin; Ganesh, Natesh; Shine, James M.; Nakayama, Tomonobu; Kuncic, Zdenka (April 21, 2023). \"Neuromorphic learning, working memory, and metaplasticity in nanowire networks\". Science Advances. 9 (16) eadg3289. Bibcode:2023SciA....9G3289L. doi:10.1126/sciadv.adg3289. ISSN 2375-2548. PMC 10121165. PMID 37083527.\n^ Ferreira, Becky (July 11, 2023). \"Scientists Create 'Biological Camera' That Stores Images in DNA\". Vice. Retrieved August 31, 2023.\n^ Lim, Cheng Kai; Yeoh, Jing Wui; Kunartama, Aurelius Andrew; Yew, Wen Shan; Poh, Chueh Loo (July 3, 2023). \"A biological camera that captures and stores images directly into DNA\". Nature Communications. 14 (1): 3921. Bibcode:2023NatCo..14.3921L. doi:10.1038/s41467-023-38876-w. ISSN 2041-1723. PMC 10318082. PMID 37400476.\n^ Cai, Hongwei; Ao, Zheng; Tian, Chunhui; Wu, Zhuhao; Liu, Hongcheng; Tchieu, Jason; Gu, Mingxia; Mackie, Ken; Guo, Feng (December 2023). \"Brain organoid reservoir computing for artificial intelligence\". Nature Electronics. 6 (12): 1032–1039. doi:10.1038/s41928-023-01069-w. ISSN 2520-1131. S2CID 266278255.\n^ \"DeepMind uncovers structure of 200m proteins in scientific leap forward\". The Guardian. July 28, 2022. Retrieved July 28, 2022.\n^ \"AlphaFold reveals the structure of the protein universe\". DeepMind. July 28, 2022. Retrieved July 28, 2022.\n^ \"An AI-Generated Artwork Won First Place at a State Fair Fine Arts Competition, and Artists Are Pissed\". Vice. Retrieved September 15, 2022.\n^ Ocampo, Rodolfo. \"AI art is everywhere right now. Even experts don't know what it will mean\". techxplore.com. Retrieved September 15, 2022.\n^ \"As AI-generated art takes off - who really owns it?\". Thomson Reuters Foundation. Retrieved September 15, 2022.\n^ Edwards, Benj (September 12, 2022). \"Flooded with AI-generated images, some art communities ban them completely\". Ars Technica. Retrieved September 15, 2022.\n^ Wiggers, Kyle (August 24, 2022). \"Deepfakes: Uncensored AI art model prompts ethics questions\". TechCrunch. Retrieved September 15, 2022.\n^ \"AI is reshaping creativity, and maybe that's a good thing\". Dazed. August 18, 2022. Retrieved September 15, 2022.\n^ \"AI-generated art illustrates another problem with computers | John Naughton\". The Guardian. August 20, 2022. Retrieved September 15, 2022.\n^ Gal, Rinon; Alaluf, Yuval; Atzmon, Yuval; Patashnik, Or; Bermano, Amit H.; Chechik, Gal; Cohen-Or, Daniel (August 2, 2022). \"An Image is Worth One Word: Personalizing Text-to-Image Generation using Textual Inversion\". arXiv:2208.01618 [cs.CV].\n^ \"DALL-E can now help you imagine what's outside the frame of famous paintings\". The Verge. Retrieved September 15, 2022.\n^ \"Stable Diffusion\". CompVis - Machine Vision and Learning LMU Munich. September 15, 2022. Retrieved September 15, 2022.\n^ a b Edwards, Benj (September 6, 2022). \"With Stable Diffusion, you may never believe what you see online again\". Ars Technica. Retrieved September 15, 2022.\n^ \"Stable Diffusion Public Release\". Stability.Ai. Retrieved September 15, 2022.\n^ \"Satellites now get full-year view of Arctic sea-ice\". BBC News. September 14, 2022. Retrieved September 15, 2022.\n^ Landy, Jack C.; Dawson, Geoffrey J.; Tsamados, Michel; Bushuk, Mitchell; Stroeve, Julienne C.; Howell, Stephen E. L.; Krumpen, Thomas; Babb, David G.; Komarov, Alexander S.; Heorton, Harry D. B. S.; Belter, H. Jakob; Aksenov, Yevgeny (September 2022). \"A year-round satellite sea-ice thickness record from CryoSat-2\" (PDF). Nature. 609 (7927): 517–522. Bibcode:2022Natur.609..517L. doi:10.1038/s41586-022-05058-5. hdl:10037/26936. ISSN 1476-4687. PMID 36104558. S2CID 252282906.\n^ Quach, Katyanna. \"Harvard boffins build multimodal AI system to predict cancer\". The Register. Retrieved September 16, 2022.\n^ Chen, Richard J.; Lu, Ming Y.; Williamson, Drew F. K.; Chen, Tiffany Y.; Lipkova, Jana; Noor, Zahra; Shaban, Muhammad; Shady, Maha; Williams, Mane; Joo, Bumjin; Mahmood, Faisal (August 8, 2022). \"Pan-cancer integrative histology-genomic analysis via multimodal deep learning\". Cancer Cell. 40 (8): 865–878.e6. doi:10.1016/j.ccell.2022.07.004. ISSN 1535-6108. PMC 10397370. PMID 35944502. S2CID 251456162.\n^ \"DeepMind AI learns physics by watching videos that don't make sense\". New Scientist. Retrieved August 21, 2022.\n^ Piloto, Luis S.; Weinstein, Ari; Battaglia, Peter; Botvinick, Matthew (July 11, 2022). \"Intuitive physics learning in a deep-learning model inspired by developmental psychology\". Nature Human Behaviour. 6 (9): 1257–1267. doi:10.1038/s41562-022-01394-8. ISSN 2397-3374. PMC 9489531. PMID 35817932.\n^ Feldman, Andrey (August 11, 2022). \"Artificial physicist to unravel the laws of nature\". Advanced Science News. Retrieved August 21, 2022.\n^ Chen, Boyuan; Huang, Kuang; Raghupathi, Sunand; Chandratreya, Ishaan; Du, Qiang; Lipson, Hod (July 2022). \"Automated discovery of fundamental variables hidden in experimental data\". Nature Computational Science. 2 (7): 433–442. doi:10.1038/s43588-022-00281-6. ISSN 2662-8457. PMID 38177869. S2CID 251087119.\n^ \"Biologists train AI to generate medicines and vaccines\". University of Washington-Harborview Medical Center.\n^ Wang, Jue; Lisanza, Sidney; Juergens, David; Tischer, Doug; Watson, Joseph L.; Castro, Karla M.; Ragotte, Robert; Saragovi, Amijai; Milles, Lukas F.; Baek, Minkyung; Anishchenko, Ivan; Yang, Wei; Hicks, Derrick R.; Expòsit, Marc; Schlichthaerle, Thomas; Chun, Jung-Ho; Dauparas, Justas; Bennett, Nathaniel; Wicky, Basile I. M.; Muenks, Andrew; DiMaio, Frank; Correia, Bruno; Ovchinnikov, Sergey; Baker, David (July 22, 2022). \"Scaffolding protein functional sites using deep learning\" (PDF). Science. 377 (6604): 387–394. Bibcode:2022Sci...377..387W. doi:10.1126/science.abn2100. ISSN 0036-8075. PMC 9621694. PMID 35862514. S2CID 250953434.\n^ \"Robot performs first laparoscopic surgery without human help\". Johns Hopkins University. January 26, 2022. Archived from the original on January 26, 2022. Retrieved January 27, 2022.\n^ Saeidi, H.; Opfermann, J. D.; Kam, M.; Wei, S.; Leonard, S.; Hsieh, M. H.; Kang, J. U.; Krieger, A. (January 26, 2022). \"Autonomous robotic laparoscopic surgery for intestinal anastomosis\". Science Robotics. 7 (62) eabj2908. doi:10.1126/scirobotics.abj2908. PMC 8992572. PMID 35080901. S2CID 246296673.\n^ a b Roper, Katherine; Abdel-Rehim, A.; Hubbard, Sonya; Carpenter, Martin; Rzhetsky, Andrey; Soldatova, Larisa; King, Ross D. (2022). \"Testing the reproducibility and robustness of the cancer biology literature by robot\". Journal of the Royal Society Interface. 19 (189) 20210821. doi:10.1098/rsif.2021.0821. PMC 8984295. PMID 35382578.\n^ \"'Robot scientist' Eve finds that less than one-third of scientific results are reproducible\". University of Cambridge. Retrieved May 15, 2022.\n^ Yirka, Bob. \"Open-source and open hardware autonomous quadrotor flies fast and avoids obstacles\". techxplore.com. Retrieved July 20, 2022.\n^ Foehn, Philipp; Kaufmann, Elia; Romero, Angel; Penicka, Robert; Sun, Sihao; Bauersfeld, Leonard; Laengle, Thomas; Cioffi, Giovanni; Song, Yunlong; Loquercio, Antonio; Scaramuzza, Davide (June 22, 2022). \"Agilicious: Open-source and open-hardware agile quadrotor for vision-based flight\". Science Robotics. 7 (67) eabl6259. arXiv:2307.06100. doi:10.1126/scirobotics.abl6259. PMID 35731886. S2CID 249955269.\n^ Verrengia, Giordana. \"Open-source software gives a leg up to robot research\". Carnegie Mellon University Mechanical Engineering via techxplore.com. Retrieved September 18, 2022.\n^ \"Video Friday: Grip Anything\". IEEE Spectrum. July 29, 2022. Retrieved September 18, 2022.\n^ Norby, Joseph; Yang, Yanhao; Tajbakhsh, Ardalan; Ren, Jiming; Yim, Justin K.; Stutt, Alexandra; Yu, Qishun; Flowers, Nikolai; Johnson, Aaron M. (May 2022). \"Quad-SDK: Full Stack Software Framework for Agile Quadrupedal Locomotion\" (PDF). Retrieved September 18, 2022.\n^ Osborne, Margaret. \"A Ukrainian Teenager Invents a Drone That Can Detect Land Mines\". Smithsonian Magazine. Retrieved October 20, 2022.\n^ Kramer, Andrew E.; Guttenfelder, David (August 10, 2022). \"From the Workshop to the War: Creative Use of Drones Lifts Ukraine\". The New York Times. Retrieved October 20, 2022.\n^ a b Fogel, Benjamin (August 22, 2022). \"Will the Drone War Come Home? Ukraine and the Weaponization of Commercial Drones\". Modern War Institute. Retrieved October 20, 2022.\n^ \"Drone Hackathon was launched to develop new solutions in the field of military technology. - Div Bracket\". Divbracket.com. Retrieved October 20, 2022.\n^ \"New technological solutions for the army: the Ministry of Digital Transformation has launched a Drone Hackathon in military-tech sector\". Retrieved October 20, 2022.\n^ a b Koizumi, Yu (September 26, 2022). \"Does the conflict in Ukraine represent a 'new war'?\". The Japan Times.\n^ Axe, David. \"Ukraine's $10,000 Drones Are Dropping Tiny Bombs On Russian Troops\". Forbes. Retrieved October 20, 2022.\n^ South, Todd (September 21, 2022). \"Use us for combat zone tests, Ukraine minister tells US war industry\". Military Times. Retrieved October 20, 2022.\n^ \"How the Ukraine drone war is changing the game on the battlefield\". New Atlas. September 23, 2022. Retrieved October 20, 2022.\n^ \"New data transmission record set using a single laser and a single optical chip\". Phys.org. October 23, 2022. Retrieved October 24, 2022.\n^ \"New data transmission record\". Technical University of Denmark. October 20, 2022. Retrieved October 24, 2022.\n^ a b Papadopoulos, Loukia (October 21, 2022). \"This new farming robot uses lasers to kill 200,000 weeds per hour\". interestingengineering.com. Retrieved November 17, 2022.\n^ \"Verdant Robotics launches multi-action agricultural robot for 'superhuman farming'\". Robotics & Automation News. February 23, 2022. Retrieved November 17, 2022.\n^ \"Small Robot Company Tom, Dick, and Harry farm robots: The 200 Best Inventions of 2022\". Time. Retrieved November 17, 2022.\n^ \"\"SuperGPS\" ditches satellites for radio towers for cm-scale tracking\". New Atlas. November 17, 2022. Retrieved December 17, 2022.\n^ Koelemeij, Jeroen C. J.; Dun, Han; Diouf, Cherif E. V.; Dierikx, Erik F.; Janssen, Gerard J. M.; Tiberius, Christian C. J. M. (November 2022). \"A hybrid optical–wireless network for decimetre-level terrestrial positioning\". Nature. 611 (7936): 473–478. arXiv:2305.14796. Bibcode:2022Natur.611..473K. doi:10.1038/s41586-022-05315-7. hdl:1871.1/83f83acb-b4fd-4c6f-ad01-84986e18f9bf. ISSN 1476-4687. PMID 36385540. S2CID 253555248.\nUniversity press release: \"A navigation system with 10 centimeter accuracy\". Delft University of Technology via techxplore.com. Retrieved December 17, 2022.\nUniversity press release: \"A navigation system with 10 centimeter accuracy\". Delft University of Technology via techxplore.com. Retrieved December 17, 2022.\n^ \"Impossible Metals demonstrates its super-careful seabed mining robot\". New Atlas. December 8, 2022. Retrieved January 17, 2023.\n^ \"The online information environment\" (PDF). Retrieved February 21, 2022.\n^ Guy, Jack. \"DNA reveals biggest-ever human family tree, dating back 100,000 years\". CNN. Retrieved March 10, 2022.\n^ Wong, Yan; Wohns, Anthony Wilder. \"We're analysing DNA from ancient and modern humans to create a 'family tree of everyone'\". Retrieved March 21, 2022.\n^ Wohns, Anthony Wilder; Wong, Yan; Jeffery, Ben; Akbari, Ali; Mallick, Swapan; Pinhasi, Ron; Patterson, Nick; Reich, David; Kelleher, Jerome; McVean, Gil (February 25, 2022). \"A unified genealogy of modern and ancient genomes\". Science. 375 (6583) eabi8264. bioRxiv 10.1101/2021.02.16.431497v2. doi:10.1126/science.abi8264. ISSN 0036-8075. PMC 10027547. PMID 35201891. S2CID 247106458.\n^ \"Scientists create a global repository for cell engineering\". Newcastle University via phys.org. Retrieved October 26, 2022.\n^ Tellechea-Luzardo, Jonathan; Hobbs, Leanne; Velázquez, Elena; Pelechova, Lenka; Woods, Simon; de Lorenzo, Víctor; Krasnogor, Natalio (February 9, 2022). \"Versioning biological cells for trustworthy cell engineering\". Nature Communications. 13 (1): 765. Bibcode:2022NatCo..13..765T. doi:10.1038/s41467-022-28350-4. ISSN 2041-1723. PMC 8828774. PMID 35140226.\n^ \"Machine-learning models vulnerable to undetectable backdoors\". The Register. Retrieved May 13, 2022.\n^ \"Undetectable Backdoors Plantable In Any Machine-Learning Algorithm\". IEEE Spectrum. May 10, 2022. Retrieved May 13, 2022.\n^ Goldwasser, Shafi; Kim, Michael P.; Vaikuntanathan, Vinod; Zamir, Or (April 14, 2022). \"Planting Undetectable Backdoors in Machine Learning Models\". arXiv:2204.06974 [cs.LG].\n^ Yirka, Bob. \"A computer system that analyzes chemical waste and proposes ways to make new products from it\". phys.org. Retrieved May 12, 2022.\n^ Wołos, Agnieszka; Koszelewski, Dominik; Roszak, Rafał; Szymkuć, Sara; Moskal, Martyna; Ostaszewski, Ryszard; Herrera, Brenden T.; Maier, Josef M.; Brezicki, Gordon; Samuel, Jonathon; Lummiss, Justin A. M.; McQuade, D. Tyler; Rogers, Luke; Grzybowski, Bartosz A. (April 2022). \"Computer-designed repurposing of chemical wastes into drugs\". Nature. 604 (7907): 668–676. Bibcode:2022Natur.604..668W. doi:10.1038/s41586-022-04503-9. ISSN 1476-4687. PMID 35478240. S2CID 248415772.\n^ Frost, Rosie (May 9, 2022). \"Plastic waste can now be found and monitored from space\". euronews. Retrieved June 24, 2022.\n^ \"Global Plastic Watch\". www.globalplasticwatch.org. Retrieved June 24, 2022.\n^ a b Sauce, Bruno; Liebherr, Magnus; Judd, Nicholas; Klingberg, Torkel (May 11, 2022). \"The impact of digital media on children's intelligence while controlling for genetic differences in cognition and socioeconomic background\". Scientific Reports. 12 (1): 7720. Bibcode:2022NatSR..12.7720S. doi:10.1038/s41598-022-11341-2. ISSN 2045-2322. PMC 9095723. PMID 35545630.\n^ \"Video games can boost children's intelligence: study\". Karolinska Institutet. Retrieved June 24, 2022.\n^ Best, Jo (May 3, 2022). \"From Ukraine to remote robotics: how videoconferencing and next generation technology are transforming surgery\". BMJ. 377 o1078. doi:10.1136/bmj.o1078. PMID 35504650. S2CID 248497139. Retrieved June 24, 2022.\n^ Garner, Ian (May 9, 2022). \"\"We've Got to Kill Them\": Responses to Bucha on Russian Social Media Groups\". Journal of Genocide Research. 25 (3–4): 418–425. doi:10.1080/14623528.2022.2074020. S2CID 248680376.\n^ \"In Ukraine war, a race to acquire smarter, deadlier drones\". AP NEWS. July 14, 2022. Retrieved August 4, 2022.\n^ Pearson, James; Bing, Christopher (May 10, 2022). \"The cyber war between Ukraine and Russia: An overview\". Reuters. Retrieved August 8, 2022.\n^ Robertson, Nic. \"Analysis: Drones, phones and satellites are exposing the truth about Russia's war in Ukraine in near real-time\". CNN. Retrieved August 4, 2022.\n^ \"Instead of consumer software, Ukraine's tech workers build apps of war\". Washington Post. Retrieved August 4, 2022.\n^ \"scienceforukraine\". scienceforukraine.eu. Retrieved August 4, 2022.\n^ Gaind, Nisha; Else, Holly; Roussi, Antoaneta (March 2, 2022). \"'I thought I had forgotten this horror': Ukrainian scientists stand in defiance\". Nature. 603 (7900): 210–211. Bibcode:2022Natur.603..210G. doi:10.1038/d41586-022-00621-6. PMID 35236954. S2CID 247219578.\n^ \"Single MRI scan of the brain could detect Alzheimer's disease\". Physics World. July 13, 2022. Retrieved July 19, 2022.\n^ Inglese, Marianna; Patel, Neva; Linton-Reid, Kristofer; Loreto, Flavia; Win, Zarni; Perry, Richard J.; Carswell, Christopher; Grech-Sollars, Matthew; Crum, William R.; Lu, Haonan; Malhotra, Paresh A.; Aboagye, Eric O. (June 20, 2022). \"A predictive model using the mesoscopic architecture of the living brain to detect Alzheimer's disease\". Communications Medicine. 2 (1): 70. doi:10.1038/s43856-022-00133-4. ISSN 2730-664X. PMC 9209493. PMID 35759330.\n^ Ansari, Tasmia (September 13, 2022). \"GitHub Is Part of Creator Economy, Just That It Won't Pay\". Analytics India Magazine. Retrieved September 23, 2022.\n^ Shimada, Naomichi; Xiao, Tao; Hata, Hideaki; Treude, Christoph; Matsumoto, Kenichi (May 2022). \"GitHub sponsors: Exploring a new way to contribute to open source\". Proceedings of the 44th International Conference on Software Engineering. pp. 1058–1069. doi:10.1145/3510003.3510116. ISBN 978-1-4503-9221-1. S2CID 246822794.\n^ Hanley, Steve (July 4, 2022). \"Latest Project Drawdown Update Adds 11 New Ways To Stop Global Heating\". CleanTechnica. Retrieved July 21, 2022.\n^ \"Project Drawdown updates world's leading set of climate solutions—adding 11 new solutions for addressing the climate crisis\". Project Drawdown. June 24, 2022. Retrieved July 21, 2022.\n^ Gorman, Miranda R.; Dzombak, David A.; Frischmann, Chad (September 1, 2022). \"Potential global GHG emissions reduction from increased adoption of metals recycling\". Resources, Conservation and Recycling. 184 106424. Bibcode:2022RCR...18406424G. doi:10.1016/j.resconrec.2022.106424. ISSN 0921-3449. S2CID 249321004.\n^ Harvey, George (July 4, 2022). \"We Can Have (Just About) Everything We Want For Energy & The Climate\". CleanTechnica. Retrieved July 21, 2022.\n^ Jacobson, Mark Z.; Krauland, Anna-Katharina von; Coughlin, Stephen J.; Dukas, Emily; Nelson, Alexander J. H.; Palmer, Frances C.; Rasmussen, Kylie R. (June 28, 2022). \"Low-cost solutions to global warming, air pollution, and energy insecurity for 145 countries\" (PDF). Energy & Environmental Science. 15 (8): 3343–3359. Bibcode:2022EnEnS..15.3343J. doi:10.1039/D2EE00722C. ISSN 1754-5706. S2CID 250126767.\n^ \"New AI technology integrates multiple data types to predict cancer outcomes\". Brigham and Women's Hospital via medicalxpress.com. Retrieved September 18, 2022.\n^ Axon, Samuel (August 18, 2022). \"For the first time ever, more people watched streaming TV than cable\". Ars Technica. Retrieved September 23, 2022.\n^ \"Streaming claims largest piece of TV viewing pie in July\". Nielsen. Retrieved September 23, 2022.\n^ a b \"TikTok can track users' every tap as they visit other sites through iOS app, new research shows\". The Guardian. August 24, 2022. Retrieved September 16, 2022.\n^ a b \"iOS Privacy: Announcing InAppBrowser.com - see what JavaScript commands get injected through an in-app browser · Felix Krause\". krausefx.com. Retrieved September 16, 2022.\n^ Fetzer, Mary. \"Automatic device driver isolation protects against bugs in operating systems\". Pennsylvania State University via techxplore.com. Retrieved September 15, 2022.\n^ Huang, Yongzhe; Narayanan, Vikram; Detweiler, David; Huang, Kaiming; Tan, Gang; Jaeger, Trent; Burtsev, Anton (2022). \"KSplit: Automating Device Driver Isolation\" (PDF). Archived from the original (PDF) on September 15, 2022. Retrieved September 15, 2022.\n^ \"Fine-grained kernel isolation\". mars-research.github.io. Retrieved September 15, 2022.\n^ \"Google Deepmind Researcher Co-Authors Paper Saying AI Will Eliminate Humanity\". Vice. Retrieved September 23, 2022.\n^ Cohen, Michael K.; Hutter, Marcus; Osborne, Michael A. (August 29, 2022). \"Advanced artificial agents intervene in the provision of reward\". AI Magazine. 43 (3): 282–293. doi:10.1002/aaai.12064. ISSN 0738-4602. S2CID 235489158.\n^ \"For the first time we can measure the thickness of Arctic sea ice all year round\". UiT The Arctic University of Norway via EurekAlert!. September 14, 2022. Retrieved September 15, 2022.\n^ Tucker, Emma (September 18, 2022). \"TikTok's search engine repeatedly delivers misinformation to its majority-young user base, report says\". CNN. Retrieved October 19, 2022.\n^ \"Misinformation Monitor: September 2022\". NewsGuard. Retrieved October 19, 2022.\n^ \"Explainer: Understanding Ethereum's major 'proof of stake' upgrade\". NBC News. Retrieved October 20, 2022.\n^ \"Can AI's Recommendations Be Less Insidious?\". IEEE Spectrum. October 2, 2022. Retrieved October 26, 2022.\n^ Carroll, Micah D.; Dragan, Anca; Russell, Stuart; Hadfield-Menell, Dylan (June 28, 2022). \"Estimating and Penalizing Induced Preference Shifts in Recommender Systems\". International Conference on Machine Learning. PMLR: 2686–2708. arXiv:2204.11966. Retrieved October 26, 2022.\n^ \"Researchers report genomic profiling from more than 110,000 tumors\". News-Medical.net. July 19, 2022. Retrieved November 20, 2022.\n^ Klein, Harry; Mazor, Tali; Siegel, Ethan; Trukhanov, Pavel; Ovalle, Andrea; Vecchio Fitz, Catherine Del; Zwiesler, Zachary; Kumari, Priti; Van Der Veen, Bernd; Marriott, Eric; Hansel, Jason; Yu, Joyce; Albayrak, Adem; Barry, Susan; Keller, Rachel B.; MacConaill, Laura E.; Lindeman, Neal; Johnson, Bruce E.; Rollins, Barrett J.; Do, Khanh T.; Beardslee, Brian; Shapiro, Geoffrey; Hector-Barry, Suzanne; Methot, John; Sholl, Lynette; Lindsay, James; Hassett, Michael J.; Cerami, Ethan (October 6, 2022). \"MatchMiner: an open-source platform for cancer precision medicine\". npj Precision Oncology. 6 (1): 69. doi:10.1038/s41698-022-00312-5. ISSN 2397-768X. PMC 9537311. PMID 36202909.\n^ \"\"Anna's Archive\" Opens the Door to Z-Library and Other Pirate Libraries * TorrentFreak\". TorrentFreak. Retrieved December 18, 2022.\n^ \"'Shadow Libraries' Are Moving Their Pirated Books to The Dark Web After Fed Crackdowns\". Vice. November 30, 2022. Retrieved December 18, 2022.\n^ Fadelli, Ingrid. \"Study assesses the quality of AI literary translations by comparing them with human translations\". techxplore.com. Retrieved December 18, 2022.\n^ Thai, Katherine; Karpinska, Marzena; Krishna, Kalpesh; Ray, Bill; Inghilleri, Moira; Wieting, John; Iyyer, Mohit (October 25, 2022). \"Exploring Document-Level Literary Machine Translation with Parallel Paragraphs from World Literature\". arXiv:2210.14250 [cs.CL].\n^ Cockburn, Harry (November 9, 2022). \"Global oil and gas emissions 'up to three times higher than companies claim'\". The Independent. Retrieved December 18, 2022.\n^ \"Emissions Map - Climate TRACE\". climatetrace.org. Archived from the original on December 18, 2022. Retrieved December 18, 2022.\nPress release: \"News - Climate TRACE\". Retrieved December 18, 2022.\nPress release: \"News - Climate TRACE\". Retrieved December 18, 2022.\n^ Ortutay, Barbara. \"Twitter drama too much? Mastodon, others emerge as options\". techxplore.com. Retrieved December 18, 2022.\n^ Urbain, Thomas. \"What could a world without Twitter look like?\". techxplore.com. Retrieved December 18, 2022.\n^ \"The best Twitter alternatives\". ZDNET. Retrieved December 18, 2022.\n^ Zewe, Adam. \"Empowering social media users to assess content helps fight misinformation\". Massachusetts Institute of Technology via techxplore.com. Retrieved December 18, 2022.\n^ Jahanbakhsh, Farnaz; Zhang, Amy X.; Karger, David R. (November 11, 2022). \"Leveraging Structured Trusted-Peer Assessments to Combat Misinformation\". Proceedings of the ACM on Human-Computer Interaction. 6 (CSCW2): 524:1–524:40. doi:10.1145/3555637. hdl:1721.1/147638.\n^ Jahanbakhsh, Farnaz; Zhang, Amy X.; Karahalios, Karrie; Karger, David R. (November 11, 2022). \"Our Browser Extension Lets Readers Change the Headlines on News Articles, and You Won't Believe What They Did!\". Proceedings of the ACM on Human-Computer Interaction. 6 (CSCW2): 530:1–530:33. doi:10.1145/3555643. hdl:1721.1/147640.\n^ \"New MIT Sloan research measures exposure to misinformation from political elites on Twitter\". AP NEWS. November 29, 2022. Retrieved December 18, 2022.\n^ Mosleh, Mohsen; Rand, David G. (November 21, 2022). \"Measuring exposure to misinformation from political elites on Twitter\". Nature Communications. 13 (1): 7144. Bibcode:2022NatCo..13.7144M. doi:10.1038/s41467-022-34769-6. ISSN 2041-1723. PMC 9681735. PMID 36414634.\n^ Fadelli, Ingrid. \"LaundroGraph: Using deep learning to support anti–money laundering efforts\". techxplore.com. Retrieved December 18, 2022.\n^ Cardoso, Mário; Saleiro, Pedro; Bizarro, Pedro (October 26, 2022). \"LaundroGraph: Self-Supervised Graph Representation Learning for Anti-Money Laundering\". Proceedings of the Third ACM International Conference on AI in Finance. Association for Computing Machinery. pp. 130–138. arXiv:2210.14360. doi:10.1145/3533271.3561727. ISBN 978-1-4503-9376-8. S2CID 253022343.\n^ Patringenaru, Ioana. \"New web tracking technique is bypassing privacy protections\". University of California-San Diego via techxplore.com. Retrieved January 18, 2023.\n^ Randall, Audrey; Snyder, Peter; Ukani, Alisha; Snoeren, Alex C.; Voelker, Geoffrey M.; Savage, Stefan; Schulman, Aaron (October 25, 2022). \"Measuring UID smuggling in the wild\". Proceedings of the 22nd ACM Internet Measurement Conference. Association for Computing Machinery. pp. 230–243. doi:10.1145/3517745.3561415. ISBN 978-1-4503-9259-4. S2CID 250494286.\n^ \"OpenAI releases Point-E, an AI that generates 3D models\". Tech Crunch. December 20, 2022. Retrieved December 20, 2022.\n^ Nichol, Alex; Jun, Heewoo; Dhariwal, Prafulla; Mishkin, Pamela; Chen, Mark (December 16, 2022). \"Point-E: A System for Generating 3D Point Clouds from Complex Prompts\". arXiv:2212.08751 [cs.CV].\n^ a b \"What ChatGPT Could Mean for the Metaverse\". Time. Retrieved February 2, 2023.\n^ \"Rapidly Generate 3D Assets for Virtual Worlds with Generative AI\". NVIDIA Technical Blog. January 3, 2023. Retrieved February 2, 2023.\n^ Edwards, Benj (November 21, 2022). \"3D for everyone? Nvidia's Magic3D can generate 3D models from text\". Ars Technica. Retrieved February 2, 2023.\n^ \"Laser bursts drive fastest-ever logic gates\". University of Rochester. May 11, 2022. Retrieved May 13, 2022.\n^ Boolakee, Tobias; Heide, Christian; Garzón-Ramírez, Antonio; Weber, Heiko B.; Franco, Ignacio; Hommelhoff, Peter (May 2022). \"Light-field control of real and virtual charge carriers\". Nature. 605 (7909): 251–255. arXiv:2203.03509. Bibcode:2022Natur.605..251B. doi:10.1038/s41586-022-04565-9. ISSN 1476-4687. PMID 35546189. S2CID 247292038.\n^ \"New life cycle assessment study shows useful life of tech-critical metals to be short\". University of Bayreuth. Retrieved June 23, 2022.\n^ Charpentier Poncelet, Alexandre; Helbig, Christoph; Loubet, Philippe; Beylot, Antoine; Muller, Stéphanie; Villeneuve, Jacques; Laratte, Bertrand; Thorenz, Andrea; Tuma, Axel; Sonnemann, Guido (May 19, 2022). \"Losses and lifetimes of metals in the economy\" (PDF). Nature Sustainability. 5 (8): 717–726. Bibcode:2022NatSu...5..717C. doi:10.1038/s41893-022-00895-8. ISSN 2398-9629. S2CID 248894322.\n^ \"Scientists grew living human skin around a robotic finger\". Science News. June 9, 2022. Retrieved July 20, 2022.\n^ Kawai, Michio; Nie, Minghao; Oda, Haruka; Morimoto, Yuya; Takeuchi, Shoji (July 6, 2022). \"Living skin on a robot\". Matter. 5 (7): 2190–2208. doi:10.1016/j.matt.2022.05.019. ISSN 2590-2393.\n^ Barker, Ross. \"Artificial skin capable of feeling pain could lead to new generation of touch-sensitive robots\". University of Glasgow. Retrieved July 20, 2022.\n^ Liu, Fengyuan; Deswal, Sweety; Christou, Adamos; Shojaei Baghini, Mahdieh; Chirila, Radu; Shakthivel, Dhayalan; Chakraborty, Moupali; Dahiya, Ravinder (June 2022). \"Printed synaptic transistor–based electronic skin for robots to feel and learn\" (PDF). Science Robotics. 7 (67) eabl7286. doi:10.1126/scirobotics.abl7286. ISSN 2470-9476. PMID 35648845. S2CID 249275626.\n^ Velasco, Emily. \"Artificial skin gives robots sense of touch and beyond\". California Institute of Technology. Retrieved July 20, 2022.\n^ Yu, You; Li, Jiahong; Solomon, Samuel A.; Min, Jihong; Tu, Jiaobing; Guo, Wei; Xu, Changhao; Song, Yu; Gao, Wei (June 1, 2022). \"All-printed soft human-machine interface for robotic physicochemical sensing\". Science Robotics. 7 (67) eabn0495. doi:10.1126/scirobotics.abn0495. ISSN 2470-9476. PMC 9302713. PMID 35648844.\n^ Yirka, Bob. \"Biomimetic elastomeric robot skin has tactile sensing abilities\". techxplore.com. Retrieved July 23, 2022.\n^ Park, K.; Yuk, H.; Yang, M.; Cho, J.; Lee, H.; Kim, J. (June 8, 2022). \"A biomimetic elastomeric robot skin using electrical impedance and acoustic tomography for tactile sensing\". Science Robotics. 7 (67) eabm7187. doi:10.1126/scirobotics.abm7187. ISSN 2470-9476. PMID 35675452. S2CID 249520303.\n^ Porter, Jon (June 30, 2022). \"Samsung beats TSMC to production of 3nm chips\". The Verge. Retrieved September 3, 2022.\n^ \"Samsung Begins Chip Production Using 3nm Process Technology With GAA Architecture\". Samsung. June 30, 2022. Retrieved July 3, 2022.\n^ \"'Artificial synapse' could make neural networks work more like brains\". New Scientist. Retrieved August 21, 2022.\n^ Onen, Murat; Emond, Nicolas; Wang, Baoming; Zhang, Difei; Ross, Frances M.; Li, Ju; Yildiz, Bilge; del Alamo, Jesús A. (July 29, 2022). \"Nanosecond protonic programmable resistors for analog deep learning\" (PDF). Science. 377 (6605): 539–543. Bibcode:2022Sci...377..539O. doi:10.1126/science.abp8064. ISSN 0036-8075. PMID 35901152. S2CID 251159631.\n^ \"Artificial neuron swaps dopamine with rat brain cells like a real one\". New Scientist. Retrieved September 16, 2022.\n^ Wang, Ting; Wang, Ming; Wang, Jianwu; Yang, Le; Ren, Xueyang; Song, Gang; Chen, Shisheng; Yuan, Yuehui; Liu, Ruiqing; Pan, Liang; Li, Zheng; Leow, Wan Ru; Luo, Yifei; Ji, Shaobo; Cui, Zequn; He, Ke; Zhang, Feilong; Lv, Fengting; Tian, Yuanyuan; Cai, Kaiyu; Yang, Bowen; Niu, Jingyi; Zou, Haochen; Liu, Songrui; Xu, Guoliang; Fan, Xing; Hu, Benhui; Loh, Xian Jun; Wang, Lianhui; Chen, Xiaodong (August 8, 2022). \"A chemically mediated artificial neuron\". Nature Electronics. 5 (9): 586–595. doi:10.1038/s41928-022-00803-0. hdl:10356/163240. ISSN 2520-1131. S2CID 251464760.\n^ \"Researchers discover a material that can learn like the brain\". Ecole Polytechnique Federale de Lausanne. Retrieved September 15, 2022.\n^ Samizadeh Nikoo, Mohammad; Soleimanzadeh, Reza; Krammer, Anna; Migliato Marega, Guilherme; Park, Yunkyu; Son, Junwoo; Schueler, Andreas; Kis, Andras; Moll, Philip J. W.; Matioli, Elison (August 22, 2022). \"Electrical control of glass-like dynamics in vanadium dioxide for data storage and processing\". Nature Electronics. 5 (9): 596–603. doi:10.1038/s41928-022-00812-z. ISSN 2520-1131. S2CID 251759964.\n^ \"How cyborg cockroaches could be used to save people trapped under earthquake rubble\". ABC News. September 22, 2022. Retrieved October 20, 2022.\n^ Kakei, Yujiro; Katayama, Shumpei; Lee, Shinyoung; Takakuwa, Masahito; Furusawa, Kazuya; Umezu, Shinjiro; Sato, Hirotaka; Fukuda, Kenjiro; Someya, Takao (September 5, 2022). \"Integration of body-mounted ultrasoft organic solar cell on cyborg insects with intact mobility\". npj Flexible Electronics. 6 (1) 78: 1–9. doi:10.1038/s41528-022-00207-2. hdl:10356/164346. ISSN 2397-4621.\nResearch institute press release: \"Robo-bug: A rechargeable, remote-controllable cyborg cockroach\". RIKEN via techxplore.com. Retrieved October 20, 2022.\nResearch institute press release: \"Robo-bug: A rechargeable, remote-controllable cyborg cockroach\". RIKEN via techxplore.com. Retrieved October 20, 2022.\n^ Sarkar, Tanmoy; Lieberth, Katharina; Pavlou, Aristea; Frank, Thomas; Mailaender, Volker; McCulloch, Iain; Blom, Paul W. M.; Torriccelli, Fabrizio; Gkoupidenis, Paschalis (November 7, 2022). \"An organic artificial spiking neuron for in situ neuromorphic sensing and biointerfacing\". Nature Electronics. 5 (11): 774–783. doi:10.1038/s41928-022-00859-y. hdl:10754/686016. ISSN 2520-1131. S2CID 253413801.\n^ \"Artificial neurons emulate biological counterparts to enable synergetic operation\". Nature Electronics. 5 (11): 721–722. November 10, 2022. doi:10.1038/s41928-022-00862-3. ISSN 2520-1131. S2CID 253469402.\n^ \"Why we should worry about computer suffering\". IAI TV – Changing how the world thinks. March 2, 2021. Retrieved March 8, 2021.\n^ Thomas Metzinger (February 19, 2021). \"Artificial Suffering: An Argument for a Global Moratorium on Synthetic Phenomenology\". Journal of Artificial Intelligence and Consciousness. 08: 43–66. doi:10.1142/S270507852150003X. ISSN 2705-0785.  Available under CC BY 4.0.\n^ \"FAO – News Article: Food systems account for more than one third of global greenhouse gas emissions\". www.fao.org. Archived from the original on September 30, 2023. Retrieved April 22, 2021.\n^ Crippa, M.; Solazzo, E.; Guizzardi, D.; Monforti-Ferrario, F.; Tubiello, F. N.; Leip, A. (March 2021). \"Food systems are responsible for a third of global anthropogenic GHG emissions\". Nature Food. 2 (3): 198–209. doi:10.1038/s43016-021-00225-9. ISSN 2662-1355. PMID 37117443.\n^ \"Average westerner's eating habits lead to loss of four trees every year\". the Guardian. March 29, 2021. Retrieved April 19, 2021.\n^ Hoang, Nguyen Tien; Kanemoto, Keiichiro (March 29, 2021). \"Mapping the deforestation footprint of nations reveals growing threat to tropical forests\". Nature Ecology & Evolution. 5 (6): 845–853. Bibcode:2021NatEE...5..845H. doi:10.1038/s41559-021-01417-z. ISSN 2397-334X. PMID 33782576. S2CID 232420306. Retrieved April 19, 2021.\n^ Lu, Donna. \"Bitcoin mining emissions in China will hit 130 million tonnes by 2024\". New Scientist. Retrieved May 9, 2021.\n^ Jiang, Shangrong; Li, Yuze; Lu, Quanying; Hong, Yongmiao; Guan, Dabo; Xiong, Yu; Wang, Shouyang (April 6, 2021). \"Policy assessments for the carbon emission flows and sustainability of Bitcoin blockchain operation in China\". Nature Communications. 12 (1): 1938. Bibcode:2021NatCo..12.1938J. doi:10.1038/s41467-021-22256-3. ISSN 2041-1723. PMC 8024295. PMID 33824331.  Available under CC BY 4.0.\n^ \"Elon Musk's Neuralink 'shows monkey playing Pong with mind'\". BBC. April 9, 2021. Retrieved April 10, 2021.\n^ \"Monkey MindPong\". Neuralink. April 9, 2021. Retrieved April 10, 2021.\n^ \"Elon Musk startup shows monkey with brain chip implants playing video game\". The Guardian. April 9, 2021. Retrieved April 10, 2021.\n^ a b Kleiner, Kurt (August 25, 2022). \"Making computer chips act more like brain cells\". Knowable Magazine. doi:10.1146/knowable-082422-1. Retrieved September 23, 2022.\n^ Gumyusenge, Aristide; Melianas, Armantas; Keene, Scott T.; Salleo, Alberto (July 26, 2021). \"Materials Strategies for Organic Neuromorphic Devices\". Annual Review of Materials Research. 51 (1): 47–71. Bibcode:2021AnRMS..51...47G. doi:10.1146/annurev-matsci-080619-111402. ISSN 1531-7331. S2CID 234837472.\n^ \"Overcoming tab overload: Researchers develop tool to better manage browser tabs\". techxplore.com. Retrieved June 14, 2021.\n^ Chang, Joseph Chee; Hahn, Nathan; Kim, Yongsung; Coupland, Julina; Breneisen, Bradley; Kim, Hannah S; Hwong, John; Kittur, Aniket (May 6, 2021). \"When the Tab Comes Due:Challenges in the Cost Structure of Browser Tab Usage\". Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery. pp. 1–15. doi:10.1145/3411764.3445585. ISBN 978-1-4503-8096-6. S2CID 233987809.  Available under CC BY 4.0.\n^ \"Cyber attack shuts down U.S. fuel pipeline 'jugular,' Biden briefed\". Reuters. May 8, 2021. Retrieved June 13, 2021.\n^ \"Tiny, Wireless, Injectable Chips Use Ultrasound to Monitor Body Processes\". Columbia University. May 12, 2021. Retrieved May 14, 2021.\n^ Shi, Chen; Andino-Pavlovsky, Victoria; Lee, Stephen A.; Costa, Tiago; Elloian, Jeffrey; Konofagou, Elisa E.; Shepard, Kenneth L. (May 1, 2021). \"Application of a sub–0.1-mm3 implantable mote for in vivo real-time wireless temperature sensing\". Science Advances. 7 (19) eabf6312. Bibcode:2021SciA....7.6312S. doi:10.1126/sciadv.abf6312. ISSN 2375-2548. PMC 8104878. PMID 33962948.\n^ \"Brain Computer Interface Turns Mental Handwriting into Text on Screen\". Howard Hughes Medical Institute. May 12, 2021. Retrieved May 14, 2021.\n^ Willett, Francis R.; Avansino, Donald T.; Hochberg, Leigh R.; Henderson, Jaimie M.; Shenoy, Krishna V. (May 2021). \"High-performance brain-to-text communication via handwriting\". Nature. 593 (7858): 249–254. Bibcode:2021Natur.593..249W. doi:10.1038/s41586-021-03506-2. ISSN 1476-4687. PMC 8163299. PMID 33981047.\n^ \"Archivists Want to Make Sci-Hub 'Un-Censorable'\". Gizmodo. Retrieved June 13, 2021.\n^ \"Google showed off its next-generation AI by talking to Pluto and a paper airplane\". The Verge. May 18, 2021. Retrieved May 21, 2021.\n^ \"LaMDA: our breakthrough conversation technology\". Google. May 18, 2021. Retrieved May 21, 2021.\n^ \"Google and Harvard map brain connections in unprecedented detail\". New Atlas. June 2, 2021. Retrieved June 13, 2021.\n^ Shapson-Coe, Alexander; Januszewski, Michał; Berger, Daniel R.; Pope, Art; Wu, Yuelong; Blakely, Tim; Schalek, Richard L.; Li, Peter; Wang, Shuohong; Maitin-Shepard, Jeremy; Karlupia, Neha; Dorkenwald, Sven; Sjostedt, Evelina; Leavitt, Laramie; Lee, Dongil; Bailey, Luke; Fitzmaurice, Angerica; Kar, Rohin; Field, Benjamin; Wu, Hank; Wagner-Carena, Julian; Aley, David; Lau, Joanna; Lin, Zudi; Wei, Donglai; Pfister, Hanspeter; Peleg, Adi; Jain, Viren; Lichtman, Jeff W. (May 30, 2021). \"A connectomic study of a petascale fragment of human cerebral cortex\". bioRxiv 10.1101/2021.05.29.446289.\n^ Diario Oficial, numero 110, tomo n° 431, 9 de junio de 2021 Archived June 12, 2021, at the Wayback Machine, Official Journal of El Salvador, National Press of El Salvador\n^ Gorjón, S. (2021). The role of cryptoassets as legal tender: the example of El Salvador. Banco de Espana Article, 35, 21.\n^ Kharpal, Arjun (June 9, 2021). \"El Salvador is one step closer to making bitcoin legal tender after proposing new law\". msn.com. CNBC on MSN.com. Archived from the original on June 9, 2021. Retrieved June 9, 2021.\n^ \"GitHub's automatic coding tool rests on untested legal ground\". The Verge. July 7, 2021. Retrieved July 11, 2021.\n^ \"GitHub Copilot · Your AI pair programmer\". GitHub Copilot. Retrieved April 7, 2022.\n^ Claburn, Thomas. \"FauxPilot: Like GitHub Copilot without Microsoft telemetry\". www.theregister.com. Retrieved September 23, 2022.\n^ \"Smart technology is not making us dumber: study\". phys.org. Retrieved August 14, 2021.\n^ Cecutti, Lorenzo; Chemero, Anthony; Lee, Spike W. S. (July 1, 2021). \"Technology may change cognition without necessarily harming it\". Nature Human Behaviour. 5 (8): 973–975. doi:10.1038/s41562-021-01162-0. ISSN 2397-3374. PMID 34211150. S2CID 235709853. Retrieved August 14, 2021.\n^ \"Amazon shifts Lumberyard to open source 3D game engine supported by 20 companies\". VentureBeat. July 6, 2021. Retrieved September 3, 2022.\n^ \"Think before you 'speak': brain–computer interface restores speech in paralysed man\". Physics World. August 5, 2021. Retrieved August 14, 2021.\n^ Moses, David A.; Metzger, Sean L.; Liu, Jessie R.; Anumanchipalli, Gopala K.; Makin, Joseph G.; Sun, Pengfei F.; Chartier, Josh; Dougherty, Maximilian E.; Liu, Patricia M.; Abrams, Gary M.; Tu-Chan, Adelyn; Ganguly, Karunesh; Chang, Edward F. (July 15, 2021). \"Neuroprosthesis for Decoding Speech in a Paralyzed Person with Anarthria\". New England Journal of Medicine. 385 (3): 217–227. doi:10.1056/NEJMoa2027540. PMC 8972947. PMID 34260835. S2CID 235907121.\n^ \"Internet: Un nouveau record de débit à 319 Tbit/S\". July 16, 2021.\n^ Fox, Will. \"Japan sets new Internet speed record: 319 Tbit/s\". www.futuretimeline.net.\n^ \"Teens around the world are lonelier than a decade ago. The reason may be smartphones\". Washington Post. Retrieved August 14, 2021.\n^ Twenge, Jean M.; Haidt, Jonathan; Blake, Andrew B.; McAllister, Cooper; Lemon, Hannah; Le Roy, Astrid (July 20, 2021). \"Worldwide increases in adolescent loneliness\". Journal of Adolescence. 93: 257–269. doi:10.1016/j.adolescence.2021.06.006. ISSN 0140-1971. PMID 34294429.\n^ \"DeepMind's AI predicts structures for a vast trove of proteins\". Nature. July 22, 2021. Retrieved August 1, 2021.\n^ \"Chinese team hopes high-res image of monkey brain will unlock secrets\". South China Morning Post. August 1, 2021. Retrieved August 13, 2021.\n^ Xu, Fang; Shen, Yan; Ding, Lufeng; Yang, Chao-Yu; Tan, Heng; Wang, Hao; Zhu, Qingyuan; Xu, Rui; Wu, Fengyi; Xiao, Yanyang; Xu, Cheng; Li, Qianwei; Su, Peng; Zhang, Li I.; Dong, Hong-Wei; Desimone, Robert; Xu, Fuqiang; Hu, Xintian; Lau, Pak-Ming; Bi, Guo-Qiang (July 26, 2021). \"High-throughput mapping of a whole rhesus monkey brain at micrometer resolution\". Nature Biotechnology. 39 (12): 1521–1528. doi:10.1038/s41587-021-00986-5. ISSN 1546-1696. PMID 34312500. S2CID 236453498.\n^ \"Computer scientist warns global internet is not prepared for a large solar storm\". techxplore.com. Retrieved September 22, 2021.\n^ \"A Bad Solar Storm Could Cause an 'Internet Apocalypse'\". Wired. Retrieved September 22, 2021.\n^ Jyothi, Sangeetha Abdu (August 9, 2021). \"Solar superstorms: Planning for an internet apocalypse\". Proceedings of the 2021 ACM SIGCOMM 2021 Conference. Association for Computing Machinery. pp. 692–704. doi:10.1145/3452296.3472916. ISBN 978-1-4503-8383-7.\n^ \"Analysis | We Need Cap-and-Trade For Individuals As Well As Companies\". Washington Post. Retrieved September 21, 2021.\n^ \"Pandemic and digitalization set stage for revival of a cast-off idea: Personal carbon allowances\". phys.org.\n^ Fuso Nerini, Francesco; Fawcett, Tina; Parag, Yael; Ekins, Paul (August 16, 2021). \"Personal carbon allowances revisited\". Nature Sustainability. 4 (12): 1025–1031. Bibcode:2021NatSu...4.1025F. doi:10.1038/s41893-021-00756-w. ISSN 2398-9629.\n^ \"This massive AI chip has the compute power of a human brain\". PC World. August 24, 2021. Retrieved August 28, 2021.\n^ \"AI may predict the next virus to jump from animals to humans\". Public Library of Science. Retrieved October 19, 2021.\n^ Mollentze, Nardus; Babayan, Simon A.; Streicker, Daniel G. (September 28, 2021). \"Identifying and prioritizing potential human-infecting viruses from their genome sequences\". PLOS Biology. 19 (9) e3001390. doi:10.1371/journal.pbio.3001390. ISSN 1545-7885. PMC 8478193. PMID 34582436.\n^ Isaac, Mike; Frenkel, Sheera (October 4, 2021). \"Facebook and all of its apps go down simultaneously\". The New York Times. Archived from the original on October 4, 2021. Retrieved October 4, 2021.\n^ Clark, Mitchell (October 4, 2021). \"What is BGP, and what role did it play in Facebook's massive outage\". The Verge. Retrieved November 15, 2021.\n^ \"Study reveals scale of data-sharing from Android mobile phones\". Trinity College Dublin. Retrieved November 16, 2021.\n^ Liu, Haoyu; Patras, Paul; Leith, Douglas J. (October 6, 2021). \"Android Mobile OS Snooping By Samsung, Xiaomi, Huawei and Realme Handsets\" (PDF). Retrieved November 16, 2021.\n^ Wills, Jennifer. \"Saying farewell to a throwaway fashion industry\". Horizon: The EU Research Innovation Magazine. Retrieved November 15, 2021.\n^ Fadelli, Ingrid. \"DeepDraper: A technique that predicts how clothes would look on different people\". Tech Xplore. Retrieved November 15, 2021.\n^ \"Scientists claim big advance in using DNA to store data\". bbc.co.uk. December 2, 2021. Retrieved December 3, 2021.\n^ Yirka, Bob. \"A mass of human brain cells in a petri dish has been taught to play Pong\". medicalxpress.com. Retrieved January 16, 2022.\n^ Kagan, Brett J.; Kitchen, Andy C.; Tran, Nhi T.; Parker, Bradyn J.; Bhat, Anjali; Rollo, Ben; Razi, Adeel; Friston, Karl J. (2022). \"In vitro neurons learn and exhibit sentience when embodied in a simulated game-world\". Neuron. 110 (23): 3952–3969.e8. bioRxiv 10.1101/2021.12.02.471005v2. doi:10.1016/j.neuron.2022.09.001. PMC 9747182. PMID 36228614.\n^ Bolakhe, Saugat. \"Lego Robot with an Organic 'Brain' Learns to Navigate a Maze\". Scientific American. Retrieved February 1, 2022.\n^ Krauhausen, Imke; Koutsouras, Dimitrios A.; Melianas, Armantas; Keene, Scott T.; Lieberth, Katharina; Ledanseur, Hadrien; Sheelamanthula, Rajendar; Giovannitti, Alexander; Torricelli, Fabrizio; Mcculloch, Iain; Blom, Paul W. M.; Salleo, Alberto; Burgt, Yoeri van de; Gkoupidenis, Paschalis (December 2021). \"Organic neuromorphic electronics for sensorimotor integration and learning in robotics\". Science Advances. 7 (50) eabl5068. Bibcode:2021SciA....7.5068K. doi:10.1126/sciadv.abl5068. hdl:10754/673986. PMC 8664264. PMID 34890232. S2CID 245046482.\n^ Qureshi, Muhammad Saad; Oasmaa, Anja; Pihkola, Hanna; Deviatkin, Ivan; Tenhunen, Anna; Mannila, Juha; Minkkinen, Hannu; Pohjakallio, Maija; Laine-Ylijoki, Jutta (November 1, 2020). \"Pyrolysis of plastic waste: Opportunities and challenges\". Journal of Analytical and Applied Pyrolysis. 152 104804. Bibcode:2020JAAP..15204804Q. doi:10.1016/j.jaap.2020.104804. ISSN 0165-2370. S2CID 200068035.\n^ \"Breakthrough in separating plastic waste: Machines can now distinguish 12 different types of plastic\". Aarhus University. Retrieved January 19, 2022.\n^ Henriksen, Martin L.; Karlsen, Celine B.; Klarskov, Pernille; Hinge, Mogens (January 1, 2022). \"Plastic classification via in-line hyperspectral camera analysis and unsupervised machine learning\". Vibrational Spectroscopy. 118 103329. Bibcode:2022VibSp.11803329H. doi:10.1016/j.vibspec.2021.103329. ISSN 0924-2031. S2CID 244913832.\n^ \"Telemedicine may be as good as in-person visits for managing chronic illnesses\". UPI. Retrieved January 17, 2022.\n^ Albritton, Jordan; Ortiz, Alexa; Wines, Roberta; Booth, Graham; DiBello, Michael; Brown, Stephen; Gartlehner, Gerald; Crotty, Karen (December 7, 2021). \"Video Teleconferencing for Disease Prevention, Diagnosis, and Treatment\" (PDF). Annals of Internal Medicine. 175 (2): 256–266. doi:10.7326/m21-3511. ISSN 0003-4819. PMID 34871056. S2CID 244923066.\n^ \"The 'most serious' security breach ever is unfolding right now. Here's what you need to know\". Washington Post. December 20, 2021. Retrieved January 16, 2022.\n^ \"After Log4j, Open-Source Software Is Now a National Security Issue\". Gizmodo. Retrieved January 16, 2022.\n^ Greig, Jonathan. \"After Log4j, White House fears the next big open source vulnerability\". ZDNet. Retrieved January 16, 2022.\n^ a b T. Jesper Jacobsson; Adam Hultqvist; Alberto García-Fernández; et al. (December 13, 2021). \"An open-access database and analysis tool for perovskite solar cells based on the FAIR data principles\". Nature Energy. 7: 107–115. doi:10.1038/s41560-021-00941-3. hdl:10356/163386. ISSN 2058-7546. S2CID 245175279.\n^ \"Jesperkemist/perovskitedatabase\". GitHub. January 24, 2022. Retrieved January 24, 2022.\n^ \"The Wikipedia of perovskite solar cell research\". Helmholtz Association of German Research Centres. Retrieved January 19, 2022.\n^ \"Maui Shell is a Beautiful Vision for the Future of Linux\". OMG! Ubuntu!. December 27, 2021. Retrieved January 24, 2022.\n^ Crume, Jacob (December 30, 2021). \"Maui Shell is Here, Ushering in a New Era of Desktop Linux\". It's FOSS – News. Retrieved January 16, 2022.\n^ Wallen, Jack. \"Is Maui Shell the future of the Linux desktop?\". TechRepublic. Retrieved January 24, 2022.\n^ Nestor, Marius (December 26, 2021). \"Meet Maui Shell, a Convergent Desktop Shell for Linux Desktops and Mobile Devices\". 9to5Linux. Retrieved January 24, 2022.\n^ Higuita, Camilo (December 26, 2021). \"Introducing Maui Shell\". Nitrux. Retrieved January 16, 2022.\n^ \"AMD Ryzen Threadripper 3990X is a ridiculous 64-core CPU – and it's coming February 7\". Techradar. January 6, 2020. Archived from the original on July 9, 2020. Retrieved July 7, 2020.\n^ Chandraseta, Rionaldi (January 21, 2021). \"Generate Your Favourite Characters' Voice Lines using Machine Learning\". Towards Data Science.\n^ Temitope, Yusuf (December 10, 2024). \"15.ai Creator reveals journey from MIT Project to internet phenomenon\". The Guardian.\n^ \"Folding@Home Crushes Exascale Barrier, Now Faster Than Dozens of Supercomputers – ExtremeTech\". www.extremetech.com. Archived from the original on April 17, 2020. Retrieved May 13, 2020.\n^ \"Folding@home crowdsourced computing project passes 1 million downloads amid coronavirus research\". VentureBeat. March 31, 2020. Archived from the original on April 17, 2020. Retrieved May 13, 2020.\n^ \"The coronavirus pandemic turned Folding@Home into an exaFLOP supercomputer\". Ars Technica. April 14, 2020. Archived from the original on April 23, 2020. Retrieved May 13, 2020.\n^ Tung, Liam. \"CERN throws 10,000 CPU cores at Folding@home coronavirus simulation project\". ZDNet. Archived from the original on November 1, 2020. Retrieved May 13, 2020.\n^ \"Scientists create tiny devices that work like the human brain\". The Independent. April 20, 2020. Archived from the original on April 24, 2020. Retrieved May 17, 2020.\n^ \"Researchers unveil electronics that mimic the human brain in efficient learning\". phys.org. Archived from the original on May 28, 2020. Retrieved May 17, 2020.\n^ Fu, Tianda; Liu, Xiaomeng; Gao, Hongyan; Ward, Joy E.; Liu, Xiaorong; Yin, Bing; Wang, Zhongrui; Zhuo, Ye; Walker, David J. F.; Joshua Yang, J.; Chen, Jianhan; Lovley, Derek R.; Yao, Jun (April 20, 2020). \"Bioinspired bio-voltage memristors\". Nature Communications. 11 (1): 1861. Bibcode:2020NatCo..11.1861F. doi:10.1038/s41467-020-15759-y. PMC 7171104. PMID 32313096.\n^ Staff (May 22, 2020). \"Australian researchers record world's fastest internet speed from a single optical chip\". Monash University. Archived from the original on May 23, 2020. Retrieved May 24, 2020.\n^ Monash University (May 22, 2020). \"Australian researchers record world's fastest internet speed from a single optical chip\". EurekAlert!. Archived from the original on May 25, 2020. Retrieved May 28, 2020.\n^ Corcoran, Bill; Tan, Mengxi; Xu, Xingyuan; Boes, Andreas; Wu, Jiayang; Nguyen, Thach G.; Chu, Sai T.; Little, Brent E.; Morandotti, Roberto; Mitchell, Arnan; Moss, David J. (May 22, 2020). \"Ultra-dense optical data transmission over standard fibre with a single chip source\". Nature Communications. 11 (1): 2568. arXiv:2003.11893. Bibcode:2020NatCo..11.2568C. doi:10.1038/s41467-020-16265-x. PMC 7244755. PMID 32444605.\n^ \"Evidence of large groups responding more slowly to crises due to false information\". phys.org. Archived from the original on June 13, 2020. Retrieved June 13, 2020.\n^ Shirado, Hirokazu; Crawford, Forrest W.; Christakis, Nicholas A. (May 27, 2020). \"Collective communication and behaviour in response to uncertain 'Danger' in network experiments\". Proceedings of the Royal Society A: Mathematical, Physical and Engineering Sciences. 476 (2237) 20190685. Bibcode:2020RSPSA.47690685S. doi:10.1098/rspa.2019.0685. PMC 7277132. PMID 32518501.  Fragments of the text were copied from this source, which is available under a Creative Commons Attribution 4.0 International License Archived October 16, 2017, at the Wayback Machine.\n^ \"OpenAI API\". OpenAI. June 11, 2020.\n^ Coldewey, Devin (June 11, 2020). \"OpenAI makes an all-purpose API for its text-based AI capabilities\". TechCrunch. Archived from the original on October 27, 2021. Retrieved July 31, 2020. If you've ever wanted to try out OpenAI's vaunted machine learning toolset, it just got a lot easier. The company has released an API that lets developers call its AI tools in on \"virtually any English language task.\"\n^ \"New video format 'halves data use of 4K and 8K TVs'\". BBC News. July 7, 2020. Archived from the original on July 7, 2020. Retrieved July 9, 2020.\n^ \"Fraunhofer Heinrich Hertz Institute HHI\". newsletter.fraunhofer.de. Archived from the original on July 8, 2020. Retrieved August 17, 2020.\n^ Keene, Scott T.; Lubrano, Claudia; Kazemzadeh, Setareh; Melianas, Armantas; Tuchman, Yaakov; Polino, Giuseppina; Scognamiglio, Paola; Cinà, Lucio; Salleo, Alberto; van de Burgt, Yoeri; Santoro, Francesca (September 2020). \"A biohybrid synapse with neurotransmitter-mediated plasticity\". Nature Materials. 19 (9): 969–973. Bibcode:2020NatMa..19..969K. doi:10.1038/s41563-020-0703-y. ISSN 1476-4660. PMID 32541935. S2CID 219691307.\nUniversity press release: \"Researchers develop artificial synapse that works with living cells\". Stanford University via medicalxpress.com. Retrieved September 23, 2022.\nUniversity press release: \"Researchers develop artificial synapse that works with living cells\". Stanford University via medicalxpress.com. Retrieved September 23, 2022.\n^ \"Beetles carrying tiny backpack cameras stream footage to a smartphone\". New Scientist. Retrieved September 7, 2022.\n^ Iyer, Vikram; Najafi, Ali; James, Johannes; Fuller, Sawyer; Gollakota, Shyamnath (July 15, 2020). \"Wireless steerable vision for live insects and insect-scale robots\". Science Robotics. 5 (44) eabb0839. doi:10.1126/scirobotics.abb0839. ISSN 2470-9476. PMID 33022605. S2CID 220688078.\n^ \"Neuralink: Elon Musk unveils pig with chip in its brain\". BBC News. August 29, 2020. Archived from the original on August 29, 2020. Retrieved August 29, 2020.\n^ \"Elon Musk trots out pigs in demo of Neuralink brain implants\". The Verge. August 28, 2020. Archived from the original on August 29, 2020. Retrieved August 29, 2020.\n^ Brainard, Jeffrey (September 8, 2020). \"Dozens of scientific journals have vanished from the internet, and no one preserved them\". Science | AAAS. Archived from the original on October 15, 2020. Retrieved October 11, 2020.\n^ Kwon, Diana (September 10, 2020). \"More than 100 scientific journals have disappeared from the Internet\". Nature. doi:10.1038/d41586-020-02610-z. Archived from the original on October 3, 2020. Retrieved October 11, 2020.\n^ Laakso, Mikael; Matthias, Lisa; Jahn, Najko (2021). \"Open is not forever: A study of vanished open access journals\". Journal of the Association for Information Science and Technology. 72 (9): 1099–1112. arXiv:2008.11933. doi:10.1002/ASI.24460. S2CID 221340749.\n^ \"Prosecutors open homicide case after hacker attack on German hospital\". Reuters. September 18, 2020. Archived from the original on October 3, 2020. Retrieved October 9, 2020.\n^ Starr, Michelle (October 3, 2020). \"A New Chemical 'Tree of The Origins of Life' Reveals Our Possible Molecular Evolution\". ScienceAlert. Archived from the original on October 6, 2020. Retrieved October 3, 2020.\n^ Wolos, Agnieszka; et al. (September 25, 2020). \"Synthetic connectivity, emergence, and self-regeneration in the network of prebiotic chemistry\". Science. 369 (6511) eaaw1955. doi:10.1126/science.aaw1955. PMID 32973002. S2CID 221882090. Archived from the original on October 4, 2020. Retrieved October 3, 2020.\n^ \"The Past, Present and Future of Robotic Surgery\". Smithsonian Magazine. Retrieved September 23, 2022.\n^ Attanasio, Aleks; Scaglioni, Bruno; De Momi, Elena; Fiorini, Paolo; Valdastri, Pietro (May 3, 2021). \"Autonomy in Surgical Robotics\". Annual Review of Control, Robotics, and Autonomous Systems. 4 (1): 651–679. doi:10.1146/annurev-control-062420-090543. hdl:11311/1168387. ISSN 2573-5144. S2CID 228881423.\n^ a b c \"Free Software Awards winners announced: CiviCRM, Bradley Kuhn, and Alyssa Rosenzweig — Free Software Foundation — Working together for free software\". www.fsf.org. Retrieved March 22, 2021.\n^ a b c Bantle, Ulrich (March 22, 2021). \"Free Software Awards vergeben\". Linux-Magazin (in German). Retrieved September 6, 2022.\n^ a b c Free Software Awards winners announced: SecuRepairs, Protesilaos Stavrou, Paul Eggert , FSF\n^ a b c Bantle, Ulrich (March 22, 2022). \"Free Software Awards 2021 vergeben\". Linux-Magazin (in German). Retrieved September 6, 2022.\n^ a b c \"Free Software Foundation award winners\". SD Times. March 21, 2022. Retrieved September 6, 2022.\n^ Speed, Richard. \"Asahi Linux progress in graphics drivers on Apple's M1\". www.theregister.com. Retrieved September 6, 2022.\n^ \"Artificial Intelligence Act: MEPs adopt landmark law | News | European Parliament\". www.europarl.europa.eu. March 13, 2024. Retrieved March 23, 2024.\n^ \"The E.U. Has Passed the World's First Comprehensive AI Law\". TIME. March 13, 2024. Retrieved March 23, 2024.\n^ \"Cyber Resilience Act: MEPs adopt plans to boost security of digital products | News | European Parliament\". www.europarl.europa.eu. March 12, 2024. Retrieved March 23, 2024.\n^ Williams, Alex (March 6, 2024). \"John Walker, Tech Executive Who Popularized AutoCAD, Dies at 74\". The New York Times. Retrieved March 6, 2024.\n^ Davis, Amanda (October 3, 2024). \"Robert Dennard, DRAM Pioneer, Dies at 91 - IEEE Spectrum\". IEEE Spectrum. Retrieved February 17, 2025.\n^ Edwards, Benj (May 21, 2024). \"Gordon Bell, an architect of our digital age, dies at age 89\". Ars Technica. Archived from the original on May 21, 2024. Retrieved May 21, 2024.\n^ Moore, Nicole Casal (June 11, 2024). \"The legacy of Lynn Conway, chip design pioneer and transgender-rights advocate\". Michigan Engineering. Retrieved June 11, 2024.\n^ Yoon, John; Isaac, Mike (August 10, 2024). \"Susan Wojcicki, Former Chief of YouTube, Dies at 56\". The New York Times. Archived from the original on August 10, 2024. Retrieved August 10, 2024.\n^ Rosen, Kenneth R. (November 16, 2024). \"Thomas E. Kurtz, co-creator of BASIC programming language, dies at 96\". The New York Times. Retrieved November 18, 2024.\n^ Noble, Holcomb B.; Hafner, Katie (March 24, 2023). \"Gordon E. Moore, Intel Co-Founder Behind Moore's Law, Dies at 94\". The New York Times. Archived from the original on July 16, 2023. Retrieved August 2, 2023.\n^ Swainson, Richard (June 3, 2023). \"Computing pioneer came to call New Zealand home\". The Post. Archived from the original on August 26, 2023. Retrieved August 27, 2023.\n^ Tosh-Morelli, Vicky (January 21, 2022). \"In Memoriam: Hagit Shatkay-Reshef\".\n^ \"[GDNET] Takao Nishizeki\". list.dia.uniroma3.it.\n^ Corbet, Jonathan (February 16, 2022). \"Lorinda Cherry RIP [LWN.net]\". lwn.net.\n^ Claburn, Thomas. \"Obit: Mary Coombs, first woman commercial programmer\". www.theregister.com.\n^ Cohn, Cindy (September 5, 2022). \"Honoring Peter Eckersley, Who Made the Internet a Safer Place for Everyone\". Electronic Frontier Foundation.\n^ O'Neil, Mathieu; Muselli, Laure; Raissi, Mahin; Zacchiroli, Stefano (May 2021). \"'Open source has won and lost the war': Legitimising commercial–communal hybridisation in a FOSS project\" (PDF). New Media & Society. 23 (5): 1157–1180. doi:10.1177/1461444820907022. ISSN 1461-4448. S2CID 216386568.\nWomen in computing\nArtificial intelligence\nMachine learning\nQuantum computing and communication\nFree and open-source software\nHypertext technology\nOperating systems\nDOS family\nWindows\nLinux\nProgramming languages\nVirtualization development\nInternet conflicts\nWeb search engines\nKathleen Antonelli\nJohn Vincent Atanasoff\nEdsger W. Dijkstra\nJ. Presper Eckert\nDouglas Engelbart\nMargaret Hamilton\nDavid A. Huffman\nJohn von Neumann\nKlára Dán von Neumann\nGuido van Rossum\nBjarne Stroustrup\nTwitter account hijacking\nEuropean Medicines Agency data breach\nNintendo data leak\nUnited States federal government data breach\nEasyJet data breach\nVastaamo data breach\nMicrosoft Exchange Server breach\nIvanti Pulse Connect Secure data breach\nColonial Pipeline ransomware attack\nHealth Service Executive ransomware attack\nWaikato District Health Board ransomware attack\nJBS S.A. ransomware attack\nKaseya VSA ransomware attack\nTransnet ransomware attack\nEpik data breach\nNational Rifle Association ransomware attack\nBanco de Oro hack\nIranian fuel cyberattack\nUkraine cyberattacks\nRed Cross data breach\nAnonymous and the Russian invasion of Ukraine\nDDoS attacks on Romania\nCosta Rican ransomware attack\nLastPass vault theft\nShanghai police database leak\nGrand Theft Auto VI content leak\nMunster Technological University ransomware attack\nCapita data breach\nEvide data breach\nMOVEit data breach\nInsomniac Games data breach\nOperation Triangulation cyberattack\nPolish railway cyberattack\nBritish Library cyberattack\nXZ Utils backdoor\nKadokawa and Niconico\nChange Healthcare ransomware attack\nUkrainian cyberattacks against Russia\n2024 WazirX hack\nTrump campaign hack\nFur Affinity domain hijacking\nIRLeaks attack on Iranian banks\nInternet Archive data breach\n2024 global telecommunications hack\n2024 National Public Data breach\nCyberattacks on Bank Sepah\n2025 Paraguay ransomware attack\n4chan hacking and data breach\n2025 St. Paul cyberattack\nJaguar Land Rover cyberattack\nCollins Aerospace cyberattack\n2025 cyberattack on Polish power grid\nManageMyHealth data breach\nNeighbourly data breach\nAnonymous\nassociated events\nassociated events\nHacktivist Nepal\nIndian Cyber Force\nIT Army of Ukraine\nGraham Ivan Clark\nmaia arson crimew\nThunderspy (2020)\nPrintNightmare (2021)\nFORCEDENTRY (2021)\nLog4Shell (2021)\nAccount pre-hijacking (2022)\nSinkclose (2024)\nDecade overview\nAfrica\nAsia\nEurope\nElectoral data\nScience and technology\nTimeline of the 21st century\nList of current heads of state and government\nList of protests in the 21st century\nList of ongoing armed conflicts\nCOVID-19\nPandemic\nPortal\nEconomic impact\nRecession\n2020 stock market crash\n2016 Paris Agreement on Climate Change\nTreaty descheduling of cannabis\n2022 Russian invasion of Ukraine\nUN Security Council\nList of all groups\nMajor groups, by size\nTechnology\nTransport\nComputing\nArts and culture\nArt\nPaintings\nSculptures\nLiterature\nMusic\nFashion\nSports\nWrestling\nSovereign states:\nScience and technology\nComputing\nSustainable energy\nAnti-aging\nBiotechnology\nQuantum IT\nTransportation technology\nCosmology\nPsychology\nSustainable energy\nTransportation technology\nList of timelines\n2020s in politics\n2020s in military history\n2020s in economic history\n2020s in environmental history\n2020s in science and technology\n2020s in climate history\n2020s in social history\nTimeline of the 21st century\nState leaders in the 2020s\nList of protests in the 21st century\nList of ongoing armed conflicts\nCOVID-19 pandemic\neconomic impact\n2020 stock market crash\nTreaty descheduling of cannabis\nUN Security Council\nList of all groups\nMajor groups, by size\nCOVID-19 pandemic\nGeorge Floyd protests\nUnited States racial unrest\nUnited States\n1\n2\n3\ntimeline\n2020\n2021\n2025\ntimeline\n2020\n2021\n2025\nCrisis in Venezuela\nForum for the Progress and Integration of South America\nCOVID-19 pandemic\nCOVID-19 pandemic\nRusso-Ukrainian war\n2022 Russian invasion of Ukraine\noutline\n2022 Russian invasion of Ukraine\nBelarus–European Union border crisis\nUnited Kingdom\n1\n2\n3\n4\nRepublic of Ireland\n2020 Kyrgyz Revolution\n2022 Sri Lankan protests\n2024 Noto earthquake\nCOVID-19 pandemic\nMyanmar civil war\nPhilippine drug war\nRegional Comprehensive Economic Partnership\nSecond Nagorno-Karabakh War\nJapan\n1\n2\n3a\n3b\n3c\n3d\n4a\n4b\nMalaysia\n1\n2\n3\n4\nMiddle East economic integration\nSyrian civil war\nLibyan civil war (2014–2020)\nYemeni civil war\nIsraeli political crisis\nMahsa Amini protests\nGaza war\noutline\nIsrael\n1a\n1b\n2\n3a\n3b\nAfrican Continental Free Trade Area\nNigeria Vision 2020\nSudanese transition to democracy\nEthiopian civil conflict\nTigray war\nCOVID-19 pandemic\ntimeline\nnational responses\nnational responses\nDRC–Rwanda conflict\nM23 campaign\nNigerien crisis (2023–2024)\nBenin–Niger crisis\nPacific Islands Forum\nPacific Community\nCOVID-19 pandemic",
  "Timeline_of_programming_languages": "This is a record of notable programming languages, by decade.\nHistory of computing hardware\nHistory of programming languages\nProgramming language\nTimeline of computing\nTimeline of programming language theory\n^ a b Edward H. Knight (1874–1875). \"THE FIRST CENTURY OF THE REPUBLIC (Second Paper) MECHANICAL PROGRESS Crompton's Fancy Loom\". In Alden, Henry Mills (ed.). Harper's New Monthly Magazine. Vol. L. 327-335 Pearl street, Franklin Square: Harper & Brothers (published 1875). p. 91 – via Cornell University Library: Google Books. Jacquard, of Lyon, is reported to have conceived the idea in 1790, and in 1801 he received from the National Exposition a bronze medal for his invention of a machine for figure-weaving, which he patented{{cite book}}:  CS1 maint: location (link)\n^ a b \n\"The Jacquard Loom: A Driver of the Industrial Revolution\". computerhistory.org. Computer History Museum. In Lyon, France, Joseph Marie Jacquard (1752-1834) demonstrated in 1801 a loom that enabled unskilled workers to weave complex patterns in silk.\nMichael N Geselowitz (1 January 2019). \"1801: Punched cards control Jacquard loom\". ieee.org. IEEE. At an industrial exhibition in Paris in 1801, Jacquard demonstrated\n\"Métier à tisser de Jacquard\". bnf.fr. BnF. En 1801, cet ingénieur de Lyon équipe le métier à tisser d'un mécanisme en fonte qui sélectionne les fils de chaîne grâce à un programme inscrit sur une carte perforée.\n\"BROCADE\". Supplement to Encyclopedia Britannica. (NINTH EDITION.) A DICTIONARY OF ARTS SCIENCES AND GENERAL LITERATURE. Vol. 1 (9 ed.). H.G. Allen (published 1833). 1888 – via Google Books. Until the invention of the Jacquard attachment to the loom in the year 1801, embroidered silk goods were called brocades.\n\"The Jacquard Loom: A Driver of the Industrial Revolution\". computerhistory.org. Computer History Museum. In Lyon, France, Joseph Marie Jacquard (1752-1834) demonstrated in 1801 a loom that enabled unskilled workers to weave complex patterns in silk.\nMichael N Geselowitz (1 January 2019). \"1801: Punched cards control Jacquard loom\". ieee.org. IEEE. At an industrial exhibition in Paris in 1801, Jacquard demonstrated\n\"Métier à tisser de Jacquard\". bnf.fr. BnF. En 1801, cet ingénieur de Lyon équipe le métier à tisser d'un mécanisme en fonte qui sélectionne les fils de chaîne grâce à un programme inscrit sur une carte perforée.\n\"BROCADE\". Supplement to Encyclopedia Britannica. (NINTH EDITION.) A DICTIONARY OF ARTS SCIENCES AND GENERAL LITERATURE. Vol. 1 (9 ed.). H.G. Allen (published 1833). 1888 – via Google Books. Until the invention of the Jacquard attachment to the loom in the year 1801, embroidered silk goods were called brocades.\n^ a b Rojas, Raul (13 May 2024). \"The First Computer Program\". acm.org. ACM.\n^ a b c Christopher Hollings; Ursula Martin; Adrian Rice (26 July 2018). \"Ada Lovelace and the Analytical Engine\". bodleian.ox.ac.uk. University of Oxford.\n^ Amy Ackerberg-Hastings; Hardy Grant. \"CMS Notes\". math.ca. Canadian Mathematical Society.\n^ Anna Siffert. \"Ada Lovelace and the first computer programme in the world\". mpg.de. Max-Planck-Gesellschaft.(ed.: erratum/corrigendum: \"1848\")\n^ Shapiro, Alan N. (2024). \"Introduction\". Decoding Digital Culture with Science Fiction Hyper-Modernism, Hyperreality, and Posthumanism. transcript Verlag. p. 20. ISBN 9783839472422. logic that enabled the invention of the digital-binary computer by Alan Turing\" - \"began with Gottlob Frege's Begriffsschrift\n^ Zuse, Konrad (28 September 1993). \"Chapter 6\". In Wössner, Hans (ed.). Der Computer – Mein Lebenswerk [The Computer - My Life]. Translated by McKenna, Patricia; Ross, J Andrew. Berlin Heidelberg: Springer Science & Business Media. p. 101. ISBN 3540564535 – via Google Books. The work on the Plankalkül was completed in the years 1945/46 and I had no opportunity whatsoever to publish.\n^ \"ARC - Assembler for Booth\". hopl.info. Retrieved 11 October 2022.\n^ UNIVAC conference, Charles Babbage Institute, University of Minnesota.  171-page transcript of oral history with computer pioneers, including Albert B. Tonik, involved with the Univac computer, held on 17–18 May 1990.\n^ \"Der Freiburger Code auf der Zuse\" (in German). Retrieved 26 October 2014.\n^ H. Zuse. \"Z22\". Retrieved 26 October 2014.\n^ Łukaszewicz, Leon (1 January 1961). \"SAKO—An automatic coding system\". Annual Review in Automatic Programming. 2: 161–176. doi:10.1016/S0066-4138(61)80008-6. ISSN 0066-4138.\n^ Smillie, Keith. \"Kenneth E. Iverson – A.M. Turing Award Winner\". ACM.\n^ \"Ken Thompson interviewed by Brian Kernighan at VCF East 2019\". YouTube. 6 May 2019.\n^ \"Tour : Standard C++\". isocpp.org.\n^ Stroustrup, Bjarne (7 March 2010). \"Bjarne Stroustrup's FAQ: When was C++ invented?\". stroustrup.com. Archived from the original on 6 February 2016. Retrieved 15 February 2023.\n^ \"Arduino Reference\". www.arduino.cc.\n^ \"Why We Created Julia\". Julia website. February 2012. Retrieved 7 February 2013.\n^ \"Introduction\". The Julia Manual. Archived from the original on 8 April 2016.\n^ Simple, fast & type safe code that leverages the JavaScript & OCaml ecosystems: facebook/reason, Facebook, 24 March 2019, retrieved 24 March 2019\n^ The AssemblyScript Project (24 April 2020). \"AssemblyScript Working Group\". GitHub.com. AssemblyScript Project. Retrieved 10 February 2021. Daniel Wirtz (@dcodeIO) - Author of AssemblyScript\n^ \"The Ballerina Programming Language\". GitHub. 25 November 2019.\nOnline Historical Encyclopaedia of Programming Languages\nDiagram & history of programming languages\nEric Levenez's timeline diagram of computer languages history\nBASIC\nVisual Basic\nclassic\n.NET\nVisual Basic\nclassic\n.NET\nML\nCaml\nOCaml\nStandard ML\nPascal\nObject Pascal\nLists: Alphabetical\nNon-English-based\nWomen in computing\nArtificial intelligence\nMachine learning\nQuantum computing and communication\nFree and open-source software\nHypertext technology\nOperating systems\nDOS family\nWindows\nLinux\nProgramming languages\nVirtualization development\nInternet conflicts\nWeb search engines\nKathleen Antonelli\nJohn Vincent Atanasoff\nEdsger W. Dijkstra\nJ. Presper Eckert\nDouglas Engelbart\nMargaret Hamilton\nDavid A. Huffman\nJohn von Neumann\nKlára Dán von Neumann\nGuido van Rossum\nBjarne Stroustrup",
  "List_of_software_bugs": "Many software bugs are merely annoying or inconvenient, but some can have extremely serious consequences—either financially or as a threat to human well-being.[1] The following is a list of software bugs with significant consequences.\nThe software of the A2LL system for handling unemployment and social services in Germany presented several errors with large-scale consequences, such as sending the payments to invalid account numbers in 2004.[citation needed]\nThe DAO bug. On June 17, 2016, the DAO was subjected to an attack exploiting a combination of vulnerabilities, including the one concerning recursive calls, that resulted in the transfer of 3.6 million Ether – around a third of the 11.5 million Ether that had been committed to The DAO – valued at the time at around $50M.[2][3]\nElectric power transmission\nThe Northeast blackout of 2003 was triggered by a local outage that went undetected due to a race condition in General Electric Energy's XA/21 monitoring software.[4]\nSee also Category:Computer security exploits\nIn order to fix a warning issued by Valgrind, a maintainer of Debian patched OpenSSL and broke the random number generator in the process. The patch was uploaded in September 2006 and made its way into the official release; it was not reported until April 2008. Every key generated with the broken version is compromised (as the \"random\" numbers were made easily predictable), as is all data encrypted with it, threatening many applications that rely on encryption such as S/MIME, Tor, SSL or TLS protected connections and SSH.[5]\nHeartbleed, an OpenSSL vulnerability introduced in 2012 and disclosed in April 2014, removed confidentiality from affected services, causing among other things the shutdown of the Canada Revenue Agency's public access to the online filing portion of its website[6] following the theft of social insurance numbers.[7]\nThe Apple \"goto fail\" bug was a duplicated line of code which caused a public key certificate check to pass a test incorrectly.\nThe GnuTLS \"goto fail\" bug was similar to the Apple bug and found about two weeks later. The GnuTLS bug also allowed attackers to bypass SSL/TLS security. [8]\nThe Vancouver Stock Exchange index had large errors due to repeated rounding. In January 1982 the index was initialized at 1000 and subsequently updated and truncated to three decimal places on each trade. This was done about 3000 times a day. The accumulated truncations led to an erroneous loss of around 25 points per month. Over the weekend of November 25–28, 1983, the error was corrected, raising the value of the index from its Friday closing figure of 524.811 to 1098.892.[9][10]\nKnight Capital Group lost $440 million in 45 minutes on August 1, 2012 due to the improper deployment of software on servers and the re-use of a critical software flag that caused old unused software code to execute during trading.[11]\nThe British Post Office scandal; between 2000 and 2015, 736 subpostmasters were prosecuted by the UK Post Office, with many falsely convicted and sent to prison. The subpostmasters were blamed for financial shortfalls which actually were caused by software defects in the Post Office's Horizon accounting software.[12]\nIn the Sony BMG copy protection rootkit scandal (October 2005), Sony BMG produced a Van Zant music CD that employed a copy protection scheme that covertly installed a rootkit on any Windows PC that was used to play it.  Their intent was to hide the copy protection mechanism to make it harder to circumvent.  Unfortunately, the rootkit inadvertently opened a security hole resulting in a wave of successful trojan horse attacks on the computers of those who had innocently played the CD.[13] Sony's subsequent efforts to provide a utility to fix the problem actually exacerbated it.[14]\nA bug in the code controlling the Therac-25 radiation therapy machine was directly responsible for at least five patient deaths in the 1980s when it administered excessive quantities of beta radiation.[15][16][17]\nRadiation therapy planning software RTP/2 created by Multidata Systems International could incorrectly double the dosage of radiation depending on how the technician entered data into the machine. At least eight patients died, while another 20 received overdoses likely to cause significant health problems (November 2000).[18]\nA Medtronic heart device was found vulnerable to remote attacks (2008-03).[19]\nThe Becton Dickinson Alaris Gateway Workstation allows unauthorized arbitrary remote execution (2019).[20][21]\nThe CareFusion Alaris pump module (8100) will not properly delay an Infusion when the \"Delay Until\" option or \"Multidose\" feature is used (2015).[22]\nThe software error of a MIM-104 Patriot caused its system clock to drift by one third of a second over a period of one hundred hours – resulting in failure to locate and intercept an incoming Iraqi Al Hussein missile, which then struck Dharan barracks, Saudi Arabia (February 25, 1991), killing 28 Americans.[23][24]\nA Royal Air Force Chinook helicopter crashed into the Mull of Kintyre in June 1994, killing 29. Initially, the crash was dismissed as pilot error, but an investigation by Computer Weekly uncovered sufficient evidence to convince a House of Lords inquiry that it may have been caused by a software bug in the aircraft's engine control computer.[25]\nSmart ship USS Yorktown was left dead in the water in September 1997 for nearly 3 hours after a divide by zero error.[26]\nIn April 1992 the first Lockheed YF-22 crashed while landing at Edwards Air Force Base, California. The cause of the crash was found to be a flight control software error that failed to prevent a pilot-induced oscillation.[27]\nWhile attempting its first overseas deployment to the Kadena Air Base in Okinawa, Japan, on 11 February 2007, a group of six F-22 Raptors flying from Hickam AFB, Hawaii, experienced multiple computer crashes coincident with their crossing of the 180th meridian of longitude (the International Date Line). The computer failures included at least navigation (completely lost) and communication. The fighters were able to return to Hawaii by following their tankers, something that might have been problematic had the weather not been good. The error was fixed within 48 hours, allowing a delayed deployment.[28]\nNASA's 1965 Gemini 5 mission landed 80 miles (130 km) short of its intended splashdown point when the pilot compensated manually for an incorrect constant for the Earth's rotation rate. A 360-degree rotation corresponding to the Earth's rotation relative to the fixed stars was used instead of the 360.98-degree rotation in a 24-hour solar day. The shorter length of the first three missions and a computer failure on Gemini 4 prevented the bug from being detected earlier.[29]\nThe Russian Space Research Institute's Phobos 1 (Phobos program) deactivated its attitude thrusters and could no longer properly orient its solar arrays or communicate with Earth, eventually depleting its batteries. (September 10, 1988).[30]\nThe European Space Agency's Ariane flight V88 was destroyed 40 seconds after takeoff (June 4, 1996). The first flight of the Ariane V rocket self-destructed due to an overflow occurring during a floating-point to integer conversion in the on-board guidance software. The same software had been used successfully in the Ariane IV program, but the Ariane V produced larger values for at least one variable, causing the overflow.[31][32]\nIn 1997, the Mars Pathfinder mission was jeopardised by a bug in concurrent software shortly after the rover landed, which was found in preflight testing but given a low priority as it only occurred in certain unanticipated heavy-load conditions.[33] The problem, which was identified and corrected from Earth, was due to computer resets caused by priority inversion.[34]\nIn 2000, a Zenit 3SL launch failed due to faulty ground software not closing a valve in the rocket's second stage pneumatic system.[35]\nThe European Space Agency's CryoSat-1 satellite was lost in a launch failure in 2005 due to a missing shutdown command in the flight control system of its Rokot carrier rocket.[36]\nNASA Mars Polar Lander was destroyed because its flight software mistook vibrations caused by the deployment of the stowed legs for evidence that the vehicle had landed and shut off the engines 40 meters from the Martian surface (December 3, 1999).[37]\nIts sister spacecraft Mars Climate Orbiter was also destroyed, due to software on the ground generating commands based on parameters in pound-force (lbf) rather than newtons (N).\nA mis-sent command from Earth caused the software of the NASA Mars Global Surveyor to incorrectly assume that a motor had failed, causing it to point one of its batteries at the sun. This caused the battery to overheat (November 2, 2006).[38][39]\nNASA's Spirit rover became unresponsive on January 21, 2004, a few weeks after landing on Mars. Engineers found that too many files had accumulated in the rover's flash memory. It was restored to working condition after deleting unnecessary files.[40]\nJapan's Hitomi astronomical satellite was destroyed on March 26, 2016, when a thruster fired in the wrong direction, causing the spacecraft to spin faster instead of stabilize.[41]\nESA/Roscosmos Schiaparelli Mars lander impacted surface of Mars.  Unanticipated spin during descent briefly saturated the IMU, software then misinterpreted the data as showing the lander was underground, so prematurely ejected parachute and shut down engines, resulting in crash.[42]\nIsrael's first attempt to land an uncrewed spacecraft on the Moon with the Beresheet was rendered unsuccessful on April 11, 2019, due to a software bug with its engine system, which prevented it from slowing down during its final descent on the Moon's surface.  Engineers attempted to correct this bug by remotely rebooting the engine, but by the time they regained control of it, Beresheet could not slow down in time to avert a hard, crash landing that disintegrated it.[43]\nTelecommunications\nAT&T long-distance network crash (January 15, 1990), in which the failure of one switching system would cause a message to be sent to nearby switching units to tell them that there was a problem.  Unfortunately, the arrival of that message would cause those other systems to fail too – resulting in a cascading failure that rapidly spread across the entire AT&T long-distance network.[44][45]\nIn January 2009, Google's search engine erroneously notified users that every web site worldwide was potentially malicious, including its own.[46]\nIn May 2015, iPhone users discovered a bug where sending a certain sequence of characters and Unicode symbols as a text to another iPhone user would crash the receiving iPhone's SpringBoard interface,[47] and may also crash the entire phone, induce a factory reset, or disrupt the device's connectivity to a significant degree,[48] preventing it from functioning normally. The bug persisted for weeks, gained substantial notoriety and saw a number of individuals using the bug to play pranks on other iOS users,[citation needed] before Apple eventually patched it on June 30, 2015, with iOS 8.4.\nOn May 31st, 2020, the user @UniverseIce on Twitter reported a wallpaper[49] that caused select Android phones to go into a bootloop that rendered the phones unusable.[50] This was caused by an oversight in Android's SystemUI and how it handled converting images used for the wallpaper from ProPhoto RGB to sRGB[51] leading to the system trying and display a pixel with a invalid color value.[52][53]\nThe year 2000 problem spawned fears of worldwide economic collapse and an industry of consultants providing last-minute fixes.[54]\nA similar problem will occur in 2038 (the year 2038 problem), as many Unix-like systems calculate the time in seconds since 1 January 1970, and store this number as a 32-bit signed integer, for which the maximum possible value is 231 − 1 (2,147,483,647) seconds.[55] 2,147,483,647 seconds equals 68 years, and 2038 is 68 years forward from 1970.\nAn error in the payment terminal code for Bank of Queensland rendered many devices inoperable for up to a week. The problem was determined to be an incorrect hexadecimal number conversion routine. When the device was to tick over to 2010, it skipped six years to 2016, causing terminals to decline customers' cards as expired.[56]\nBy some accounts Toyota's electronic throttle control system (ETCS) had bugs that could cause sudden unintended acceleration.[57]\nThe Boeing 787 Dreamliner experienced an integer overflow bug which could shut down all electrical generators if the aircraft were to be kept \"on\" for more than 248 days.[58] A similar problem was found to exist in the Airbus A350, which needs to be powered down before reaching 149 continuous hours of power-on time, otherwise certain avionics systems or functions would partially or completely fail.[59]\nIn early 2019, the transportation-rental firm Lime discovered a firmware bug with its electric scooters that can cause them to brake very hard unexpectedly, which may hurl and injure riders.[60]\nBoeing 737 NG had all cockpit displays go blank if a specific type of instrument approach to any one of seven specific airports was selected in the flight management computer.[61]\nBombardier CRJ-200 equipped with flight management systems by Collins Aerospace would make wrong turns during missed approach procedures executed by the autopilot in some specific cases when temperature compensation was activated in cold weather.[62]\nEve Online's deployment of the Trinity patch erased the boot.ini file from several thousand users' computers, rendering them unable to boot. This was due to the usage of a legacy system within the game that was also named boot.ini. As such, the deletion had targeted the wrong directory instead of the /eve directory.[63]\nThe Corrupted Blood incident was a software bug in World of Warcraft that caused a deadly, debuff-inducing virtual disease that could only be contracted during a particular raid to be set free into the rest of the game world, leading to numerous, repeated deaths of many player characters. This caused players to avoid crowded places in-game, just like in a \"real world\" epidemic, and the bug became the center of some academic research on the spread of infectious diseases.[64]\nOn June 6, 2006, the online game RuneScape suffered from a bug that enabled certain player characters to kill and loot other characters, who were unable to fight back against the affected characters because the game still thought they were in player-versus-player mode even after they were kicked out of a combat ring from the house of a player who was suffering from lag while celebrating an in-game accomplishment.  Players who were killed by the glitched characters lost many items, and the bug was so devastating that the players who were abusing it were soon tracked down, caught and banned permanently from the game, but not before they had laid waste to the region of Falador, thus christening the bug \"Falador Massacre\".[65]\nIn the 256th level of Pac-Man, a bug results in a kill screen. The maximum number of fruit available is seven and when that number rolls over, it causes the entire right side of the screen to become a jumbled mess of symbols while the left side remains normal.[66]\nUpon initial release, the ZX Spectrum game Jet Set Willy was impossible to complete because of a severe bug that corrupted the game data, causing enemies and the player character to be killed in certain rooms of the large mansion where the entire game takes place.[67]  The bug, known as \"The Attic Bug\", would occur when the player entered the mansion's attic, which would then cause an arrow to travel offscreen, overwriting the contents of memory and altering crucial variables and behavior in an undesirable way.  The game's developers initially excused this bug by claiming that the affected rooms were death traps, but ultimately owned up to it and issued instructions to players on how to fix the game itself.[68]\nOne of the free demo discs issued to PlayStation Underground subscribers in the United States contained a serious bug, particularly in the demo for Viewtiful Joe 2, that would not only crash the PlayStation 2, but would also unformat any memory cards that were plugged into that console, erasing any and all saved data onto them.[69] The bug was so severe that Sony had to apologize for it and send out free copies of other PS2 games to affected players as consolation.[70]\nDue to a severe programming error, much of the Nintendo DS game Bubble Bobble Revolution is unplayable because a mandatory boss fight failed to trigger in the 30th level.[71]\nAn update for the Xbox 360 version of Guitar Hero II, which was intended to fix some issues with the whammy bar on that game's guitar controllers, came with a bug that caused some consoles to freeze, or even stop working altogether, producing the infamous \"red ring of death\".[72]\nValve's Steam client for Linux could accidentally delete all the user's files in every directory on the computer. This happened to users that had moved Steam's installation directory.[73] The bug is the result of unsafe shellscript programming: STEAMROOT=\"$(cd \"${0%/*}\" && echo $PWD)\"\n\n# Scary!\nrm -rf \"$STEAMROOT/\"*\n The first line tries to find the script's containing directory. This could fail, for example if the directory was moved while the script was running, invalidating the \"selfpath\" variable $0. It would also fail if $0 contained no slash character, or contained a broken symlink, perhaps mistyped by the user. The way it would fail, as ensured by the && conditional, and not having set -e cause termination on failure, was to produce the empty string. This failure mode was not checked, only commented as \"Scary!\". Finally, in the deletion command, the slash character takes on a very different meaning from its role of path concatenation operator when the string before it is empty, as it then names the root directory.\nMinus World is an infamous glitch level from the 1985 game Super Mario Bros., accessed by using a bug to clip through walls in level 1–2 to reach its \"warp zone\", which leads to the said level.[74]  As this level is endless, triggering the bug that takes the player there will make the game impossible to continue until the player resets the game or runs out of lives.\n\"MissingNo.\" is a glitch Pokémon species present in Pokémon Red and Blue, which can be encountered by performing a particular sequence of seemingly unrelated actions.  Capturing this Pokémon may corrupt the game's data, according to Nintendo[75][76][77] and some of the players who successfully attempted this glitch.  This is one of the most famous bugs in video game history, and continues to be well-known.[78]\nLondon Ambulance Service § Innovation\n^ \"Why Software fails\". IEEE Spectrum: Technology, Engineering, and Science News. 2 September 2005. Retrieved 2021-03-20.\n^ Popper, Nathaniel (17 June 2016). \"Hacker May Have Taken $50 Million From Cybercurrency Project\". The New York Times. Archived from the original on 20 June 2017. Retrieved 3 March 2017.\n^ Price, Rob (17 June 2016). \"Digital currency Ethereum is cratering amid claims of a $50 million hack\". Business Insider. Archived from the original on 11 June 2017. Retrieved 17 June 2016.\n^ \"Software Bug Contributed to Blackout\". Archived from the original on 2004-03-13. Retrieved 2008-01-07.\n^ \"DSA-1571-1 openssl -- predictable random number generator\". Retrieved 2008-04-16.\n^ \"Heartbleed bug may shut Revenue Canada website until weekend\". CBC News. 2014-04-09.\n^ \"Heartbleed bug: 900 SINs stolen from Revenue Canada - Business - CBC News\". CBC News. Retrieved 2014-04-14.\n^ Goodin, Dan (March 4, 2014). \"Critical crypto bug leaves Linux, hundreds of apps open to eavesdropping\". Ars Technica. Retrieved September 7, 2020.\n^ Quinn, Kevin (November 8, 1983). \"Ever Had Problems Rounding Off Figures? This Stock Exchange Has\". The Wall Street Journal. p. 37.\n^ Wayne, Lilley (November 29, 1983). \"Vancouver stock index has right number at last\". The Toronto Star.\n^ Popper, Nathaniel (2 August 2012). \"Knight Capital Says Trading Glitch Cost It $440 Million\". New York Times.\n^ Flinders, Karl (3 March 2022). \"Post Office warned of software flaw in 2006, but failed to alert subpostmaster network\". Computer Weekly.\n^ Borland, John (11 November 2005). \"FAQ: Sony's 'rootkit' CDs - CNET News\". news.com. Archived from the original on 5 December 2008.\n^ Russinovich, Mark (4 Nov 2005). \"Mark's Blog : More on Sony: Dangerous Decloaking Patch, EULAs and Phoning Home\". blogs.technet.com. Archived from the original on 3 January 2007.\n^ \"The Therac-25 Accidents (PDF), by Nancy Leveson\" (PDF). Retrieved 2008-01-07.\n^ \"An Investigation of the Therac-25 Accidents (IEEE Computer)\". Retrieved 2008-01-07.\n^ \"Computerized Radiation Therapy (PDF) reported by TROY GALLAGHER\" (PDF). Retrieved 2011-12-12.\n^ Garfinkel, Simson (November 8, 2005). \"History's Worst Software Bugs\". Wired. Retrieved September 6, 2020.\n^ Feder, Barnaby J. (2008-03-12). \"A Heart Device Is Found Vulnerable to Hacker Attacks\". The New York Times. Retrieved 2008-09-28.\n^ \"ICS Advisory (ICSMA-19-164-01)\" (Press release). Cybersecurity and Infrastructure Security Agency. 2019-06-13. Retrieved 2019-11-15.\n^ Newman, Lily Hay (2019-10-01). \"Decades-Old Code Is Putting Millions of Critical Devices at Risk\". Wired. Retrieved 2019-11-15.\n^ \"Urgent: Medical Device Recall Notification, AFFECTED DEVICE: Alaris® Pump module (Model 8100)\"Delay Until\" Option and \"Multidose\" Feature\" (PDF) (Press release). CareFusion. 2014-04-23. Archived from the original (PDF) on 2015-06-12. Retrieved 2019-11-15.\n^ \"Patriot missile defense, Software problem led to system failure at Dharhan, Saudi Arabia; GAO report IMTEC 92-26\". US Government Accounting Office.\n^ Skeel, Robert. \"Roundoff Error and the Patriot Missile\". SIAM News, volume 25, nr 4. Archived from the original on 2008-08-01. Retrieved 2008-09-30.\n^ Rogerson, Simon (April 2002). \"The Chinook Helicopter Disaster\". IMIS Journal. 12 (2). Archived from the original on 2012-07-17.\n^ \"Software glitches leave Navy Smart Ship dead in the water\". gcn.com. 13 Jul 1998. Archived from the original on 8 February 2006.\n^ \"F/A-22 Program History\". f-22raptor.com. Archived from the original on 25 August 2009.\n^ \"Lockheed's F-22 Raptor Gets Zapped by International Date Line\". DailyTech. 26 Feb 2007. Archived from the original on 16 March 2007.\n^ \"Gemini 5\". On The Shoulders of Titans: A History of Project Gemini. Archived from the original on 2019-07-14. Retrieved 2019-08-20.\n^ Sagdeev, R. Z.; Zakharov, A. V. (1989). \"Brief history of the Phobos mission\". Nature. 341 (6243): 581–585. Bibcode:1989Natur.341..581S. doi:10.1038/341581a0. S2CID 41464654.\n^ Dowson, M. (March 1997). \"The Ariane 5 Software Failure\". ACM SIGSOFT Software Engineering Notes. 22 (2): 84. doi:10.1145/251880.251992. S2CID 43439273.\n^ Jézéquel JM, Meyer B (January 1997). \"Design by Contract: The Lessons of Ariane\" (PDF). IEEE Computer. 30 (1): 129–130. doi:10.1109/2.562936.\n^ Heaven, Douglas (2013). \"Parallel sparking: Many chips make light work\". New Scientist. 219 (2930). Elsevier BV: 42–45. doi:10.1016/s0262-4079(13)62046-1. ISSN 0262-4079.\n^ Reeves, Glenn E (15 Dec 1997). \"What really happened on Mars? -- Authoritative Account\". research.microsoft.com. Archived from the original on 30 December 2016.\n^ \"Spaceflight Now | Breaking News | Sea Launch malfunction blamed on software glitch\". spaceflightnow.com. Retrieved January 2, 2022.\n^ \"CryoSat Mission lost due to launch failure\". European Space Agency. 8 October 2005. Retrieved 19 July 2010.\n^ \"Mars Polar Lander\". Archived from the original on 2012-09-27. Retrieved 2008-01-07.\n^ \"Report Reveals Likely Causes of Mars Spacecraft Loss\". Archived from the original on 2007-11-09. Retrieved 2008-01-07.\n^ \"Faulty Software May Have Doomed Mars Orbiter\". Space.com. Archived from the original on July 24, 2008. Retrieved January 11, 2007.\n^ \"Out of memory problem caused Mars rover's glitch\". computerworld.com. February 3, 2004.\n^ Witze, Alexandra (2016). \"Software error doomed Japanese Hitomi spacecraft\". Nature. 533 (7601): 18–19. Bibcode:2016Natur.533...18W. doi:10.1038/nature.2016.19835. PMID 27147012. S2CID 4451754.\n^ Tolker-Nielsen, Toni, ed. (18 May 2017). ExoMars 2016 – Schiaparelli Anomaly Inquiry (Report). European Space Agency. pp. 18–19. DG-I/2017/546/TTN.\n^ Weitering, Hanneke (12 April 2019). \"Israeli Moon Lander Suffered Engine Glitch Before Crash\". Space.com. Retrieved 29 May 2019.\n^ Sterling, Bruce (1993). The Hacker Crackdown: Law and Disorder on the Electronic Frontier. Spectra Books. ISBN 0-553-56370-X.\n^ \"The Crash of the AT&T Network in 1990\". Retrieved 2024-02-26.\n^ Metz, Cade (January 31, 2009). \"Google mistakes entire web for malware\". The Register. Retrieved December 20, 2010.\n^ \"Bug in iOS Unicode handling crashes iPhones with a simple text\". Apple Insider. 26 May 2015. Retrieved 29 May 2015.\n^ Clover, Juli (26 May 2015). \"New iOS Bug Crashing iPhones Simply by Receiving a Text Message\". MacRumors. Retrieved 29 May 2015.\n^ \"Sunset At St Mary Lake Glacier National Park 5k Wallpaper,HD Nature Wallpapers,4k Wallpapers,Images,Backgrounds,Photos and Pictures\". hdqwalls. Retrieved 2025-09-22.\n^ X (Formerly Twitter), 2025, x.com/UniverseIce/status/1266943909499826176?lang=en. Accessed 22 Sept. 2025.\n^ Schoon, Ben. “[Update: Photographer Speaks Out] Some Android Phones Can Be Bricked Using This Wallpaper.” 9to5Google, 10 June 2020, 9to5google.com/2020/06/10/android-phone-wallpaper-soft-brick-bug-video/. Accessed 22 Sept. 2025.\n^ \"Google Issue Tracker\". issuetracker.google.com. Retrieved 2025-09-22.\n^ Mehrotra, Pranob (2020-08-03). \"[Update 2: Fixed] This wallpaper triggers a rare bug causing Android devices to bootloop\". XDA. Retrieved 2025-09-22.\n^ \"Looking at the Y2K bug, portal on CNN.com\". Archived from the original on 2007-12-27. Retrieved 2008-01-07.\n^ \"The year 2038 bug\". Retrieved 2008-01-12.\n^ Stafford, Patrick. \"Businesses hit by Bank of Queensland EFTPOS bug\". Archived from the original on 7 April 2014. Retrieved 1 April 2014.\n^ Dunn, Michael (28 Oct 2013). \"Toyota's killer firmware: Bad design and its consequences\". EDN.\n^ \"To keep a Boeing Dreamliner flying, reboot once every 248 days\". Engadget. 1 Apr 2015.\n^ Corfield, Gareth (25 Jul 2019). \"Airbus A350 software bug forces airlines to turn planes off and on every 149 hours\". The Register. Retrieved 2021-02-04.\n^ Roy, Eleanor Ainge (21 February 2019). \"Auckland threatens to eject Lime scooters after wheels lock at high speed\". The Guardian. Retrieved 2019-02-20.\n^ Corfield, Gareth (8 Jan 2020). \"Blackout Bug: Boeing 737 cockpit screens go blank if pilots land on specific runways\". The Register. Retrieved 2021-02-04.\n^ Corfield, Gareth (29 May 2020). \"Software bug in Bombardier airliner made planes turn the wrong way\". The Register. Retrieved 2021-02-04.\n^ \"About the boot.ini issue (Dev Blog)\". 11 December 2007. Retrieved 2014-09-30.\n^ Balicer, Ran (2005-10-05). \"Modeling Infectious Diseases Dissemination Through Online Role-Playing Games\". Epidemiology. 18 (2): 260–261. doi:10.1097/01.ede.0000254692.80550.60. PMID 17301707. S2CID 20959479.\n^ Bishop, Sam (8 June 2016). \"Runescape marks the anniversary of the Falador Massacre\". GameFactor. Retrieved 9 August 2018.\n^ \"Pac Man'S Split Screen Level Analyzed And Fixed\". Donhodges.Com. Retrieved 2012-09-19.\n^ Langshaw, Mark (30 September 2010). \"Retro Corner: 'Jet Set Willy' (Spectrum)\". Digital Spy. Retrieved 30 May 2018.\n^ \"Jet Set Willy Solved!\". Personal Computer Games (8): 21. July 1984. Retrieved 2014-04-19.\n^ Krotoski, Aleks (2004-11-30). \"Viewtiful Joe 2 demo deletes memory cards\". The Guardian. Retrieved 2009-11-10.\n^ Bramwell, AleksTom (2004-12-07). \"Sony to replace defective demo discs with games\". Eurogamer. Retrieved 2009-11-10.\n^ \"Bubble Bobble Revolution DS production issues confirmed *UPDATE*\". GoNintendo. 14 Oct 2006.\n^ Bramwell, Tom (2007-04-16). \"RedOctane admits to Guitar Hero II patch problem\". Eurogamer. Retrieved 2016-12-02.\n^ Paul, Ian (17 Jan 2015). \"Scary Steam for Linux bug erases all the personal files on your PC\". PCWorld.\n^ Gach, Ethan (14 November 2016). \"The NES Classic Carries Over Classic Glitches\". Kotaku Australia. Archived from the original on November 15, 2016. Retrieved 8 March 2017.\n^ Nintendo. \"Customer Service — Specific GamePak Troubleshooting\". Archived from the original on January 27, 2008. Retrieved June 7, 2009.\n^ \"Pokechat\". Nintendo Power. Vol. 120. May 1999. p. 101.\n^ Loe, Casey (1999). Pokémon Perfect Guide Includes Red-Yellow-Blue. Versus Books. p. 125. ISBN 1-930206-15-1.\n^ \"Gaming's Top 10 Easter Eggs\". IGN. IGN Entertainment. April 9, 2009. p. 2. Archived from the original on June 5, 2010. Retrieved June 7, 2009.\nForum on Risks to the Public in Computers and Related Systems",
  "Timeline_of_artificial_intelligence": "This is a timeline of artificial intelligence, also known as synthetic intelligence.\nAntiquity, Classical and Medieval eras\nTimeline of machine translation\nTimeline of machine learning\nTimeline of artificial intelligence risks in global finance\n^ Please see Mechanical calculator#Other calculating machines\n^ Please see: Pascal's calculator#Competing designs\n^ McCorduck 2004, pp. 4–5.\n^ McCorduck 2004, p. 4-5.\n^ Needham 1986, p. 53.\n^ Needham, Joseph (1991). Science and Civilization in China: Volume 2, History of Scientific Thought. Cambridge University Press. p. 53. ISBN 978-0-521-05800-1. The Liezi text describes an automaton presented to King Mu of Zhou... Yan Shi dismantled it to show it was a construction of leather, wood, glue and lacquer.\n^ Richard McKeon, ed. (1941). The Organon. Random House with Oxford University Press.\n^ Giles, Timothy (2016). \"Aristotle Writing Science: An Application of His Theory\". Journal of Technical Writing and Communication. 46: 83–104. doi:10.1177/0047281615600633. S2CID 170906960.\n^ a b c Russell & Norvig 2021, p. 6.\n^ Russell & Norvig 2021, p. 7.\n^ McCorduck 2004, p. 6\n^ a b c d e f g h i j k l m Schmidhuber 2022.\n^ Russell & Norvig 2021, p. 341.\n^ O'Connor, Kathleen Malone (1994), The alchemical creation of life (takwin) and other concepts of Genesis in medieval Islam, University of Pennsylvania, pp. 1–435, archived from the original on 5 December 2019, retrieved 10 January 2007.\n^ Hill, Donald R., ed. (1979) [9th century]. The Book of Ingenious Devices. Dortrecht, Netherlands; Boston; London: D. Reidel. ISBN 978-90277-0-833-5.\n^ Russell & Norvig 2021, p. 9.\n^ A Thirteenth Century Programmable Robot Archived 19 December 2007 at the Wayback Machine\n^ McCorduck 2004, pp. 10–12, 37; Russell & Norvig 2021, p. 6\n^ McCorduck 2004, pp. 13–14.\n^ McCorduck 2004, pp. 14–15, Buchanan 2005, p. 50\n^ Sir Francis Bacon (1620). The New Organon: Novem Organum Scientiarum.\n^ Sir Francis Bacon (2000). Francis Bacon: The New Organon (Cambridge Texts in the History of Philosophy). Cambridge University Press.\n^ Russell & Norvig 2021, p. 6\n^ McCorduck 2004, p. 42.\n^ Russell & Norvig 2021, p. 6; McCorduck 2004, p. 26\n^ Russell & Norvig 2021, p. 6; McCorduck 2004, pp. 36–40\n^ a b Russell & Norvig 2021, p. 8.\n^ McCorduck 2004, pp. 41–42.\n^ Leibniz, Gottfried Wilhelm Freiherr von (1920). The Early Mathematical Manuscripts of Leibniz: Translated from the Latin Texts Published by Carl Immanuel Gerhardt with Critical and Historical Notes (Leibniz published the chain rule in a 1676 memoir). Open court publishing Company. ISBN 9780598818461. {{cite book}}: ISBN / Date incompatibility (help)\n^ Russell & Norvig 2021, p. 6; McCorduck 2004, pp. 41–42\n^ Quoted in McCorduck 2004, p. 317\n^ Russell & Norvig 2021, p. 10.\n^ McCorduck 2004, pp. 43.\n^ McCorduck 2004, p. 17.\n^ Adrien-Marie Legendre (1805). Nouvelles méthodes pour la détermination des orbites des comètes (in French). Ghent University. F. Didot.\n^ Stigler, Stephen M. (1981). \"Gauss and the Invention of Least Squares\". Ann. Stat. 9 (3): 465–474. Bibcode:1981AnSta...945451S. doi:10.1214/aos/1176345451.\n^ \nStigler, Stephen M. (1986). The History of Statistics: The Measurement of Uncertainty before 1900. Cambridge: Harvard. ISBN 0-674-40340-1.\n^ Russell & Norvig (2021, p. 15); Razy, C. (1913), p.120.\n^ McCorduck 2004, pp. 19–25.\n^ Russell & Norvig 2021, p. 15; McCorduck 2004, pp. 26–34\n^ Cambier, Hubert (June 2016). \"The Evolutionary Meaning of World 3\". Philosophy of the Social Sciences. 46 (3): 242–264. doi:10.1177/0048393116641609. ISSN 0048-3931. S2CID 148093595.\n^ Russell & Norvig 2021, p. 8; McCorduck 2004, pp. 48–51\n^ Project Gutenberg eBook Erewhon by Samuel Butler.Poes..... Archived 30 April 2021 at the Wayback Machine\n^ Linsky & Irvine 2022, p. 2.\n^ McCorduck 2004, pp. 59–60\n^ Randell, Brian. \"From Analytical Engine to Electronic Digital Computer: The Contributions of Ludgate, Torres, and Bush\" (PDF). Archived from the original (PDF) on 21 September 2013. Retrieved 9 September 2013.\n^ McCorduck 2004, p. 25\n^ Brush, Stephen G. (1967). \"History of the Lenz-Ising Model\". Reviews of Modern Physics. 39 (4): 883–893. Bibcode:1967RvMP...39..883B. doi:10.1103/RevModPhys.39.883.\n^ Amari, Shun-Ichi (1972). \"Learning patterns and pattern sequences by self-organizing nets of threshold elements\". IEEE Transactions. C (21): 1197–1206.\n^ Church, A. (1936). \"An unsolvable problem of elementary number theory (first presented on 19 April 1935 to the American Mathematical Society)\". American Journal of Mathematics. 58 (2): 345–363. doi:10.2307/2371045. JSTOR 2371045.\n^ K. Zuse (1936). Verfahren zur selbsttätigen Durchführung von Rechnungen mit Hilfe von Rechenmaschinen. Patent application Z 23 139 / GMD Nr. 005/021, 1936.\n^ Turing, Alan Mathison (12 November 1936). \"On computable numbers, with an application to the Entscheidungsproblem\" (PDF). Proceedings of the London Mathematical Society. 58: 230–265. doi:10.1112/plms/s2-42.1.230. S2CID 73712.\n^ McCorduck 2004, pp. 61–62 and see also The Life and Work of Konrad Zuse\n^ McCorduck (2004, pp. 55–56); Russell & Norvig (2021, p. 17)\n^ Copeland, J (Ed.) (2004). The Essential Turing: the ideas that gave birth to the computer age. Oxford: Clarendon Press. ISBN 0-19-825079-7.{{cite book}}:  CS1 maint: publisher location (link)\n^ a b Russell & Norvig 2021, p. 17.\n^ Crevier (1993, pp. 22–25); Russell & Norvig (2021, pp. 18–19)\n^ Russell & Norvig 2021, p. 155.\n^ Russell & Norvig 2021, p. 1007.\n^ Samuel (1959); Russell & Norvig (2021, p. 17)\n^ a b c d e f Russell & Norvig 2021, p. 19.\n^ \nSchaeffer, Jonathan. One Jump Ahead:: Challenging Human Supremacy in Checkers, 1997, 2009, Springer, ISBN 978-0-387-76575-4. Chapter 6.\n^ \nRussell & Norvig (2021, p. 18)\n^ \nNovet, Jordan (17 June 2017). \"Everyone keeps talking about A.I.—here's what it really is and why it's so hot now\". CNBC. Archived from the original on 16 February 2018. Retrieved 16 February 2018.\n^ McCorduck 2004, pp. 123–125, Crevier 1993, pp. 44–46 and Russell & Norvig 2021, p. 18\n^ Quoted in Crevier 1993, p. 46 and Russell & Norvig 2021, p. 18\n^ \"Minds, Machines and Gödel\". Users.ox.ac.uk. Archived from the original on 19 August 2007. Retrieved 24 November 2008.\n^ Feigenbaum, Edward; Feldman, Julian, eds. (1963). Computers and thought : a collection of articles (1 ed.). New York: McGraw-Hill. OCLC 593742426.\n^ \"This week in The History of AI at AIWS.net – Edward Feigenbaum and Julian Feldman published \"Computers and Thought\"\". AIWS.net. Archived from the original on 24 April 2022. Retrieved 5 May 2022.\n^ \"Feigenbaum & Feldman Issue 'Computers and Thought,' the First Anthology on Artificial Intelligence\". History of Information. Archived from the original on 5 May 2022. Retrieved 5 May 2022.\n^ Feigenbaum, Edward A.; Feldman, Julian (1963). Computers and Thought. McGraw-Hill, Inc. ISBN 9780070203709. Archived from the original on 5 May 2022. Retrieved 5 May 2022 – via Association for Computing Machinery Digital Library. {{cite book}}: ISBN / Date incompatibility (help)\n^ Ivakhnenko, A. G. (1973). Cybernetic Predicting Devices. CCM Information Corporation.\n^ Ivakhnenko, A. G.; Grigorʹevich Lapa, Valentin (1967). Cybernetics and forecasting techniques. American Elsevier Pub. Co.\n^ \"The Machine Intelligence series\". www.cs.york.ac.uk. Archived from the original on 5 November 1999.\n^ Amari, Shun'ichi (1967). \"A theory of adaptive pattern classifier\". IEEE Transactions. EC (16): 279–307.\n^ Grosz, Barbara J.; Hajicova, Eva; Joshi, Aravind (2015). \"Jane J. Robinson\". Computational Linguistics. 41 (4): 723–726. doi:10.1162/COLI_a_00235. Retrieved 23 January 2024.\n^ Linnainmaa, Seppo (1970). Algoritmin kumulatiivinen pyöristysvirhe yksittäisten pyöristysvirheiden Taylor-kehitelmänä [The representation of the cumulative rounding error of an algorithm as a Taylor expansion of the local rounding errors] (PDF) (Thesis) (in Finnish). pp. 6–7.\n^ \"The Boyer-Moore Theorem Prover\". Archived from the original on 23 September 2015. Retrieved 15 March 2015.\n^ Stevo Bozinovski and Ante Fulgosi (1976). \"The influence of pattern similarity and transfer learning upon training of a base perceptron\" (original in Croatian) Proceedings of Symposium Informatica 3-121-5, Bled.\n^ Stevo Bozinovski (2020) \"Reminder of the first paper on transfer learning in neural networks, 1976\". Informatica 44: 291–302.\n^ Bozinovski, Stevo (1981) \"Inverted pendulum control program\" ANW Memo, Adaptive Networks Group, Computer and Information Science Department, University of Massachusetts at Amherst, December 10, 1981\n^ Bozinovski, Stevo and  Anderson, Charles (1983) \"Associative memory as controller of an unstable system: Simulation of a learning control\" Proc. IEEE Mediterranean Electrotechnical Conference, C5.11., Athens, Greece\"\n^ Bozinovski, Stevo (1995) \"Adaptive parallel distributed processing: Neural and genetic agents: Neuro-genetic agents and a structural theory of self-reinforcement learning systems\" CMPSCI Technical Report 95-107, Computer Science Department, University of Massachusetts at Amherst\n^ Grosz, Barbara; Sidner, Candace L. (1986). \"Attention, Intentions, and the Structure of Discourse\". Computational Linguistics. 12 (3): 175–204. Archived from the original on 10 September 2017. Retrieved 5 May 2017.\n^ Harry Henderson (2007). \"Chronology\". Artificial Intelligence: Mirrors for the Mind. NY: Infobase Publishing. ISBN 978-1-60413-059-1. Archived from the original on 15 March 2023. Retrieved 11 April 2015.\n^ Cook, Donald A.; Sterling, John W. (June 1989). \"EmeraldInsight\". Planning Review. 17 (6): 22–27. doi:10.1108/eb054275. Archived from the original on 2 February 2014. Retrieved 15 March 2015.\n^ Mead, Carver A.; Ismail, Mohammed (8 May 1989). Analog VLSI Implementation of Neural Systems (PDF). The Kluwer International Series in Engineering and Computer Science. Vol. 80. Norwell, MA: Kluwer Academic Publishers. doi:10.1007/978-1-4613-1639-8. ISBN 978-1-4613-1639-8. Archived (PDF) from the original on 6 November 2019. Retrieved 24 January 2020.\n^ DART: Revolutionizing Logistics Planning\n^ Stoker, Carol R. (1995). Wolfe, William J.; Chun, Wendell H. (eds.). \"From Antarctica to space: use of telepresence and virtual reality in control of a remote underwater vehicle\". Mobile Robots IX. 2352: 288. Bibcode:1995SPIE.2352..288S. doi:10.1117/12.198976. S2CID 128633069. Archived from the original on 17 July 2019. Retrieved 17 July 2019.\n^ \"ISX Corporation\". Archived from the original on 5 September 2006. Retrieved 15 March 2015.\n^ \"DART overview\". Archived from the original on 30 November 2006. Retrieved 24 July 2007.\n^ Zadeh, Lotfi A., \"Fuzzy Logic, Neural Networks, and Soft Computing,\"  Communications of the ACM, March 1994, Vol. 37 No. 3, pages 77-84.\n^ \"AAAI-first-ai-env-workshop.HTML\". Archived from the original on 28 July 2019. Retrieved 28 July 2019.\n^ \"Ijcai-first-ai-env-workshop\". Archived from the original on 28 July 2019. Retrieved 28 July 2019.\n^ Jochem, Todd M.; Pomerleau, Dean A. \"No Hands Across America Home Page\". Archived from the original on 27 September 2019. Retrieved 20 October 2015.\n^ Jochem, Todd. \"Back to the Future: Autonomous Driving in 1995\". Robotic Trends. Archived from the original on 29 December 2017. Retrieved 20 October 2015.\n^ Hochreiter, Sepp; Schmidhuber, Jürgen (1 November 1997). \"Long Short-Term Memory\". Neural Computation. 9 (8): 1735–1780. doi:10.1162/neco.1997.9.8.1735. ISSN 0899-7667. PMID 9377276. S2CID 1915014.\n^ \"Semantic Web roadmap\". W3.org. Archived from the original on 6 December 2003. Retrieved 24 November 2008.\n^ Mason, Cindy; Sànchez-Marrè, Miquel (1999). \"Binding Environmental Sciences and Artificial Intelligence\". Environmental Modelling & Software. 14 (5): 335–337. Archived from the original on 15 March 2023. Retrieved 27 October 2021.\n^ \"BESAI - Homepage\". Archived from the original on 4 July 2019. Retrieved 12 August 2019.\n^ Kaelbling, Leslie Pack; Littman, Michael L; Cassandra, Anthony R. (1998). \"Planning and acting in partially observable stochastic domains\" (PDF). Artificial Intelligence. 101 (1–2): 99–134. doi:10.1016/s0004-3702(98)00023-x. Archived (PDF) from the original on 17 May 2017. Retrieved 5 May 2017.\n^ \"Bluebrain – EPFL\". bluebrain.epfl.ch. Archived from the original on 19 March 2019. Retrieved 2 January 2009.\n^ \"Modelling natural action selection\". Pubs.royalsoc.ac.uk. Archived from the original on 30 September 2007. Retrieved 24 November 2008.\n^ \"Giving Robots Compassion, C. Mason, Conference on Science and Compassion, Poster Session, Telluride, Colorado, 2012\". ResearchGate. Retrieved 17 July 2019.\n^ Graves, Alex; Fernández, Santiago; Gomez, Faustino; Schmidhuber, Juergen (2006). \"Connectionist temporal classification: Labelling unsegmented sequence data with recurrent neural networks\". Proceedings of the International Conference on Machine Learning, ICML 2006: 369–376. CiteSeerX 10.1.1.75.6306.\n^ Graves, Alex; and Schmidhuber, Jürgen; Offline Handwriting Recognition with Multidimensional Recurrent Neural Networks, in Bengio, Yoshua; Schuurmans, Dale; Lafferty, John; Williams, Chris K. I.; and Culotta, Aron (eds.), Advances in Neural Information Processing Systems 22 (NIPS'22), December 7th–10th, 2009, Vancouver, BC, Neural Information Processing Systems (NIPS) Foundation, 2009, pp. 545–552\n^ Fisher, Adam (18 September 2013). \"Inside Google's Quest To Popularize Self-Driving Cars\". Popular Science. Archived from the original on 22 September 2013. Retrieved 10 October 2013.\n^ \"Jamie Shotton at Microsoft Research\". Microsoft Research. Archived from the original on 3 February 2016. Retrieved 3 February 2016.\n^ \"Human Pose Estimation for Kinect – Microsoft Research\". Archived from the original on 3 February 2016. Retrieved 3 February 2016.\n^ \"AAAI Spring Symposium - AI and Design for Sustainability\". Archived from the original on 29 July 2019. Retrieved 29 July 2019.\n^ Christian (2020, p. 24); Russell & Norvig (2021, p. 26)\n^ Christian 2020, p. 25.\n^ \"DARPA Robotics Challenge Trials\". US Defense Advanced Research Projects Agency. Archived from the original on 11 June 2015. Retrieved 25 December 2013.\n^ \"Carnegie Mellon Computer Searches Web 24/7 To Analyze Images and Teach Itself Common Sense\". Archived from the original on 3 July 2015. Retrieved 15 June 2015.\n^ Srivastava, Rupesh Kumar; Greff, Klaus; Schmidhuber, Jürgen (2 May 2015). \"Highway Networks\". arXiv:1505.00387 [cs.LG].\n^ He, Kaiming; Zhang, Xiangyu; Ren, Shaoqing; Sun, Jian (2016). \"Deep Residual Learning for Image Recognition\". 2016 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). IEEE. pp. 770–778. arXiv:1512.03385. doi:10.1109/CVPR.2016.90. ISBN 978-1-4673-8851-1.\n^ Sparkes, Matthew (13 January 2015). \"Top scientists call for caution over artificial intelligence\". The Telegraph (UK). Retrieved 24 April 2015.\n^ \"Research Priorities for Robust and Beneficial Artificial Intelligence: An Open Letter\". Future of Life Institute. Retrieved 14 September 2023.\n^ Tegmark, Max. \"Open Letter on Autonomous Weapons\". Future of Life Institute. Archived from the original on 28 April 2016. Retrieved 25 April 2016.\n^ a b c d Silver, David; Schrittwieser, Julian; Simonyan, Karen; Antonoglou, Ioannis; Huang, Aja; Guez, Arthur; Hubert, Thomas; Baker, Lucas; Lai, Matthew; Bolton, Adrian; Chen, Yutian; Lillicrap, Timothy; Fan, Hui; Sifre, Laurent; Driessche, George van den; Graepel, Thore; Hassabis, Demis (19 October 2017). \"Mastering the game of Go without human knowledge\" (PDF). Nature. 550 (7676): 354–359. Bibcode:2017Natur.550..354S. doi:10.1038/nature24270. ISSN 0028-0836. PMID 29052630. S2CID 205261034. Archived (PDF) from the original on 24 November 2020. Retrieved 27 September 2020.\n^ Hassabis, Demis (27 January 2016). \"AlphaGo: using machine learning to master the ancient game of Go\". Google Blog. Archived from the original on 7 May 2016. Retrieved 25 April 2016.\n^ Ormerod, David. \"AlphaGo defeats Lee Sedol 4–1 in Google DeepMind Challenge Match\". Go Game Guru. Archived from the original on 17 March 2016. Retrieved 25 April 2016.\n^ Moravčík, Matej; Schmid, Martin; Burch, Neil; Lisý, Viliam; Morrill, Dustin; Bard, Nolan; Davis, Trevor; Waugh, Kevin; Johanson, Michael; Bowling, Michael (5 May 2017). \"DeepStack: Expert-level artificial intelligence in heads-up no-limit poker\". Science. 356 (6337): 508–513. arXiv:1701.01724. Bibcode:2017Sci...356..508M. doi:10.1126/science.aam6960. ISSN 0036-8075. PMID 28254783. S2CID 1586260.\n^ \"Libratus Poker AI Beats Humans for $1.76m; Is End Near?\". PokerListings. 30 January 2017. Archived from the original on 17 March 2018. Retrieved 16 March 2018.\n^ Solon, Olivia (30 January 2017). \"Oh the humanity! Poker computer trounces humans in big step for AI\". The Guardian. Archived from the original on 8 April 2018. Retrieved 19 March 2018.\n^ \"柯洁迎19岁生日 雄踞人类世界排名第一已两年\" (in Chinese). May 2017. Archived from the original on 11 August 2017. Retrieved 4 September 2021.\n^ \"World's Go Player Ratings\". 24 May 2017. Archived from the original on 1 April 2017. Retrieved 4 September 2021.\n^ \"Google's AlphaGo Continues Dominance With Second Win in China\". Wired. 25 May 2017. Archived from the original on 27 May 2017. Retrieved 4 September 2021.\n^ \"After Win in China, AlphaGo's Designers Explore New AI\". Wired. 27 May 2017. Archived from the original on 2 June 2017. Retrieved 4 September 2021.\n^ \"The Science of Brute Force\". ACM Communications. August 2017. Archived from the original on 29 August 2017. Retrieved 5 October 2018.\n^ \"Dota 2\". Openai Blog. 11 August 2017. Archived from the original on 11 August 2017. Retrieved 7 November 2017.\n^ Greenemeier, Larry (18 October 2017). \"AI versus AI: Self-Taught AlphaGo Zero Vanquishes Its Predecessor\". Scientific American. Archived from the original on 19 October 2017. Retrieved 18 October 2017.\n^ Alibaba's AI Outguns Humans in Reading Test Archived 17 January 2018 at the Wayback Machine. 15 January 2018\n^ Sample, Ian (23 April 2018). \"Scientists plan huge European AI hub to compete with US\". The Guardian (US ed.). Archived from the original on 24 April 2018. Retrieved 23 April 2018.\n^ Pierson, David (2018). \"Should people know they're talking to an algorithm? After a controversial debut, Google now says yes\". Los Angeles Times. Archived from the original on 17 May 2018. Retrieved 17 May 2018.\n^ Sample, Ian (2019). \"AI becomes grandmaster in 'fiendishly complex' StarCraft II\". The Guardian. Archived from the original on 29 December 2020. Retrieved 30 July 2021.\n^ Sterling, Bruce (13 February 2020). \"Web Semantics: Microsoft Project Turing introduces Turing Natural Language Generation (T-NLG)\". Wired. ISSN 1059-1028. Archived from the original on 4 November 2020. Retrieved 31 July 2020.\n^ Sample, Ian (2 December 2018). \"Google's DeepMind predicts 3D shapes of proteins\". The Guardian. Retrieved 19 July 2019.\n^ Brown, Tom B.; Mann, Benjamin; Ryder, Nick; Subbiah, Melanie; Kaplan, Jared; Dhariwal, Prafulla (22 July 2020). \"Language Models are Few-Shot Learners\". arXiv:2005.14165 [cs.CL].\n^ Thompson, Derek (8 December 2022). \"Breakthroughs of the Year\". The Atlantic. Archived from the original on 15 January 2023. Retrieved 18 December 2022.\n^ Scharth, Marcel (5 December 2022). \"The ChatGPT chatbot is blowing people away with its writing skills. An expert explains why it's so impressive\". The Conversation. Archived from the original on 19 January 2023. Retrieved 30 December 2022.\n^ Rachini, Mouhamad (15 December 2022). \"ChatGPT a 'landmark event' for AI, but what does it mean for the future of human labor and disinformation?\". CBC. Archived from the original on 19 January 2023. Retrieved 18 December 2022.\n^ Vincent, James (5 December 2022). \"AI-generated answers temporarily banned on coding Q&A site Stack Overflow\". The Verge. Archived from the original on 17 January 2023. Retrieved 5 December 2022.\n^ Cowen, Tyler (6 December 2022). \"ChatGPT Could Make Democracy Even More Messy\". Bloomberg News. Archived from the original on 7 December 2022. Retrieved 6 December 2022.\n^ \"The Guardian view on ChatGPT: an eerily good human impersonator\". The Guardian. 8 December 2022. Archived from the original on 16 January 2023. Retrieved 18 December 2022.\n^ Vincent, James (8 November 2022). \"The lawsuit that could rewrite the rules of AI copyright\". The Verge. Retrieved 7 December 2022.\n^ Milmo, Dan (2 December 2023). \"ChatGPT reaches 100 million users two months after launch\". The Guardian. ISSN 0261-3077. Archived from the original on 3 February 2023. Retrieved 3 February 2023.\n^ Vincent, James (16 January 2023). \"AI art tools Stable Diffusion and Midjourney targeted with copyright lawsuit\". The Verge.\n^ Korn, Jennifer (17 January 2023). \"Getty Images suing the makers of popular AI art tool for allegedly stealing photos\". CNN. Retrieved 22 January 2023.\n^ \"Getty Images Statement\". newsroom.gettyimages.com/. CNN. 17 January 2023. Retrieved 24 January 2023.\n^ Belanger, Ashley (6 February 2023). \"Getty sues Stability AI for copying 12M photos and imitating famous watermark\". Ars Technica.\n^ Belfield, Haydn (25 March 2023). \"If your AI model is going to sell, it has to be safe\". Vox. Archived from the original on 28 March 2023. Retrieved 30 March 2023.\n^ \"SAT: Understanding Scores\" (PDF). College Board. 2022. Archived (PDF) from the original on 16 March 2023. Retrieved 21 March 2023.\n^ OpenAI (2023). \"GPT-4 Technical Report\". arXiv:2303.08774 [cs.CL].\n^ \"Prepare for truly useful large language models\". Nature Biomedical Engineering. 7 (2): 85–86. 7 March 2023. doi:10.1038/s41551-023-01012-6. PMID 36882584. S2CID 257403466.\n^ Elias, Jennifer (31 January 2023). \"Google is asking employees to test potential ChatGPT competitors, including a chatbot called 'Apprentice Bard'\". CNBC. Archived from the original on 2 February 2023. Retrieved 2 February 2023.\n^ Elias, Jennifer (February 2023). \"Google asks employees to rewrite Bard's bad responses, says the A.I. 'learns best by example'\". CNBC. Archived from the original on 16 February 2023. Retrieved 16 February 2023.\n^ Ortiz, Sabrina (29 March 2023). \"Musk, Wozniak, and other tech leaders sign petition to halt further AI developments\". ZD Net. Retrieved 13 September 2023.\n^ \"Pause Giant AI Experiments: An Open Letter\". Future of Life Institute. Retrieved 13 September 2023.\n^ Lappalainen, Yrjo; Narayanan, Nikesh (14 June 2023). \"Aisha: A Custom AI Library Chatbot Using the ChatGPT API\". Journal of Web Librarianship. 17 (3): 37–58. doi:10.1080/19322909.2023.2221477. ISSN 1932-2909. S2CID 259470901.\n^ \"Statement on AI Risk AI experts and public figures express their concern about AI risk\". Center for AI Safety. Retrieved 14 September 2023.\n^ Edwards, Benj (30 May 2023). \"OpenAI execs warn of \"risk of extinction\" from artificial intelligence in new open letter\". Ars Technica. Retrieved 14 September 2023.\n^ Queen, Jack (10 July 2023). \"Sarah Silverman sues Meta, OpenAI for copyright infringement\". Reuters. Retrieved 14 September 2023.\n^ Bogle, Ariel (24 August 2023). \"New York Times, CNN and Australia's ABC block OpenAI's GPTBot web crawler from accessing content\". The Guardian. Retrieved 14 September 2023.\n^ a b Johnson, Ted (13 September 2023). \"Elon Musk Says \"Something Good Will Come Of This\" After Senate's AI Forum, Chuck Schumer Signals AI Legislation Coming \"In The General Category Of Months\" — Update\". Deadline. Retrieved 13 September 2023.\n^ a b Kang, Cecelia (13 September 2023). \"\"In Show of Force, Silicon Valley Titans Pledge 'Getting This Right' With A.I.\"\". The New York Times. Retrieved 13 September 2023.\n^ Read Out: Heinrich Convenes First Bipartisan Senate AI Insight Forum, 13 September 2023, retrieved 13 September 2023\n^ a b Feiner, Lauren (13 September 2023). \"Elon Musk, Mark Zuckerberg, Bill Gates and other tech leaders in closed Senate session about AI\". CNBC. Retrieved 13 September 2023.\n^ Morrison, Sara (31 October 2023). \"President Biden's new plan to regulate AI. Now comes the hard part: Congress\". Vox News. Retrieved 3 November 2023.\n^ Executive Order on the Safe, Secure, and Trustworthy Development and Use of Artificial Intelligence, 30 October 2023, retrieved 3 November 2023\n^ Milmo, Dan (3 November 2023). \"Hope or Horror? The great AI debate dividing its pioneers\". The Guardian Weekly. pp. 10–12.\n^ \"The Bletchley Declaration by Countries Attending the AI Safety Summit, 1-2 November 2023\". GOV.UK. 1 November 2023. Archived from the original on 1 November 2023. Retrieved 2 November 2023.\n^ \"Countries agree to safe and responsible development of frontier AI in landmark Bletchley Declaration\". GOV.UK (Press release). Archived from the original on 1 November 2023. Retrieved 1 November 2023.\n^ Dillet, Romain (6 February 2025). \"Mistral releases its AI assistant on iOS and Android\". TechCrunch. Retrieved 11 February 2025.\n^ Maccioni, Federico; Saini, Manya; Saba, Yousef; Saini, Manya; Saba, Yousef (15 May 2025). \"UAE to build biggest AI campus outside US in Trump deal, bypassing past China worries\". Reuters. Retrieved 5 June 2025.\n^ \"Amazon prepares to test humanoid robots for deliveries, The Information reports\". Reuters. 5 June 2025. Retrieved 5 June 2025.\n^ \"Paris hosts AI summit, with spotlight on innovation, regulation, creativity\". Radio France Internationale. 6 February 2025. Retrieved 11 February 2025.\n^ Dillet, Romain (11 February 2025). \"As US and UK refuse to sign the Paris AI Action Summit statement, other countries commit to developing 'open, inclusive, ethical' AI\". TechCrunch. Retrieved 11 February 2025.\n^ Milmo, Dan (11 February 2025). \"US and UK refuse to sign Paris summit declaration on 'inclusive' AI\". The Guardian. Retrieved 11 February 2025.\n^ \"Pope Leo XIV urges Catholic technologists to spread the Gospel with AI | USCCB\". www.usccb.org. Retrieved 9 November 2025.\n^ \"Message of the Holy Father to participants in the Second Annual Conference on Artificial Intelligence, Ethics, and Corporate Governance [Rome, 19–20 June 2025] (17 June 2025)\". www.vatican.va. Retrieved 9 November 2025.\nBuchanan, Bruce G. (2005), \"A (Very) Brief History of Artificial Intelligence\" (PDF), AI Magazine, pp. 53–60, archived from the original (PDF) on 26 September 2007, retrieved 30 August 2007\nChristian, Brian (2020). The Alignment Problem: Machine learning and human values. W. W. Norton & Company. ISBN 978-0-393-86833-3. OCLC 1233266753.\nCrevier, Daniel (1993). AI: The Tumultuous Search for Artificial Intelligence. New York, NY: BasicBooks. ISBN 0-465-02997-3.\nLinsky, Bernard; Irvine, Andrew David (Spring 2022). Edward N. Zalta (ed.). \"Principia Mathematica\". The Stanford Encyclopedia of Philosophy.\nMcCorduck, Pamela (2004), Machines Who Think (2nd ed.), Natick, MA: A. K. Peters, Ltd., ISBN 978-1-56881-205-2\nNeedham, Joseph (1986). Science and Civilization in China: Volume 2. Taipei: Caves Books Ltd.\nRussell, Stuart J.; Norvig, Peter. (2021). Artificial Intelligence: A Modern Approach (4th ed.). Hoboken: Pearson. ISBN 978-0134610993. LCCN 20190474.\nSamuel, Arthur L. (July 1959), \"Some studies in machine learning using the game of checkers\", IBM Journal of Research and Development, 3 (3): 210–219, CiteSeerX 10.1.1.368.2254, doi:10.1147/rd.33.0210, S2CID 2126705, archived from the original on 3 March 2016, retrieved 20 August 2007\nSchmidhuber, Jürgen (2022). \"Annotated History of Modern AI and Deep Learning\".\nWong, Matteo (19 May 2023), \"ChatGPT Is Already Obsolete\", The Atlantic\nBerlinski, David (2000), The Advent of the Algorithm, Harcourt Books\nBrooks, Rodney (1990), \"Elephants Don't Play Chess\" (PDF), Robotics and Autonomous Systems, 6 (1–2): 3–15, CiteSeerX 10.1.1.588.7539, doi:10.1016/S0921-8890(05)80025-9, retrieved 30 August 2007\nDarrach, Brad (20 November 1970), \"Meet Shakey, the First Electronic Person\", Life Magazine, pp. 58–68\nDoyle, J. (1983), \"What is rational psychology? Toward a modern mental philosophy\", AI Magazine, vol. 4, no. 3, pp. 50–53\nDreyfus, Hubert (1972), What Computers Can't Do, MIT Press\nFeigenbaum, Edward A.; McCorduck, Pamela (1983), The Fifth Generation: Artificial Intelligence and Japan's Computer Challenge to the World, Michael Joseph, ISBN 978-0-7181-2401-4\nFeigenbaum, Edward; Feldman, Julian, eds. (1963), Computers and thought (1 ed.), New York: McGraw-Hill, OCLC 593742426\nHobbes (1651), Leviathan\nHofstadter, Douglas (1980), Gödel, Escher, Bach: an Eternal Golden Braid\nHowe, J. (November 1994), Artificial Intelligence at Edinburgh University: a Perspective, retrieved 30 August 2007\nKaplan, Andreas; Haenlein, Michael (2018), \"Siri, Siri in my Hand, who's the Fairest in the Land? On the Interpretations, Illustrations and Implications of Artificial Intelligence\", Business Horizons, 62: 15–25, doi:10.1016/j.bushor.2018.08.004, S2CID 158433736\nKurzweil, Ray (2005), The Singularity is Near, Viking Press\nLakoff, George (1987), Women, Fire, and Dangerous Things: What Categories Reveal About the Mind, University of Chicago Press., ISBN 978-0-226-46804-4\nLenat, Douglas; Guha, R. V. (1989), Building Large Knowledge-Based Systems, Addison-Wesley\nLevitt, Gerald M. (2000), The Turk, Chess Automaton, Jefferson, N.C.: McFarland, ISBN 978-0-7864-0778-1\nLighthill, Professor Sir James (1973), \"Artificial Intelligence: A General Survey\", Artificial Intelligence: a paper symposium, Science Research Council\nLucas, John (1961), Minds, Machines and Gödel, archived from the original on 19 August 2007, retrieved 24 July 2007\nMcCarthy, John; Minsky, Marvin; Rochester, Nathan; Shannon, Claude (1955), A Proposal for the Dartmouth Summer Research Project on Artificial Intelligence, archived from the original on 26 August 2007\nMcCarthy, John; Hayes, P. J. (1969), \"Some philosophical problems from the standpoint of artificial intelligence\", Machine Intelligence, 4: 463–502\nMcCullough, W. S.; Pitts, W. (1943), \"A logical calculus of the ideas immanent in nervous activity\", Bulletin of Mathematical Biophysics, 5 (4): 115–127, Bibcode:1943BMaB....5..115M, doi:10.1007/BF02478259\nMinsky, Marvin (1967), Computation: Finite and Infinite Machines, Englewood Cliffs, N.J.: Prentice-Hall\nMinsky, Marvin; Seymour Papert (1969), Perceptrons: An Introduction to Computational Geometry, The MIT Press\nMinsky, Marvin (1974), A Framework for Representing Knowledge, archived from the original on 7 January 2021, retrieved 27 December 2007\nMinsky, Marvin (1986), The Society of Mind, Simon and Schuster\nMoravec, Hans (1976), The Role of Raw Power in Intelligence\nMoravec, Hans (1988), Mind Children, Harvard University Press\nUnited States National Research Council (1999), \"Developments in Artificial Intelligence\", Funding a Revolution: Government Support for Computing Research, National Academy Press, retrieved 30 August 2007\nNewell, Allen; Simon, H. A. (1963), \"GPS: A Program that Simulates Human Thought\", in Feigenbaum, Edward; Feldman, Julian (eds.), Computers and Thought, New York: McGraw-Hill\nNewquist, HP (1994), The Brain Makers: Genius, Ego, And Greed In The Quest For Machines That Think, New York: Macmillan/SAMS, ISBN 978-0-9885937-1-8\nPearl, J. (1988), Probabilistic Reasoning in Intelligent Systems: Networks of Plausible Inference, San Mateo, California: Morgan Kaufmann\nRussell, Stuart J.; Norvig, Peter (2003), Artificial Intelligence: A Modern Approach (2nd ed.), Upper Saddle River, New Jersey: Prentice Hall, ISBN 0-13-790395-2\nPoole, David; Mackworth, Alan; Goebel, Randy (1998), Computational Intelligence: A Logical Approach, Oxford University Press., ISBN 978-0-19-510270-3\nSearle, John (1980), \"Minds, Brains and Programs\" (PDF), Behavioral and Brain Sciences, 3 (3): 417–457, doi:10.1017/S0140525X00005756, S2CID 55303721\nSimon, H. A.; Newell, Allen (1958), \"Heuristic Problem Solving: The Next Advance in Operations Research\", Operations Research, 6 (1): 1, doi:10.1287/opre.6.1.1\nSimon, H. A. (1965), The Shape of Automation for Men and Management, New York: Harper & Row\nTuring, Alan (1936–1937), \"On Computable Numbers, with an Application to the Entscheidungsproblem\", Proceedings of the London Mathematical Society, 2, s2-42 (42): 230–265, doi:10.1112/plms/s2-42.1.230, S2CID 73712\nTuring, Alan (October 1950), \"Computing machinery and intelligence\", Mind, LIX (236): 433–60, doi:10.1093/mind/LIX.236.433, archived from the original on 2 July 2008\nWeizenbaum, Joseph (1976), Computer Power and Human Reason, W.H. Freeman & Company\n\"The history of artificial intelligence: Complete AI timeline\", Enterprise AI, TechTarget, 16 August 2023\n\"Brief History (timeline)\", AI Topics, Association for the Advancement of Artificial Intelligence\nWomen in computing\nArtificial intelligence\nMachine learning\nQuantum computing and communication\nFree and open-source software\nHypertext technology\nOperating systems\nDOS family\nWindows\nLinux\nProgramming languages\nVirtualization development\nInternet conflicts\nWeb search engines\nKathleen Antonelli\nJohn Vincent Atanasoff\nEdsger W. Dijkstra\nJ. Presper Eckert\nDouglas Engelbart\nMargaret Hamilton\nDavid A. Huffman\nJohn von Neumann\nKlára Dán von Neumann\nGuido van Rossum\nBjarne Stroustrup"
}